{"id":115,"key":"Ziggs","name":"Ziggs","title":"the Hexplosives Expert","lore":"Ziggs was born with a talent for tinkering, but his chaotic, hyperactive nature was unusual among yordle scientists. Aspiring to be a revered inventor like Heimerdinger, he rattled through ambitious projects with manic zeal, emboldened by both his explosive failures and his unprecedented discoveries. Word of Ziggs' volatile experimentation reached the famed Yordle Academy in Piltover and its esteemed professors invited him to demonstrate his craft. His characteristic disregard for safety brought the presentation to an early conclusion, however, when the hextech engine Ziggs was demonstrating overheated and exploded, blowing a huge hole in the wall of the Academy. The professors dusted themselves off and sternly motioned for him to leave. Devastated, Ziggs prepared to return to Bandle City in shame. However, before he could leave, a group of Zaunite agents infiltrated the Academy and kidnapped the professors. The Piltover military tracked the captives to a Zaunite prison, but their weapons were incapable of destroying the fortified walls. Determined to outdo them, Ziggs began experimenting on a new kind of armament, and quickly realized that he could harness his accidental gift for demolition to save the captured yordles.\u003Cbr\u003E\u003Cbr\u003EBefore long, Ziggs had created a line of powerful bombs he lovingly dubbed ''hexplosives.'' With his new creations ready for their first trial, Ziggs traveled to Zaun and sneaked into the prison compound. He launched a gigantic bomb at the prison and watched with glee as the explosion tore through the reinforced wall. Once the smoke had cleared, Ziggs scuttled into the facility, sending guards running with a hail of bombs. He rushed to the cell, blew the door off its hinges, and led the captive yordles to freedom. Upon returning to the Academy, the humbled professors recognized Ziggs with an honorary title - Dean of Demolitions - and proposed that he demonstrate this new form of yordle ingenuity in the League of Legends. Vindicated at last, Ziggs accepted the proposal, eager to bring his ever-expanding range of hexplosives to the greatest testing grounds in the world: the Fields of Justice.\u003Cbr\u003E\u003Cbr\u003E''Ziggs? Unpredictable, dangerous, yes yes. But quite brilliant!''\u003Cbr\u003E-- Heimerdinger","skins":[{"id":115000,"name":"default","num":0},{"id":115001,"name":"Mad Scientist Ziggs","num":1},{"id":115002,"name":"Major Ziggs","num":2},{"id":115003,"name":"Pool Party Ziggs","num":3},{"id":115004,"name":"Snow Day Ziggs","num":4},{"id":115005,"name":"Master Arcanist Ziggs","num":5}],"allytips":["Even if you're far from a fight you can still help from afar with Mega Inferno Bomb.","Slowing your enemies with Hexplosive Minefield makes it easier to land other abilities.","Knocking yourself over walls with Satchel Charge can be great when chasing after or escaping from enemies."],"enemytips":["Don't step on Ziggs' mines! They'll slow you and make it much easier for him to hit you with his other abiltiies.","Many of Ziggs' abilities have long cooldowns. Try catching him just after he's used his abilities.","Ziggs' ultimate, Mega Inferno Bomb, deals more damage in the center of the explosion."],"tags":["Mage"],"info":{"attack":2,"defense":4,"magic":9,"difficulty":4},"stats":{"arm":21.544,"ad":54.208,"aso":-0.0473,"crit":0,"hp":524.4,"mp":384,"mp5":6,"hp5":6.258,"range":550,"ms":325,"mr":30,"lvl":{"arm":3.3,"ad":3.1,"aso":2,"crit":0,"hp":80,"mp":47,"mp5":0.8,"hp5":0.6,"mr":0}},"pass":{"name":"Short Fuse","descr":"Every 12 seconds, Ziggs' next basic attack deals bonus magic damage. This cooldown is reduced whenever Ziggs uses an ability.","img":"ZiggsPassiveReady.png"},"spells":[{"name":"Bouncing Bomb","descr":"Ziggs throws a bouncing bomb that deals magic damage.","tooltip":"Ziggs throws a bouncing bomb that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.","cost":[50,55,60,65,70],"costType":" Mana","cd":[6,5.5,5,4.5,4],"range":[850,850,850,850,850],"key":"ZiggsQ"},{"name":"Satchel Charge","descr":"Ziggs flings an explosive charge that detonates after 4 seconds, or when this ability is activated again. The explosion deals magic damage to enemies, knocking them away. Ziggs is also knocked away, but takes no damage. Ziggs can use the Satchel to hexplode vulnerable enemy turrets.","tooltip":"Ziggs flings an explosive charge that detonates after {{ e2 }} seconds, or when this ability is activated again. The explosion deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies, knocking them away. Ziggs is also knocked away, but takes no damage.\u003Cbr\u003E\u003Cbr\u003ESatchel Charge will \u003Cspan class=\"colorD41919\"\u003Ehexplode\u003C\/span\u003E structurally unsound towers below {{ f1*100 }}% of their Health.","cost":[65,65,65,65,65],"costType":" Mana","cd":[26,24,22,20,18],"range":[1000,1000,1000,1000,1000],"key":"ZiggsW"},{"name":"Hexplosive Minefield","descr":"Ziggs scatters proximity mines that detonate on enemy contact, dealing magic damage and slowing.","tooltip":"Ziggs scatters proximity mines that detonate on enemy contact, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. Enemies hit are slowed by {{ e2 }}% for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EEnemies triggering a mine take {{ e5 }}% damage from additional mines. Mines disarm automatically after {{ e3 }} seconds.","cost":[70,80,90,100,110],"costType":" Mana","cd":[16,16,16,16,16],"range":[900,900,900,900,900],"key":"ZiggsE"},{"name":"Mega Inferno Bomb","descr":"Ziggs deploys his ultimate creation, the Mega Inferno Bomb, hurling it an enormous distance. Enemies in the primary blast zone take more damage than those farther away. ","tooltip":"Ziggs deploys his ultimate creation, the Mega Inferno Bomb, hurling it an enormous distance. Enemies in the primary blast zone take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. Enemies farther away take two-thirds damage.","cost":[100,100,100],"costType":" Mana","cd":[120,105,90],"range":[5000,5000,5000],"key":"ZiggsR"}]}