{"id":54,"key":"Malphite","name":"Malphite","title":"Shard of the Monolith","lore":"There is a world of perfect harmony, where all are part of the whole. The Monolith is the essence of all creation, and its denizens are but singular pieces of it. It is beautiful in its symmetry, and in its almost complete lack of uncertainty. The rocky beings that live there know their place and work to fulfill their duties to the fullest extent, functioning almost as a superorganism or hive. Malphite has always strived to live up to his full potential, as his own personal part of the whole, serving the role of a distinguished creature questing to enforce his people's flawless vision of order.\u003Cbr\u003E\u003Cbr\u003EOne day, without warning, a dimensional rift opened, and he was summoned across the cosmos to the world of Runeterra. The transition was painful and terrifying for him, as he was cut off from the song of his people and the Monolith - things that had been ever-present in him since the day he was born. He raged, trapped in the Summoning Circle, as those who had called him made their plea. Runeterra was a world that had nearly been consumed by its disharmony. It was a world that needed champions to bring order out of chaos. It was to that end that the rock-creature was summoned, so that he could aid them in this quest. Looking past his own fear and apprehension, Malphite could see that this was a respectable goal, and one in which he could participate - perhaps uniquely so. Today, as part of the League of Legends, he hammers those who would seek to upset Valoran's movement toward order, especially turning his attention to those that wield chaotic magic. Unfortunately, Malphite has also begun to change, as he has been forced to face his own profound loneliness among the world's vibrant individuality.\u003Cbr\u003E\u003Cbr\u003EBeware, minions of chaos! The Shard of the Monolith has come.","skins":[{"id":54000,"name":"default","num":0},{"id":54001,"name":"Shamrock Malphite","num":1},{"id":54002,"name":"Coral Reef Malphite","num":2},{"id":54003,"name":"Marble Malphite","num":3},{"id":54004,"name":"Obsidian Malphite","num":4},{"id":54005,"name":"Glacial Malphite","num":5},{"id":54006,"name":"Mecha Malphite","num":6},{"id":54007,"name":"Ironside Malphite","num":7}],"allytips":["Armor naturally reduces the rate that attacks go through Granite Shield, so Brutal Strikes will strengthen the shield against physical damage.","Despite his abilities scaling on Armor, some games require Malphite to get Magic Resist. When those games occur, try getting Aegis of the Legion, Mercury's Treads, and Guardian Angel."],"enemytips":["If you're a physical damage character stay behind your allies when fighting Malphite. Ground Slam can significantly reduce your damage output.","Malphite is one of a couple tanks who are capable of jungling. Watch out if he gets Smite."],"tags":["Tank","Fighter"],"info":{"attack":5,"defense":9,"magic":7,"difficulty":2},"stats":{"arm":28.3,"ad":61.97,"aso":-0.02,"crit":0,"hp":574.2,"mp":282.2,"mp5":7.324,"hp5":7,"range":125,"ms":335,"mr":32.1,"lvl":{"arm":3.75,"ad":3.375,"aso":3.4,"crit":0,"hp":90,"mp":40,"mp5":0.55,"hp5":0.55,"mr":1.25}},"pass":{"name":"Granite Shield","descr":"Malphite is shielded by a layer of rock which absorbs damage up to 10% of his maximum Health. If Malphite has not been hit for 10 seconds, this effect recharges.","img":"Malphite_GraniteShield.png"},"spells":[{"name":"Seismic Shard","descr":"Using his primal elemental magic, Malphite sends a shard of the earth through the ground at his foe, dealing damage upon impact and stealing Movement Speed for 4 seconds.","tooltip":"Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and steals {{ e2 }}% Movement Speed from the target for {{ e3 }} seconds.","cost":[70,75,80,85,90],"costType":" Mana","cd":[8,8,8,8,8],"range":[625,625,625,625,625],"key":"MalphiteQ"},{"name":"Brutal Strikes","descr":"Malphite starts to hit with such force that his attacks deal damage to all units in front of him. Passively increases his Armor.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EMalphite's armor is increased by {{ e1 }}% (\u003Cspan class=\"colorFFFF00\"\u003E{{ f1 }}\u003C\/span\u003E).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EBasic attacks deal an additional {{ e2 }} \u003Cspan class=\"colorFFFF00\"\u003E(+{{ f2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to the target and nearby enemies. Lasts {{ e3 }} seconds.","cost":[25,25,25,25,25],"costType":" Mana","cd":[12,12,12,12,12],"range":[400,400,400,400,400],"key":"MalphiteW"},{"name":"Ground Slam","descr":"Malphite slams the ground, sending out a shockwave that deals magic damage based on his Armor as damage and reduces the Attack Speed of enemies for a short duration.","tooltip":"Malphite slams the ground dealing {{ e2 }} \u003Cspan class=\"colorFFFF00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to surrounding enemies, reducing their Attack Speed by {{ e1 }}% for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EThis ability gains damage equal to {{ e3 }}% of Malphite's Armor.","cost":[50,55,60,65,70],"costType":" Mana","cd":[7,7,7,7,7],"range":[400,400,400,400,400],"key":"MalphiteE"},{"name":"Unstoppable Force","descr":"Malphite ferociously charges to a location, damaging enemies and knocking them into the air.","tooltip":"Malphite charges to target area. Upon his arrival he deals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and knocks them into the air for {{ e3 }} seconds.","cost":[100,100,100],"costType":" Mana","cd":[130,115,100],"range":[1000,1000,1000],"key":"MalphiteR"}]}