{"id":25,"key":"Morgana","name":"Morgana","title":"Fallen Angel","lore":"There is a world far away populated by graceful and beautiful winged beings gifted with immortality, where an ancient conflict still rages. Like so many conflicts, this war split families. One side proclaimed themselves as beings of perfect order and justice, fighting to unite the world under their law and strong central governance. Those that fought against them saw their kin as tyrants, creatures incapable of seeing the larger view, who would sacrifice individuality and freedom for the illusion of efficiency and safety. Morgana was one who fought against what she perceived as the tyranny of her kind, and for that she was branded ''fallen.'' Morgana was not innocent, having plumbed forgotten ways to gather forbidden might to become a powerful mistress of the black arts. This goal was driven by her obsession to defeat the general of the opposition's army - her sister, Kayle.\u003Cbr\u003E\u003Cbr\u003EWhile the two were in fact birth-sisters, Kayle struck the first blow by disowning any filial connection when Morgana refused to join her cause. Eventually, Morgana grew in power enough to not only reach, but challenge Kayle. As the time approached when the two would meet in what could be their final conflict, Morgana was suddenly summoned to Valoran. At first, Morgana made a deal with the League's summoners to fight in exchange for greater power. With the advent of Kayle into the League, Morgana now willingly fights in the League of Legends for the privilege of being able to destroy her sister again, and again, and again. She lies in wait for the day the bonds of the Institute of War no longer hold her, and on that day she plans to destroy Kayle once and for all and return home a hero.\u003Cbr\u003E\u003Cbr\u003E''There is no rest while Kayle's brand of tyranny still exists.''\u003Cbr\u003E-- Morgana","skins":[{"id":25000,"name":"default","num":0},{"id":25001,"name":"Exiled Morgana","num":1},{"id":25002,"name":"Sinful Succulence Morgana","num":2},{"id":25003,"name":"Blade Mistress Morgana","num":3},{"id":25004,"name":"Blackthorn Morgana","num":4},{"id":25005,"name":"Ghost Bride Morgana","num":5},{"id":25006,"name":"Victorious Morgana","num":6},{"id":25010,"name":"Lunar Wraith Morgana","num":10},{"id":25011,"name":"Bewitching Morgana","num":11}],"allytips":["Shrewd use of Black Shield can determine the outcome of team fights.","Items that provide survivability allow Morgana to become extremely difficult to kill in conjunction with Black Shield and Soul Shackles.","Tormented Soil is an excellent farming tool if you're by yourself in a lane."],"enemytips":["Tormented Soil deals tons of damage to units missing large amounts of Health. When low on Health, be wary of Morgana's attempts to trap you within its reach.","Morgana often needs to land Dark Binding to setup her other attacks. Use your minions as shields against Dark Binding."],"tags":["Mage","Support"],"info":{"attack":1,"defense":6,"magic":8,"difficulty":1},"stats":{"arm":25.384,"ad":55.46,"aso":0,"crit":0,"hp":547.48,"mp":340.8,"mp5":8.5,"hp5":5.708,"range":450,"ms":335,"mr":30,"lvl":{"arm":3.8,"ad":3.5,"aso":1.53,"crit":0,"hp":86,"mp":60,"mp5":0.8,"hp5":0.6,"mr":0}},"pass":{"name":"Soul Siphon","descr":"Morgana has Spell Vamp, healing herself whenever she deals damage with her spells.","img":"FallenAngel_Empathize.png"},"spells":[{"name":"Dark Binding","descr":"Morgana releases a sphere of dark magic. Upon contact with an enemy unit, the sphere will deal magic damage and force the unit to the ground for a period of time.","tooltip":"Fires a bolt of dark energy, rooting the first enemy hit for {{ e2 }} seconds and dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.","cost":[50,55,60,65,70],"costType":" Mana","cd":[11,11,11,11,11],"range":[1175,1175,1175,1175,1175],"key":"MorganaQ"},{"name":"Tormented Soil","descr":"Infects an area with desecrated soil, causing enemy units who stand on the location to take continual damage.","tooltip":"Curses an area for {{ e7 }} seconds. Enemies on the cursed ground are dealt\u003Cbr\u003Efrom {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E to {{ e6 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage every second based on the enemy's missing Health.","cost":[70,85,100,115,130],"costType":" Mana","cd":[10,10,10,10,10],"range":[900,900,900,900,900],"key":"MorganaW"},{"name":"Black Shield","descr":"Places a protective barrier around an allied champion, absorbing magical damage and disables until penetrated or the shield dissipates.","tooltip":"Shields an allied Champion for {{ e2 }} seconds. The shield absorbs {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and prevents disables until it breaks.","cost":[50,50,50,50,50],"costType":" Mana","cd":[23,21,19,17,15],"range":[800,800,800,800,800],"key":"MorganaE"},{"name":"Soul Shackles","descr":"Latches chains of energy onto nearby enemy champions, dealing initial damage to them and slowing their Movement Speed, and then echoing the pain a few seconds later and stunning them if they remain close to Morgana.","tooltip":"Dark chains latch onto nearby enemy Champions dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slowing them by {{ e4 }}% for {{ e3 }} seconds, granting \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E. After {{ e3 }} seconds, they are dealt an additional {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are stunned for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EEnemy Champions can break the chains by moving away from Morgana.","cost":[100,100,100],"costType":" Mana","cd":[120,110,100],"range":[625,625,625],"key":"MorganaR"}]}