{"id":420,"key":"Illaoi","name":"Illaoi","title":"the Kraken Priestess","lore":"''I'm not big on sermons. Broken bones teach better lessons.''\u003Cbr\u003EIllaoi's powerful physique is dwarfed only by her indomitable faith. As the prophet of the Great Kraken, she uses a huge, golden idol to rip her foes' spirits from their bodies and shatter their perception of reality. All who challenge the ''Truth Bearer of Nagakabouros'' soon discover Illaoi never battles alone - the god of the Serpent Isles fights by her side.","skins":[{"id":420000,"name":"default","num":0},{"id":420001,"name":"Void Bringer Illaoi","num":1}],"allytips":["Tentacles are an immense source of power. Don't fight without them.","Spirits inherit their target's current health. If making a ","Vessel"," is your goal, try whittling your opponent's health down a bit first to make killing the spirit easier.","Leap of Faith is best used to follow-up a strong engage or when being engaged upon. Be careful about being the first one into a fight."],"enemytips":["Killing Tentacles whenever possible will make it much easier to win a fight against Illaoi.","When your spirit gets pulled out, fight back if you can. Dealing damage to Illaoi reduces the spirit's duration.","Avoid grouping up for Leap of Faith to reduce the number of Tentacles available to Illaoi."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":6,"magic":3,"difficulty":4},"stats":{"arm":26,"ad":60,"aso":0,"crit":0,"hp":585.6,"mp":300,"mp5":7.5,"hp5":9.5,"range":125,"ms":340,"mr":32.1,"lvl":{"arm":3.8,"ad":5,"aso":2.5,"crit":0,"hp":95,"mp":40,"mp5":0.75,"hp5":0.8,"mr":1.25}},"pass":{"name":"Prophet of an Elder God","descr":"Illaoi and the \u003Cfont color='#669900'\u003EVessels\u003C\/font\u003E she creates spawn Tentacles on nearby impassible terrain. Tentacles swing at spirits, \u003Cfont color='#669900'\u003EVessels\u003C\/font\u003E, and victims of Illaoi's Harsh lesson. Tentacles deal physical damage to enemies hit, and will heal Illaoi if they damage a champion.","img":"Illaoi_P.png"},"spells":[{"name":"Tentacle Smash","descr":"Increases the damage dealt by Tentacles. When activated, Illaoi smashes down a Tentacle that deals physical damage.","tooltip":"\u003Cspan class=\"colorFF8C00\"\u003EPassive:\u003C\/span\u003E \u003Cspan class=\"color85FFAD\"\u003ESlam\u003C\/span\u003E damage is increased by {{ e6 }}% (\u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF8C00\"\u003EActive:\u003C\/span\u003E Illaoi swings her idol, causing a Tentacle to \u003Cspan class=\"color85FFAD\"\u003ESlam\u003C\/span\u003E forward.","cost":[40,45,50,55,60],"costType":" Mana","cd":[10,9,8,7,6],"range":[850,850,850,850,850],"key":"IllaoiQ"},{"name":"Harsh Lesson","descr":"Illaoi leaps to her target, dealing physical damage and causing nearby Tentacles to also swing at the target.","tooltip":"Illaoi leaps at her target on her next basic attack, dealing bonus physical damage equal to \u003Cspan class=\"colorFF8C00\"\u003E{{ f1*100 }}%\u003C\/span\u003E of their maximum health [{{ e1 }}% + {{ f2*100 }}% per 100 attack damage].\u003Cbr\u003E\u003Cbr\u003EWhen she strikes, nearby Tentacles will \u003Cspan class=\"color85FFAD\"\u003ESlam\u003C\/span\u003E at the target.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003EHarsh Lesson's bonus damage against monsters is capped at {{ e3 }} damage per hit.\u003C\/i\u003E\u003C\/span\u003E","cost":[30,30,30,30,30],"costType":" Mana","cd":[4,4,4,4,4],"range":[400,400,400,400,400],"key":"IllaoiW"},{"name":"Test of Spirit","descr":"Illaoi rips the spirit from a foe's body, forcing it to stand before her. Spirits echo a percentage of the damage they take to the original target. If killed, or if the target gets too far from the spirit, the target will become a \u003Cfont color='#669900'\u003EVessel\u003C\/font\u003E and begin spawning Tentacles.","tooltip":"Illaoi pulls the spirit from an enemy champion for {{ e3 }} seconds (reduced when Illaoi is attacked by the target). The spirit can be attacked, with {{ e1 }}% \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f5 }}%)\u003C\/span\u003E of the damage taken echoing to its owner.\u003Cbr\u003E\u003Cbr\u003EIf the spirit dies or the target leaves its range, the target becomes a \u003Cspan class=\"color669900\"\u003EVessel\u003C\/span\u003E for {{ e2 }} seconds and is slowed by {{ e8 }}% for {{ e5 }} seconds. \u003Cspan class=\"color669900\"\u003EVessels\u003C\/span\u003E spawn Tentacles every \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E seconds if no other Tentacles are nearby.\u003Cbr\u003E\u003Cbr\u003ETentacles will automatically \u003Cspan class=\"color85FFAD\"\u003ESlam\u003C\/span\u003E at spirits and \u003Cspan class=\"color669900\"\u003EVessels\u003C\/span\u003E once every 10 seconds.","cost":[35,40,45,50,55],"costType":" Mana","cd":[0,0,0,0,0],"range":[900,900,900,900,900],"key":"IllaoiE"},{"name":"Leap of Faith","descr":"Illaoi smashes her idol into the ground, dealing physical damage to nearby enemies. A Tentacle spawns for each enemy champion hit.","tooltip":"Illaoi smashes her idol into the ground, dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to nearby enemies and spawning a Tentacle for each enemy champion hit.\u003Cbr\u003E\u003Cbr\u003EFor the next {{ e1 }} seconds Tentacles are untargetable and will \u003Cspan class=\"color85FFAD\"\u003ESlam\u003C\/span\u003E 50% faster, and Harsh Lesson has a 2 second cooldown.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorcccccc\"\u003E\u003Ci\u003E'There are kind and gentle gods. Mine isn't one of those.'\u003C\/i\u003E\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[120,105,90],"range":[450,450,450],"key":"IllaoiR"}]}