{"id":164,"key":"Camille","name":"Camille","title":"the Steel Shadow","lore":"Weaponized to execute outside the boundaries of the law, Camille Ferros is an elegant and elite operative who ensures the commerce of the Piltover machine with its Zaunite underbelly runs smoothly. Raised among manners and money, she is the Principal Intelligencer of House Ferros, and runs down the family's darker problems with surgical precision. Others in Piltover may carry hex-tech, but Camille's single-minded devotion to her profession has left many to wonder if she is more machine than woman. With a mind as sharp as the blades she bears, Camille is adaptable and patient, viewing chaos and sloppy technique as a thing that must be put to order.","skins":[{"id":164000,"name":"default","num":0},{"id":164001,"name":"Program Camille","num":1}],"allytips":["Try waiting until the other team is distracted with fighting your team, and use Hookshot to pick off vulnerable targets.","Use the CC from your abilities to land both of your Precision Protocol attacks on enemies."],"enemytips":["Camille's shield only works against one damage type, so hit her when she's vulnerable to your damage.","The Hextech Ultimatum has a very short range to cast, so try to flash away from her before she gets close."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":6,"magic":3,"difficulty":4},"stats":{"arm":26,"ad":60,"aso":0,"crit":0,"hp":575.6,"mp":338.8,"mp5":8.15,"hp5":8.5,"range":125,"ms":340,"mr":32.1,"lvl":{"arm":3.8,"ad":3.5,"aso":2.5,"crit":0,"hp":85,"mp":32,"mp5":0.75,"hp5":0.8,"mr":1.25}},"pass":{"name":"Adaptive Defenses","descr":"Basic attacks on champions grant a shield equal to 20% of Camille's maximum health against their damage type (Physical or Magic) for 1.5-2.5 seconds.\u003Cbr\u003E\u003Cbr\u003EThis effect has a 20-10 second cooldown.","img":"Camille_Passive.png"},"spells":[{"name":"Precision Protocol","descr":"Camille's next attack deals bonus damage and grants bonus movement speed. This spell can be recast for a short period of time, doing significantly increased bonus damage if Camille delays a period of time between the two attacks.","tooltip":"Camille's next basic attack deals \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E bonus physical damage and increases her movement speed by {{ e4 }}% for {{ e5 }} second. This ability can be recast in the next {{ e1 }} seconds at no cost.\u003Cbr\u003E\u003Cbr\u003EIf the second Precision Protocol attack hits at least {{ e1 }} seconds after the first, the bonus damage is increased by {{ e8 }}% to \u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E and \u003Cspan class=\"colorFFFFFF\"\u003E{{ f3 }}%\u003C\/span\u003E of the attack is converted into true damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"size16 colorFFEB7F\"\u003E16","cost":[25,25,25,25,25],"costType":" Mana","cd":[9,8.25,7.5,6.75,6],"range":[325,325,325,325,325],"key":"CamilleQ"},{"name":"Tactical Sweep","descr":"Camille blasts in a cone after a delay, dealing damage. Enemies in the outer half are slowed and take extra damage, while also healing Camille.","tooltip":"Camille winds up and then slices in a direction, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage to enemies hit.\u003Cbr\u003E\u003Cbr\u003EEnemies hit by the outer half are slowed by {{ e4 }}%, decaying over {{ e2 }} seconds. They take extra physical damage equal to {{ e5 }}% (\u003Cspan class=\"colorFF8C00\"\u003E+{{ f2 }}\u003C\/span\u003E%) of their maximum health, healing Camille for {{ e9 }}% of the bonus damage dealt (healing capped at \u003Cspan class=\"colorCC3300\"\u003E{{ f3 }}\u003C\/span\u003E from non-champions).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"size16 colorFFEB7F\"\u003E16","cost":[50,55,60,65,70],"costType":" Mana","cd":[15,13.5,12,10.5,9],"range":[610,610,610,610,610],"key":"CamilleW"},{"name":"Hookshot","descr":"Camille pulls herself to a wall, leaping off and knocking up enemies upon landing.","tooltip":"\u003Cspan class=\"colorFF8C00\"\u003EFirst Cast:\u003C\/span\u003E Fire a hookshot that attaches to terrain, pulling Camille to it and allowing Hookshot to be recast for 1 second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF8C00\"\u003ESecond Cast:\u003C\/span\u003E Camille leaps from the wall, colliding with the first enemy champion hit. Upon landing, she deals {{ e3 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and a {{ e1 }} second stun to nearby enemies. Dashes towards enemy champions travel twice as far and grant {{ e2 }}% attack speed for {{ e5 }} seconds on impact.","cost":[70,70,70,70,70],"costType":" Mana","cd":[16,14.5,13,11.5,10],"range":[800,800,800,800,800],"key":"CamilleE"},{"name":"The Hextech Ultimatum","descr":"Camille dashes to target champion, anchoring them to the area. She also deals bonus magic damage to the target with her basic attacks.","tooltip":"Camille briefly becomes untargetable and leaps onto an enemy champion, interrupting channels and locking them into an area they cannot escape by any means for {{ e3 }} seconds. Other nearby enemies are knocked away. Her basic attacks against the trapped enemy deal bonus magic damage equal to {{ e2 }} plus {{ e1 }}% of their current health.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"size16 colorFFEB7F\"\u003E16","cost":[100,100,100],"costType":" Mana","cd":[140,115,90],"range":[475,475,475],"key":"CamilleR"}]}