{"id":76,"key":"Nidalee","name":"Nidalee","title":"the Bestial Huntress","lore":"There are few dwellers, let alone champions, residing in the blasted and dangerous lands that lie south of the Great Barrier. Much of that world still bears the scars of past Runes Wars, especially the mysterious Kumungu Jungle. There are long-forgotten treasures in these strange places which many risk life and limb to acquire. Nidalee was only a young girl travelling with her treasure-seeking parents when they lost their way in the dense, rainy jungles. The jungle was unforgiving, and she watched her parents suffer agonizing final days as they fell victim to a mysterious and vicious disease.\u003Cbr\u003E\u003Cbr\u003EAs improbable as it was for a child to survive in the inhospitable jungle by herself, she did just that. Her youthful innocence and a fortunate naivete caused her to appeal to the beasts of that place and she was taken in by a family of cougars and raised as one of their own. She grew and somehow absorbed the raw magic of the dense wilds, evolving beyond both her human physiology and her feline affectation. Now a fierce, nigh-mythical protector,  Nidalee battles  viciously tooth and nail against any who would threaten the vast jungle she calls home.","skins":[{"id":76000,"name":"default","num":0},{"id":76001,"name":"Snow Bunny Nidalee","num":1},{"id":76002,"name":"Leopard Nidalee","num":2},{"id":76003,"name":"French Maid Nidalee","num":3},{"id":76004,"name":"Pharaoh Nidalee","num":4},{"id":76005,"name":"Bewitching Nidalee","num":5},{"id":76006,"name":"Headhunter Nidalee","num":6},{"id":76007,"name":"Warring Kingdoms Nidalee","num":7},{"id":76008,"name":"Challenger Nidalee","num":8}],"allytips":["Use brush to your advantage! Moving in and out of brush can heavily alter your effectiveness in battle.","Start team fights by harassing with your Javelin Toss, and then switch to cougar form to chase down Hunted targets.","Bushwhack traps deal damage based on their victim's current Health. Set them up in your team's backline before fights break out during sieges to help your team deal damage to the enemy frontline."],"enemytips":["Nidalee's Hunt debuff is only applied with Javelin Toss and Bushwhack. Avoiding being hit by these abilities will impair her ability to deal follow-up damage.","Nidalee's Javelin Toss deals more damage the farther she is. If she is far away, it's imperative to dodge it.","Nidalee's Takedown deals extreme damage to Hunted targets, but she has to get close to use it. Save your crowd control or defensive abilities for when she goes in for the kill."],"tags":["Assassin","Fighter"],"info":{"attack":5,"defense":4,"magic":7,"difficulty":8},"stats":{"arm":22.88,"ad":53,"aso":-0.02,"crit":0,"hp":540,"mp":295.6,"mp5":6,"hp5":6.008,"range":525,"ms":335,"mr":30,"lvl":{"arm":3.5,"ad":3.5,"aso":3.22,"crit":0,"hp":80,"mp":45,"mp5":0.8,"hp5":0.6,"mr":0}},"pass":{"name":"Prowl","descr":"Moving through brush increases Nidalee's Movement Speed by 10% for 2 seconds, increased to 30% toward visible enemy champions within 1400 range.\u003Cbr\u003E\u003Cbr\u003EHitting champions or monsters with Javelin Toss or Bushwhack triggers a \u003Cfont color='#FFF673'\u003EHunt\u003C\/font\u003E, granting \u003Cfont color='#ee91d7'\u003ETrue Sight\u003C\/font\u003E of them for 4 seconds. During this time, Nidalee gains 10% Movement Speed (increased to 30% toward the \u003Cfont color='#FFF673'\u003EHunted\u003C\/font\u003E target) and her Takedown and Pounce are enhanced against them.","img":"Nidalee_Passive.png"},"spells":[{"name":"Javelin Toss \/ Takedown","descr":"In human form, Nidalee throws a spiked javelin at her target that gains damage as it flies.  As a cougar, her next attack will attempt to fatally wound her target, dealing more damage the less life they have.","tooltip":"\u003Cspan class=\"size18 colorFF9900\"\u003E18","cost":[50,60,70,80,90],"costType":" Mana","cd":[6,6,6,6,6],"range":[1500,1500,1500,1500,1500],"key":"NidaleeQ"},{"name":"Bushwhack \/ Pounce","descr":"In human form, Nidalee lays a trap for unwary opponents that, when sprung, damages and reveals its target. As a cougar, she jumps in a direction, dealing damage in an area where she lands.","tooltip":"\u003Cspan class=\"size18 colorFF9900\"\u003E18","cost":[40,45,50,55,60],"costType":" Mana","cd":[13,12,11,10,9],"range":[900,900,900,900,900],"key":"NidaleeW"},{"name":"Primal Surge \/ Swipe","descr":"In human form, Nidalee channels the spirit of the cougar to heal her allies and imbue them with Attack Speed for a short duration. As a cougar, she claws in a direction, dealing damage to enemies in front of her.","tooltip":"\u003Cspan class=\"size18 colorFF9900\"\u003E18","cost":[60,75,90,105,120],"costType":" Mana","cd":[12,12,12,12,12],"range":[600,600,600,600,600],"key":"NidaleeE"},{"name":"Aspect Of The Cougar","descr":"Nidalee transforms into a cougar, gaining new abilities.","tooltip":"\u003Cspan class=\"size18 colorFF9900\"\u003E18","cost":[0,0,0,0],"costType":"No Cost","cd":[3,3,3,3],"range":[20,20,20,20],"key":"NidaleeR"}]}