{"id":5,"key":"XinZhao","name":"Xin Zhao","title":"the Seneschal of Demacia","lore":"''Death is inevitable, one can only avoid defeat.''\u003Cbr\u003E\u003Cbr\u003EWhenever Jarvan III, the king of Demacia, delivers one of his rallying speeches from the glinting marble balcony atop the Royal Palace, Xin Zhao is at his side. Coined the Seneschal of Demacia, Xin Zhao is the personal steward of the Lightshield Dynasty. His enigmatic, silent vigil has led to an abundance of conjecture concerning his ''secret life'' and origins. Whether it's ''Zaun double-agent'' tendered at the dinner table or ''indebted rune mage'' mused in the editorials of the ''Demacian Constant,'' Xin Zhao betrays no hints to sate the curiosity of the masses... for good reason.\u003Cbr\u003E\u003Cbr\u003EYears ago, Noxus was renowned for a spectacle called The Fleshing. It was a gladiatorial event with a cruel twist: as a fighter won matches, his number of opponents (generally prisoners of war) fought simultaneously would increase. This meant eventual death for every contender, but with unparalleled glory. Xin Zhao, known then as Viscero, was slated to face 300 soldiers, nearly six times the previous record. This was clearly meant to be his final match.\u003Cbr\u003E\u003Cbr\u003EJarvan II, hearing of this unprecedented feat, infiltrated the arena to offer him an alternative: serve Demacia and punish those who ultimately sentence him to death in exchange for his freedom. Xin Zhao accepted, astonished that a king would risk his own life on his behalf. Under the cover of a prearranged Demacian assault on Noxus, Jarvan liberated Xin Zhao and his 300 opponents. During their retreat, Xin Zhao took a poisoned dart meant for Jarvan. This act of loyalty, from a man who vowed no allegiance, earned Xin Zhao a spot at his side until the day the king died.\u003Cbr\u003E\u003Cbr\u003ENow in the service of his son, Jarvan III, Xin Zhao continues to fight for his adopted country and honor the legacy of the man who gave purpose to his life.","skins":[{"id":5000,"name":"default","num":0},{"id":5001,"name":"Commando Xin Zhao","num":1},{"id":5002,"name":"Imperial Xin Zhao","num":2},{"id":5003,"name":"Viscero Xin Zhao","num":3},{"id":5004,"name":"Winged Hussar Xin Zhao","num":4},{"id":5005,"name":"Warring Kingdoms Xin Zhao","num":5},{"id":5006,"name":"Secret Agent Xin Zhao","num":6}],"allytips":["Xin Zhao is a great initiator to combat. Lead the front to start a fight and use your ultimate to do the most damage possible.","It's often worth getting at least 1 point of Battle Cry to gain the Health restore effect.","Try to position yourself so your ultimate's knockback is most effective"],"enemytips":["Xin Zhao is a powerful initiator with both his charge and ultimate dealing damage to all units around him. Try having your team stay spread out until he's used his ultimate.","Xin Zhao relies heavily on his Three Talon Strikes for damage and cooldown resets, so preventing him from finishing his combo will have a dramatic effect."],"tags":["Fighter","Assassin"],"info":{"attack":8,"defense":6,"magic":3,"difficulty":2},"stats":{"arm":25.88,"ad":57.544,"aso":0,"crit":0,"hp":600,"mp":273.8,"mp5":7.256,"hp5":8.176,"range":175,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.3,"aso":2.6,"crit":0,"hp":92,"mp":35,"mp5":0.45,"hp5":0.7,"mr":1.25}},"pass":{"name":"Challenge","descr":"Xin Zhao challenges his target with his basic attacks and Audacious Charge, reducing its Armor by 15% for 3 seconds.","img":"XinZhao_TirelessWarrior.png"},"spells":[{"name":"Three Talon Strike","descr":"Xin Zhao's next 3 standard attacks deal increased damage that reduce his other ability cooldowns, with the third attack knocking an opponent into the air.","tooltip":"Xin Zhao's next 3 basic attacks deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E physical damage and reduce his other abilities' cooldowns by 1 second. The final strike also knocks the target into the air for {{ e2 }} seconds.","cost":[30,30,30,30,30],"costType":" Mana","cd":[9,8,7,6,5],"range":[375,375,375,375,375],"key":"XinZhaoQ"},{"name":"Battle Cry","descr":"Xin Zhao passively will critically strike every third attack, healing on every third hit. This ability can be activated to attack faster.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EEvery third basic attack Xin Zhao critically strikes his target for {{ e7 }}% additional damage. On every third hit, he heals himself for {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EXin Zhao unleashes a battle cry, increasing his Attack Speed by {{ e2 }}% for {{ e3 }} seconds.","cost":[40,40,40,40,40],"costType":" Mana","cd":[16,15,14,13,12],"range":[20,20,20,20,20],"key":"XinZhaoW"},{"name":"Audacious Charge","descr":"Xin Zhao charges an enemy, dealing damage and slowing all enemies in the area.","tooltip":"Xin Zhao charges and challenges an enemy. The charge deals {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E magic damage to all nearby enemies and slows them by {{ e2 }}% for {{ e4 }} seconds. ","cost":[60,60,60,60,60],"costType":" Mana","cd":[12,12,12,12,12],"range":[650,650,650,650,650],"key":"XinZhaoE"},{"name":"Crescent Sweep","descr":"Xin Zhao deals damage to nearby enemies based on their current Health and knocks non-challenged targets back. Xin Zhao gains bonus Armor and Magic Resist based on number of champions hit.","tooltip":"Xin Zhao unleashes a sweep around him that deals {{ e1 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ a1 }})\u003C\/span\u003E plus {{ e2 }}% of target's current Health in physical damage and stuns enemies while knocking them back (max 600 vs minions and monsters). Xin Zhao gains {{ e3 }} Armor and Magic Resist for 6 seconds for each champion hit.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EChallenge:\u003C\/span\u003E If a challenged target is hit by the sweep, it is unaffected by the knockback.","cost":[100,100,100],"costType":" Mana","cd":[120,110,100],"range":[500,500,500],"key":"XinZhaoR"}]}