{"id":59,"key":"JarvanIV","name":"Jarvan IV","title":"the Exemplar of Demacia","lore":"''There is only one truth, and you will find it at the point of my lance.''\u003Cbr\u003E\u003Cbr\u003EAs the royal family of Demacia for centuries, members of the Lightshield line have spent their lives waging war against any who opposed Demacian ethics. It is said that every Lightshield is born with anti-Noxian sentiment in his blood, and Jarvan IV is no exception.\u003Cbr\u003E\u003Cbr\u003EAs his forefathers had before him, he led Demacian troops into bloody engagements with Noxian forces, and on many occasions he has bled alongside wounded allies and fallen comrades. His most crushing defeat came at the hands of Jericho Swain, where he was outmaneuvered and captured by a Noxian battalion. This mistake nearly cost him his life at the hands of Urgot, but he was rescued by the Dauntless Vanguard, an elite Demacian strike force led by Jarvan's childhood companion, Garen.\u003Cbr\u003E\u003Cbr\u003EThose close to him believed that his capture changed him. Xin Zhao was quoted as saying: ''His eyes never seemed to look at you, only through you to something he could not look away from.''\u003Cbr\u003E\u003Cbr\u003EOne day, without warning, Jarvan IV hand-picked a squad of Demacian soldiers and left Demacia, vowing to find ''atonement''. He began by tracking and hunting the most dangerous beasts and bandits he could find in northern Valoran, but he soon tired of such prey. Seeking something that only he understood, he ventured south of the Great Barrier. He wasn't heard from again for nearly two years.\u003Cbr\u003E\u003Cbr\u003EAfter many had assumed the worst, he returned to glorious fanfare on the streets of Demacia. His Demacian plates were adorned with the bones and scales of creatures unknown. His eyes bore the wisdom of someone twice his age. Of the twelve soldiers who had departed with him, only two returned. In a tone as cold and steady as steel, he swore to bring the enemies of Demacia to their knees.","skins":[{"id":59000,"name":"default","num":0},{"id":59001,"name":"Commando Jarvan IV","num":1},{"id":59002,"name":"Dragonslayer Jarvan IV","num":2},{"id":59003,"name":"Darkforge Jarvan IV","num":3},{"id":59004,"name":"Victorious Jarvan IV","num":4},{"id":59005,"name":"Warring Kingdoms Jarvan IV","num":5},{"id":59006,"name":"Fnatic Jarvan IV","num":6}],"allytips":["You can use the Dragon Strike \/ Demacian Standard combo to get out of your own Cataclysm arenas.","Split your basic attacks on different champions at the beginning of fights to maximize damage.","Use Demacian Standard as a scouting tool when worried about incoming enemies."],"enemytips":["Keep out of the path between Jarvan IV and his Demacian Standard to avoid being knocked up in the air.","Cataclysm's terrain is a frightening force to fight against, but movement abilities can go through it."],"tags":["Tank","Fighter"],"info":{"attack":6,"defense":8,"magic":3,"difficulty":5},"stats":{"arm":29,"ad":55.712,"aso":-0.05,"crit":0,"hp":571.2,"mp":302.2,"mp5":6.756,"hp5":8.176,"range":175,"ms":340,"mr":32.1,"lvl":{"arm":3.6,"ad":3.4,"aso":2.5,"crit":0,"hp":90,"mp":40,"mp5":0.45,"hp5":0.7,"mr":1.25}},"pass":{"name":"Martial Cadence","descr":"Jarvan IV's initial basic attack on a target deals bonus physical damage. This effect cannot occur again on the same target for a short duration.","img":"JarvanIV_MartialCadence.png"},"spells":[{"name":"Dragon Strike","descr":"Jarvan IV extends his lance, dealing physical damage and lowering the Armor of enemies in its path. Additionally, this will pull Jarvan to his Demacian Standard, knocking up enemies in his path.","tooltip":"Extends Jarvan IV's lance dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and lowering the Armor of enemies hit by {{ e2 }}% for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EIf the lance contacts Demacian Standard it will pull Jarvan IV to its location, knocking up enemies in his path. This effect can be triggered even while immobilized.","cost":[45,50,55,60,65],"costType":" Mana","cd":[10,9,8,7,6],"range":[770,770,770,770,770],"key":"JarvanIVQ"},{"name":"Golden Aegis","descr":"Jarvan IV calls upon the ancient kings of Demacia to shield him from harm and slow surrounding enemies.","tooltip":"Grants a shield that absorbs {{ e1 }} (+{{ e3 }} damage for each nearby enemy champion) damage for {{ e4 }} seconds, and slows surrounding enemies by {{ e2 }}% for {{ e5 }} seconds.","cost":[30,30,30,30,30],"costType":" Mana","cd":[12,12,12,12,12],"range":[625,625,625,625,625],"key":"JarvanIVW"},{"name":"Demacian Standard","descr":"Jarvan IV carries the pride of Demacia, passively granting him bonus Attack Speed. Activating Demacian Standard allows Jarvan IV to place a Demacian flag that deals magic damage on impact and grants Attack Speed to nearby allied champions.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Gains {{ e3 }}% Attack Speed.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Throws a Demacian Standard to a nearby area dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies. The Standard lasts for {{ e4 }} seconds and grants surrounding allied champions {{ e3 }}% Attack Speed.","cost":[55,55,55,55,55],"costType":" Mana","cd":[13,12.5,12,11.5,11],"range":[860,860,860,860,860],"key":"JarvanIVE"},{"name":"Cataclysm","descr":"Jarvan IV heroically leaps into battle at a target with such force that he terraforms the surrounding area to create an arena around them. Nearby enemies are damaged at the moment of impact.","tooltip":"Heroically leaps to an enemy Champion dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to nearby enemies and creating an arena of impassable terrain around them for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EActivate again to collapse the terrain.","cost":[100,100,100],"costType":" Mana","cd":[120,105,90],"range":[650,650,650],"key":"JarvanIVR"}]}