{"id":67,"key":"Vayne","name":"Vayne","title":"the Night Hunter","lore":"The world is not always as civilized as people might think. There are still those who would follow the blackest paths of magic and become corrupted by the darker powers that flow through Runeterra. Shauna Vayne knows this fact well.\u003Cbr\u003E\u003Cbr\u003EAs a young privileged girl in the heart of Demacia's elite, her father tried to convince her of the constabulary's ever-vigilant eye. Young and naive, she truly believed that her world was one of perfect safety, until one night, when a twisted witch took interest in her father. The malevolent woman overcame her father's conciliar guard, then tortured her family before murdering them. The young Shauna escaped only by hiding herself and then fleeing once the hag had departed, plagued by the screams of her loved ones as she ran. A burning hatred was born in her that day, one that could never be denied.\u003Cbr\u003E\u003Cbr\u003EVayne was able to take care of herself using her father's money, and she began to train as soon as an instructor would have her as a student. By the time she was a fully grown woman, she had become a grim warrior. However, the fields of battle were not to be her home.\u003Cbr\u003E\u003Cbr\u003EDemacia needed a protector, one who hunted those lost to the darkness. Shauna used her family's contacts to become the first Night Hunter, and now her prowess is legendary. It is said that those who practice the black arts quake when they hear that the Night Hunter is on the prowl.\u003Cbr\u003E\u003Cbr\u003ENot all shadows are to be feared. At least, if Vayne has her way.","skins":[{"id":67000,"name":"default","num":0},{"id":67001,"name":"Vindicator Vayne","num":1},{"id":67002,"name":"Aristocrat Vayne","num":2},{"id":67003,"name":"Dragonslayer Vayne","num":3},{"id":67004,"name":"Heartseeker Vayne","num":4},{"id":67005,"name":"SKT T1 Vayne","num":5},{"id":67006,"name":"Arclight Vayne","num":6},{"id":67010,"name":"Soulstealer Vayne","num":10}],"allytips":["Tumble has many uses, but it cannot pass over walls.","Condemn can be used to both pin targets to walls to ensure a kill, or to escape a pursuer.","Don't go in first to a large teamfight. Wait for your teammates to initiate."],"enemytips":["Vayne is fragile - turn the pressure up on her and she will be forced to play cautiously.","Deny Vayne the opportunity to pin you against walls."],"tags":["Marksman","Assassin"],"info":{"attack":10,"defense":1,"magic":1,"difficulty":8},"stats":{"arm":19.012,"ad":55.88,"aso":-0.05,"crit":0,"hp":498.44,"mp":231.8,"mp5":6.972,"hp5":5.424,"range":550,"ms":330,"mr":30,"lvl":{"arm":3.4,"ad":1.66,"aso":4,"crit":0,"hp":83,"mp":35,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Night Hunter","descr":"Vayne ruthlessly hunts evil-doers. She gains 30 Movement Speed when moving toward nearby enemy champions.","img":"Vayne_NightHunter.png"},"spells":[{"name":"Tumble","descr":"Vayne tumbles, maneuvering to carefully place her next shot. Her next attack deals bonus damage.","tooltip":"Rolls a short distance. The next basic attack within {{ e1 }} seconds deals \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E bonus physical damage, equal to {{ e2 }}% of total Attack Damage.","cost":[30,30,30,30,30],"costType":" Mana","cd":[6,5,4,3,2],"range":[300,300,300,300,300],"key":"VayneQ"},{"name":"Silver Bolts","descr":"Vayne tips her bolts with a rare metal, toxic to evil things. The third consecutive attack or ability against the same target deals a percentage of the target's maximum Health as bonus true damage. (Max: 200 damage vs. Monsters)","tooltip":"Every third consecutive attack or ability against an enemy deals an additional {{ e1 }}% of the enemy's maximum Health as true damage.\u003Cbr\u003E\u003Cbr\u003EDeals a maximum of 200 damage vs. Monsters and a minimum of {{ e2 }} damage vs. all targets.","cost":[0,0,0,0,0],"costType":"Passive","cd":[6,6,6,6,6],"range":[750,750,750,750,750],"key":"VayneW"},{"name":"Condemn","descr":"Vayne draws a heavy crossbow from her back, and fires a huge bolt at her target, knocking them back and dealing damage. If they collide with terrain, they are impaled, dealing bonus damage and stunning them.","tooltip":"Fires a bolt that knocks back target enemy and deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage. Enemies that collide with terrain take {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E additional physical damage and are stunned for {{ e3 }} seconds.","cost":[90,90,90,90,90],"costType":" Mana","cd":[20,18,16,14,12],"range":[710,710,710,710,710],"key":"VayneE"},{"name":"Final Hour","descr":"Readying herself for an epic confrontation, Vayne gains increased Attack Damage, Invisibility during Tumble, and triple the bonus Movement Speed from Night Hunter.","tooltip":"Gains {{ e1 }} Bonus Attack Damage for {{ e2 }} seconds. While active, Tumble grants \u003Cspan class=\"color91d7ee\"\u003EInvisibility\u003C\/span\u003E for {{ e3 }} second, and Night Hunter's bonus Movement Speed is increased to {{ e4 }}.\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"size16 color91d7ee\"\u003E16","cost":[80,80,80],"costType":" Mana","cd":[100,85,70],"range":[1,1,1],"key":"VayneR"}]}