{"id":101,"key":"Xerath","name":"Xerath","title":"the Magus Ascendant","lore":"''A lifetime as a slave has prepared me for eternity as your master.''\u003Cbr\u003E\u003Cbr\u003EXerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image.","skins":[{"id":101000,"name":"default","num":0},{"id":101001,"name":"Runeborn Xerath","num":1},{"id":101002,"name":"Battlecast Xerath","num":2},{"id":101003,"name":"Scorched Earth Xerath","num":3},{"id":101004,"name":"Guardian of the Sands Xerath","num":4}],"allytips":["It's easier to land Arcanopulse on an enemy when they're moving toward or away from you, rather than side to side.","Eye of Destruction will make landing Arcanopulse easier as the target will be slowed.","If you stun an enemy with Shocking Orb, follow up with a guaranteed center hit on Eye of Destruction."],"enemytips":["Xerath's range can be intimidating, but most champions who close distance with him can trade favorably.","Xerath takes a long time to engage Rite of the Arcane. Watch for his spellcast animation and start dodging.","Banshee's Veil will make it much harder for Xerath to land Shocking Orb on you."],"tags":["Mage","Assassin"],"info":{"attack":1,"defense":3,"magic":10,"difficulty":8},"stats":{"arm":21.88,"ad":54.7,"aso":0,"crit":0,"hp":514.4,"mp":366.96,"mp5":6,"hp5":5.424,"range":525,"ms":340,"mr":30,"lvl":{"arm":3.5,"ad":3,"aso":1.36,"crit":0,"hp":80,"mp":44,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Mana Surge","descr":"Xerath's basic attacks periodically restore Mana.","img":"Xerath_Passive1.png"},"spells":[{"name":"Arcanopulse","descr":"Fires a long-range beam of energy, dealing magic damage to all targets hit.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EFirst cast:\u003C\/span\u003E Xerath charges Arcanopulse, gradually decreasing his Movement Speed while increasing the spell's range.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ESecond cast:\u003C\/span\u003E Xerath fires Arcanopulse, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all enemies in a line.\u003Cbr\u003E\u003Cbr\u003EWhile charging Arcanopulse, Xerath cannot attack or cast other spells. If Xerath does not fire the spell, half the Mana cost is refunded.","cost":[80,90,100,110,120],"costType":" Mana","cd":[9,8,7,6,5],"range":[750,750,750,750,750],"key":"XerathQ"},{"name":"Eye of Destruction","descr":"Calls down a barrage of arcane energy, slowing and dealing magic damage to all enemies in an area. Targets in the middle receive additional damage and a stronger slow.","tooltip":"Xerath calls down a blast of arcane energy, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all enemies within the target area, slowing them by {{ e8 }}% for {{ e4 }} seconds. Enemies in the center of the blast take {{ f1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E magic damage and are slowed by {{ e3 }}%. This slow decays rapidly.","cost":[70,80,90,100,110],"costType":" Mana","cd":[1,1,1,1,1],"range":[1100,1100,1100,1100,1100],"key":"XerathW"},{"name":"Shocking Orb","descr":"Deals magic damage to an enemy and stuns them.","tooltip":"Xerath fires an orb of raw magic. The first enemy hit takes {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and is stunned for between {{ e8 }} and {{ e2 }} seconds. The stun duration lengthens based on how far the orb travels.","cost":[60,65,70,75,80],"costType":" Mana","cd":[13,12.5,12,11.5,11],"range":[1050,1050,1050,1050,1050],"key":"XerathE"},{"name":"Rite of the Arcane","descr":"Xerath immobilizes himself and gains numerous long-range barrages.","tooltip":"Xerath ascends to his true form, becoming rooted in place and gaining {{ e2 }} Arcane Barrages. This magic artillery deals {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all enemies hit.\u003Cbr\u003E\u003Cbr\u003EThe root ends after {{ e1 }} seconds, when all shots have been fired or when manually deactivated by issuing a move command. If no barrages are fired, {{ e7 }}% of the cooldown is refunded.","cost":[100,100,100],"costType":" Mana","cd":[130,115,100],"range":[3200,4400,5600],"key":"XerathR"}]}