{"id":27,"key":"Singed","name":"Singed","title":"the Mad Chemist","lore":"Singed descended from a long line of Zaun's revered chemists. Even in his youth, his talent for concocting potions far outstripped that of his peers, and he quickly distinguished himself from his less extraordinary chemist compatriots. It came as no surprise to anyone when he was selected for apprenticeship by the infamous Warwick, master apothecary on a lucrative retainer with the Noxian military during their campaign against Ionia. Within Warwick's laboratories, Singed toiled without end, rapidly absorbing every detail of his predecessor's deadly craft. Singed had little concern for the death and destruction that was the fruit of his labors. By the time the curse of lycanthropy descended to claim his master, Singed was poised and eager to make the transition from workhorse to innovator; he was ready to share his genius by bringing a new brand of suffering to the Ionian front. His zeal for progress was unquenchable, and when suitable test subjects proved to be in short supply, the eager chemist was often thought to turn his volatile mixtures on his own flesh.\u003Cbr\u003E\u003Cbr\u003EWhen the uneasy peace created by the League of Legends settled on the world, Singed journeyed to the one place where he was still able to showcase his beloved craft: the Institute of War. By this time he was barely even a man, his body both ruined and sustained by his ingenious craft. A thousand burns - accidents of shadow and flame - mar his ravaged form, and exposure to such harsh conditions has deadened his nerves, hardened his body, and strengthened his physique, transforming him into a veritable juggernaut. This, combined with a formidable arsenal of deadly concoctions, makes Singed a force to be reckoned with on the Fields of Justice.\u003Cbr\u003E\u003Cbr\u003E''My deadliest dose shall bear my patron's name!''\u003Cbr\u003E-- Singed, having just christened the Insanity Potion","skins":[{"id":27000,"name":"default","num":0},{"id":27001,"name":"Riot Squad Singed","num":1},{"id":27002,"name":"Hextech Singed","num":2},{"id":27003,"name":"Surfer Singed","num":3},{"id":27004,"name":"Mad Scientist Singed","num":4},{"id":27005,"name":"Augmented Singed","num":5},{"id":27006,"name":"Snow Day Singed","num":6},{"id":27007,"name":"SSW Singed","num":7},{"id":27008,"name":"Black Scourge Singed","num":8}],"allytips":["Poison Trail is very effective at farming and harassing, allowing Singed to dominate the flow of whatever lane he's in.","Use Insanity Potion to trick your opponents into chasing you through your Poison Trail.","Flinging enemies into your tower can deal heavy amounts of damage to them."],"enemytips":["Keep your distance to avoid being Flung back into Singed's allies.","Singed needs to run close to your team to be effective. Try to take advantage of this by using crowd control effects on him while attacking his allies.","Be careful when chasing Singed. He's very difficult to bring down, and can leave his Poison Trail to damage you in your pursuit."],"tags":["Tank","Fighter"],"info":{"attack":4,"defense":8,"magic":7,"difficulty":5},"stats":{"arm":27.88,"ad":62.32,"aso":0.02,"crit":0,"hp":542.76,"mp":290.6,"mp5":7.524,"hp5":8.024,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.375,"aso":1.81,"crit":0,"hp":82,"mp":45,"mp5":0.55,"hp5":0.55,"mr":1.25}},"pass":{"name":"Empowered Bulwark","descr":"Increases Singed's Health by 25 for every 100 Mana he has.","img":"Singed_Passive.png"},"spells":[{"name":"Poison Trail","descr":"Leaves a trail of poison behind Singed, dealing damage to enemies caught in the path.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EToggle: \u003C\/span\u003ESinged lays a poisonous trail that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ charabilitypower*4 }})\u003C\/span\u003E magic damage per second.","cost":[13,13,13,13,13],"costType":" Mana per Second","cd":[0,0,0,0,0],"range":[20,20,20,20,20],"key":"SingedQ"},{"name":"Mega Adhesive","descr":"Throws a vial of mega adhesive on the ground, slowing enemies who walk on it.","tooltip":"Singed leaves a sticky area on the ground for {{ e2 }} seconds, slowing enemies in the area by {{ e1 }}%.\u003Cbr\u003E\u003Cbr\u003EIf Singed flings a target into the zone, it will root them.","cost":[70,80,90,100,110],"costType":" Mana","cd":[14,14,14,14,14],"range":[1000,1000,1000,1000,1000],"key":"SingedW"},{"name":"Fling","descr":"Damages target enemy unit and flings them into the air behind Singed. If the target Singed flings lands in his Mega Adhesive, they are also rooted.","tooltip":"Singed flings an enemy over his shoulder, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E plus {{ e3 }}% of the target's maximum Health as magic damage. Max 300 bonus damage against minions and monsters.\u003Cbr\u003E\u003Cbr\u003EIf the target Singed flings lands in his Mega Adhesive, they are also rooted for {{ e2 }} seconds.","cost":[100,110,120,130,140],"costType":" Mana","cd":[10,10,10,10,10],"range":[125,125,125,125,125],"key":"SingedE"},{"name":"Insanity Potion","descr":"Singed drinks a potent brew of chemicals, granting him increased combat stats.","tooltip":"Singed drinks a potent brew of chemicals, granting him {{ e1 }} Ability Power, Armor, Magic Resist, Movement Speed, Health Regen, and Mana Regen for {{ e2 }} seconds.","cost":[150,150,150],"costType":" Mana","cd":[100,100,100],"range":[20,20,20],"key":"SingedR"}]}