{"id":92,"key":"Riven","name":"Riven","title":"the Exile","lore":"''There is a place between war and murder in which our demons lurk.''\u003Cbr\u003E\u003Cbr\u003EIn Noxus, any citizen may rise to power regardless of race, gender, or social standing - strength is all that matters. It was with committed faith in this ideal that Riven strove to greatness. She showed early potential as a soldier, forcing herself to master the weight of a long sword when she was barely its height. She was ruthless and efficient as a warrior, but her true strength lay in her conviction. She entered battles without any trace of doubt in her mind: no ethical pause, no fear of death.\u003Cbr\u003E\u003Cbr\u003ERiven became a leader amongst her peers; a poster child of the Noxian spirit. So exceptional was her passion that the High Command recognized her with a black stone rune sword forged and enchanted with Noxian sorcery. The weapon was heavier than a kite shield and nearly as broad - perfectly suited to her tastes. Soon after, she was deployed to Ionia as part of the Noxian invasion.\u003Cbr\u003E\u003Cbr\u003EWhat began as war quickly became extermination. Noxian soldiers followed the terrifying Zaunite war machines across fields of death. It wasn't the glorious combat for which Riven trained. She carried out the orders of her superiors, terminating the remnants of a beaten and fractured enemy with extreme prejudice.\u003Cbr\u003E\u003Cbr\u003EAs the invasion continued, it became clear that the Ionian society would not be reformed, merely eliminated. During one bitter engagement, Riven's unit became surrounded by Ionian forces. They called for support as the enemy closed in around them. What they received instead was a barrage of biochemical terror launched by Singed. Riven watched as around her Ionian and Noxian alike fell victim to an unspeakably gruesome fate. She managed to escape the bombardment, though she could not erase the memory.\u003Cbr\u003E\u003Cbr\u003ECounted dead by Noxus, she saw an opportunity to start anew. She shattered her sword, severing ties with the past, and wandered in self-imposed exile - on a quest to seek atonement and a way to save the pure Noxian vision in which she believed.","skins":[{"id":92000,"name":"default","num":0},{"id":92001,"name":"Redeemed Riven","num":1},{"id":92002,"name":"Crimson Elite Riven","num":2},{"id":92003,"name":"Battle Bunny Riven","num":3},{"id":92004,"name":"Championship Riven","num":4},{"id":92005,"name":"Dragonblade Riven","num":5},{"id":92006,"name":"Arcade Riven","num":6},{"id":92007,"name":"Championship Riven 2016","num":7}],"allytips":["Riven's Broken Wings locks onto the champion your cursor is over at the time of cast. If you want to move past your opponent, make sure that your cursor is past your opponent as well.","Riven lacks a source of healing or strong defense and must compensate with burst combos. Lead into fights with Broken Wings and Ki Burst, while using Valor to escape and absorb counter-harass."],"enemytips":["Riven has a great deal of mobility but she cannot move very far with any one skill. Rooting or silencing her during her combo will greatly reduce her effectiveness.","All of Riven's damage is physical, prioritize high Armor if an opposing Riven gets out of control.","Riven excels at dueling multiple melee attackers at once, as she will be on an almost equal footing damage-wise. If pairing up against Riven, don't go in as double melee until she has expended her full combo."],"tags":["Fighter","Assassin"],"info":{"attack":8,"defense":5,"magic":1,"difficulty":8},"stats":{"arm":24.376,"ad":56.04,"aso":0,"crit":0,"hp":558.48,"mp":0,"mp5":0,"hp5":5.34,"range":125,"ms":340,"mr":32.1,"lvl":{"arm":3.2,"ad":3,"aso":3.5,"crit":0,"hp":86,"mp":0,"mp5":0,"hp5":0.5,"mr":1.25}},"pass":{"name":"Runic Blade","descr":"Riven's abilities charge her blade, causing her basic attacks to deal bonus physical damage. Riven's blade may be charged up to three times and expends one charge per attack.","img":"RivenRunicBlades.png"},"spells":[{"name":"Broken Wings","descr":"Riven lashes out in a series of strikes. This ability can be reactivated three times in a short time frame with the third hit knocking back nearby enemies.","tooltip":"Riven strikes out in front of her in a short line. This ability may be reactivated {{ e4 }} additional times.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003E1st and 2nd Use:\u003C\/span\u003E Slashes forward, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage to all units she comes in contact with.\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003E3rd Use:\u003C\/span\u003E Leaps forward and slams the ground dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and knocking nearby enemies up. This leap can cross unpathable terrain.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003ERiven will target the unit your cursor is hovering over, or if no targets are present, Riven will simply strike the direction she is currently facing.\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":"No Cost","cd":[13,13,13,13,13],"range":[275,275,275,275,275],"key":"RivenQ"},{"name":"Ki Burst","descr":"Riven emits a Ki Burst, damaging and stunning nearby enemies.","tooltip":"Riven's sword emits a burst of runic energy that shocks nearby enemies, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and stunning them for {{ e5 }} seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[11,10,9,8,7],"range":[260,260,260,260,260],"key":"RivenW"},{"name":"Valor","descr":"Riven steps forward a short distance and blocks incoming damage.","tooltip":"Riven does a quick dash in the direction of your cursor and becomes shielded, blocking up to {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E incoming damage for 1.5 seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[10,9,8,7,6],"range":[250,250,250,250,250],"key":"RivenE"},{"name":"Blade of the Exile","descr":"Riven empowers her keepsake weapon with energy, and gains Attack Damage and Range. During this time, she also gains the ability to use Wind Slash, a powerful ranged attack, once. ","tooltip":"Riven's weapon surges with spiritual energy for {{ e4 }} seconds, granting her {{ e5 }}% extra Attack Damage (\u003Cspan class=\"colorFF8C00\"\u003E+{{ f3 }}\u003C\/span\u003E), increased Range on her damaging spells and attacks, and the ability to use Wind Slash once.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EWind Slash:\u003C\/span\u003E Riven fires a shockwave that deals from {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E to {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E physical damage to all enemies hit, increasing based on how much Health they are missing.","cost":[0,0,0],"costType":"No Cost","cd":[130,95,60],"range":[200,200,200],"key":"RivenR"}]}