{"id":68,"key":"Rumble","name":"Rumble","title":"the Mechanized Menace","lore":"''Ugh, it's gonna take forever to scrape your face off my suit!''\u003Cbr\u003E\u003Cbr\u003EEven amongst yordles, Rumble was always the runt of the litter. As such, he was used to being bullied. In order to survive, he had to be scrappier and more resourceful than his peers. He developed a quick temper and a reputation for getting even, no matter who crossed him. This made him something of a loner, but he didn't mind. He liked to tinker, preferring the company of gadgets, and he could usually be found rummaging through the junkyard.\u003Cbr\u003E\u003Cbr\u003ERumble showed great potential as a mechanic, and his teachers recommended him for enrollment at the Yordle Academy of Science and Progress in Piltover. He may very well have become one of Heimerdinger's esteemed proteges, but Rumble refused to go. He believed that Heimerdinger and his associates were ''sellouts,'' trading superior yordle technology to humans for nothing more than a pat on the head while yordles remained the butt of their jokes.\u003Cbr\u003E\u003Cbr\u003EWhen a group of human graduates from the Yordle Academy sailed to Bandle City to visit the place where their mentor was born and raised, Rumble couldn't resist the temptation to see them face-to-face (so to speak). He only intended to get a good look at the humans, but four hours and several choice words later, he returned home bruised and bloodied with an earful about how he was an embarrassment to ''enlightened'' yordles like Heimerdinger.\u003Cbr\u003E\u003Cbr\u003EThe next morning, Rumble left Bandle City without a word, and wasn't seen again for months. When he returned, he was at the helm of a clanking, mechanized monstrosity. He marched it to the center of town amidst dumbfounded onlookers and there announced that he would show the world what yordle-tech was really capable of achieving.","skins":[{"id":68000,"name":"default","num":0},{"id":68001,"name":"Rumble in the Jungle","num":1},{"id":68002,"name":"Bilgerat Rumble","num":2},{"id":68003,"name":"Super Galaxy Rumble","num":3}],"allytips":["Try and pace yourself to stay in the Danger Zone to maximize your effectiveness. It is easy to overheat if you rapidly use your abilities.","Try and keep targets in the range of your Flamespitter. It can deal a lot of damage overtime.","If you are winning a fight you can use your ultimate to wall off an escape path."],"enemytips":["Watch Rumble's Heat bar carefully. If you see him Overheat, go in for the kill while his skills are disabled.","Rumble's ultimate can deal a lot of damage if you stay inside the area of effect. When you see the missiles falling, move out of the way as quickly as possible.","Rumble deals almost entirely magic damage. Build some Magic Resistance to reduce his damage."],"tags":["Fighter","Mage"],"info":{"attack":3,"defense":6,"magic":8,"difficulty":10},"stats":{"arm":25.88,"ad":61.036,"aso":-0.03,"crit":0,"hp":584.4,"mp":100,"mp5":0,"hp5":8.008,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.2,"aso":1.85,"crit":0,"hp":80,"mp":0,"mp5":0,"hp5":0.6,"mr":1.25}},"pass":{"name":"Junkyard Titan","descr":"Every spell Rumble casts gives him Heat. When he reaches 50% Heat he reaches Danger Zone, granting all his basic abilities bonus effects. When he reaches 100% Heat, he starts Overheating, granting his basic attacks bonus damage, but making him unable to cast spells for a few seconds. ","img":"Rumble_Junkyard Titan1.png"},"spells":[{"name":"Flamespitter","descr":"Rumble torches opponents in front of him, dealing magic damage in a cone for 3 seconds. While in Danger Zone this damage is increased. ","tooltip":"Rumble torches his opponents, dealing {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E magic damage in a cone over 3 seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF00\"\u003EDanger Zone Bonus:\u003C\/span\u003E Deals {{ e5 }}% damage.","cost":[0,0,0,0,0],"costType":" Heat","cd":[6,6,6,6,6],"range":[600,600,600,600,600],"key":"RumbleQ"},{"name":"Scrap Shield","descr":"Rumble pulls up a shield, protecting him from damage and granting him a quick burst of speed. While in Danger Zone, the shield strength and speed bonus is increased. ","tooltip":"Rumble tosses up a shield for 2 seconds that absorbs {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage. Rumble also gains an additional {{ e2 }}% Movement Speed for 1 second. \u003C\/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF00\"\u003EDanger Zone Bonus:\u003C\/span\u003E 50% increase in shield health and Movement Speed.","cost":[0,0,0,0,0],"costType":" Heat","cd":[6,6,6,6,6],"range":[20,20,20,20,20],"key":"RumbleW"},{"name":"Electro Harpoon","descr":"Rumble launches a taser, electrocuting his target with magic damage and slowing their Movement Speed. Rumble can carry 2 harpoons at a time. While in Danger Zone the damage and slow percentage is increased.  ","tooltip":"Rumble shoots his opponent with up to 2 tasers, dealing {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E magic damage and applying a stacking slow of {{ e2 }}% for 2 seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF00\"\u003EDanger Zone Bonus:\u003C\/span\u003E Damage and slow percentage increased by 50%.\u003Cspan class=\"color99FF99\"\u003E\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":" Heat","cd":[0.5,0.5,0.5,0.5,0.5],"range":[850,850,850,850,850],"key":"RumbleE"},{"name":"The Equalizer","descr":"Rumble fires off a group of rockets, creating a wall of flames that damages and slows enemies. ","tooltip":"Rumble launches a line of rockets that creates a burning trail for 5 seconds. Enemies in the area have their Movement Speed slowed by {{ e3 }}% and take {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a2 }})\u003C\/span\u003E magic damage each second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EYou can control the placement of this attack by clicking and dragging your mouse in a line.\u003C\/span\u003E","cost":[0,0,0],"costType":"No Cost","cd":[110,100,90],"range":[1750,1750,1750],"key":"RumbleR"}]}