{"id":31,"key":"Chogath","name":"Cho'Gath","title":"the Terror of the Void","lore":"There is a place between dimensions, between worlds. To some it is known as the Outside, to others it is the Unknown. To those that truly know, however, it is called the Void. Despite its name, the Void is not an empty place, but rather the home of unspeakable things - horrors not meant for minds of men.  Cho'Gath is a creature born of the Void, a thing whose true nature is so awful most will not speak its name. Its fellows have been poking at the walls that divide dimensions for a crack, a way into Runeterra, where they can visit their own personal paradise of horror upon the world. They are called the Voidborn, creatures so ancient and terrible that they have been removed from history altogether. It is rumored that the Voidborn command vast armies of unspeakable creatures on other worlds, that they were once driven from Runeterra by powerful magic lost to antiquity.\u003Cbr\u003E\u003Cbr\u003EIf such tales are true, then the rumors that follow must be equally true - that one day, the Voidborn will return. Even now, something dark stirs in Icathia, perverting the summoning rituals of the League to allow the presence of Cho'Gath. It is an alien creature of malice and violence, a thing that causes all but the most stalwart to cringe in fear. Cho'Gath even appears to feed on its predations, growing and swelling as it gorges itself. Worse yet, the creature is intelligent, perhaps greatly so, making most wonder how such a monster could be contained. Fortunately, the power of the League's summoning has confined Cho'Gath's presence exclusively to the League of Legends. It is here that summoners use Cho'Gath's Voidborn abilities to help decide the fate of Runeterra. The Terror of the Void knows what fate it would choose for Runeterra, given half the chance.\u003Cbr\u003E\u003Cbr\u003EWoe betide the day when Cho'Gath grows weary of the League.","skins":[{"id":31000,"name":"default","num":0},{"id":31001,"name":"Nightmare Cho'Gath","num":1},{"id":31002,"name":"Gentleman Cho'Gath","num":2},{"id":31003,"name":"Loch Ness Cho'Gath","num":3},{"id":31004,"name":"Jurassic Cho'Gath","num":4},{"id":31005,"name":"Battlecast Prime Cho'Gath","num":5},{"id":31006,"name":"Prehistoric Cho'Gath","num":6}],"allytips":["Try to line up your attacks with Vorpal Spikes so that they kill minions and harass enemy champions at the same time.","If you're having difficulty feasting upon champions, try eating minions until you're larger.","Using Rupture on creeps in combination with Carnivore is a good way to gain Health and Mana."],"enemytips":["Purchasing a few HP items decreases the chances of Cho'Gath killing you quickly.","Focus on preventing Cho'Gath from reaching his max size, or obtaining it again after you've killed him.","Rupture has a smoke cloud indicating the area it will strike. Try to watch out for it to prevent Cho'Gath from being able to combo his abilities."],"tags":["Tank","Mage"],"info":{"attack":3,"defense":7,"magic":7,"difficulty":5},"stats":{"arm":28.88,"ad":61.156,"aso":0,"crit":0,"hp":574.4,"mp":272.2,"mp5":7.206,"hp5":8.928,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":4.2,"aso":1.44,"crit":0,"hp":80,"mp":40,"mp5":0.45,"hp5":0.85,"mr":1.25}},"pass":{"name":"Carnivore","descr":"Whenever Cho'Gath kills a unit, he recovers Health and Mana. The values restored increase with Cho'Gath's level.","img":"GreenTerror_TailSpike.png"},"spells":[{"name":"Rupture","descr":"Ruptures the ground at target location, popping enemy units into the air, dealing damage and slowing them.","tooltip":"Ruptures the ground at target location. Enemies caught in the rupture are launched into the air for {{ e5 }} second, take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage, and are slowed by {{ e2 }}% for {{ e3 }} seconds.","cost":[90,90,90,90,90],"costType":" Mana","cd":[9,9,9,9,9],"range":[950,950,950,950,950],"key":"ChogathQ"},{"name":"Feral Scream","descr":"Cho'Gath unleashes a terrible scream at enemies in a cone, dealing magic damage and Silencing enemies for a few seconds.","tooltip":"Silences enemies in a cone for {{ e2 }} seconds and deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.","cost":[70,80,90,100,110],"costType":" Mana","cd":[13,12,11,10,9],"range":[300,300,300,300,300],"key":"ChogathW"},{"name":"Vorpal Spikes","descr":"Cho'Gath's attacks passively release deadly spikes, dealing damage to all enemy units in front of him.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EToggle: \u003C\/span\u003EBasic attacks launch spikes that deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. Spikes grow wider as Cho'Gath gains Feast stacks.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[0.5,0.5,0.5,0.5,0.5],"range":[40,40,40,40,40],"key":"ChogathE"},{"name":"Feast","descr":"Devours an enemy unit, dealing a high amount of true damage. If the target is killed, Cho'Gath grows, gaining maximum Health (maximum 6 stacks). Cho'Gath loses half of his stacks upon death. Half the cooldown and mana cost are refunded if a minion or monster is killed.","tooltip":"Ravenously feed on an enemy, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E true damage to champions or {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E to minions and monsters. If Feast deals a killing blow, Cho'Gath gains a stack of Feast, which causes him to grow in size and gain {{ e3 }} maximum health.\u003Cbr\u003E\u003Cbr\u003E\u003Cli\u003EKills on champions grant an additional stack of Feast.\u003Cbr\u003EKills on minions and monsters refund 50% of Feast's cooldown and cost.\u003C\/li\u003E\u003Cbr\u003E\u003Cspan class=\"color9999A8\"\u003E\u003Ci\u003ECho'Gath cannot have more than 6 stacks of Feast at once and loses half of his stacks upon dying.\u003C\/i\u003E\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[80,80,80],"range":[175,175,175],"key":"ChogathR"}]}