{"id":202,"key":"Jhin","name":"Jhin","title":"the Virtuoso","lore":"''Art requires a certain...cruelty.''\u003Cbr\u003E\u003Cbr\u003EJhin is a meticulous criminal psychopath who believes murder is art. Once an Ionian prisoner, but freed by shadowy elements within Ionia's ruling council, the serial killer now works as their cabal's assassin. Using his gun as his paintbrush, Jhin creates works of artistic brutality, horrifying victims and onlookers. He gains a cruel pleasure from putting on his gruesome theater, making him the best choice to send the most powerful of messages: terror.","skins":[{"id":202000,"name":"default","num":0},{"id":202001,"name":"High Noon Jhin","num":1},{"id":202002,"name":"Blood Moon Jhin","num":2}],"allytips":["Deadly Flourish has incredible range. When approaching a fight be sure to look ahead for enemies that could be rooted.","Your ultimate deals significantly less damage to enemies with full health. Look to pick off weakened targets as they run away.","You can still cast your spells while reloading. Use them to fill the down time."],"enemytips":["Deadly Flourish only roots those hit by one of Jhin's basic attacks, traps, or allies within the last 4 seconds.","Jhin places invisible traps around the map. Watch where you step!","Jhin's attacks are quite potent, but he runs out of ammo after the 4th shot. Use this window to jump him and burst him down."],"tags":["Marksman","Assassin"],"info":{"attack":10,"defense":2,"magic":6,"difficulty":6},"stats":{"arm":20,"ad":53,"aso":0,"crit":0,"hp":540,"mp":300,"mp5":6,"hp5":6,"range":550,"ms":330,"mr":30,"lvl":{"arm":3.5,"ad":4,"aso":0,"crit":0,"hp":85,"mp":50,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Whisper","descr":"Jhin's hand cannon, Whisper, is a precise instrument designed to deal superior damage. It fires at a fixed rate and carries only four shots. Jhin imbues the final bullet with dark magics to critically strike and deal bonus execute damage. Whenever Whisper crits, it inspires Jhin with a burst of movement speed.","img":"Jhin_P.png"},"spells":[{"name":"Dancing Grenade","descr":"Jhin launches a magical cartridge at an enemy. It can hit up to four targets and gains damage each time it kills.","tooltip":"Jhin launches a cartridge at the targeted enemy that deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}) \u003C\/span\u003Ephysical damage before bouncing to a nearby target that has not yet been hit.\u003Cbr\u003E\u003Cbr\u003EThe cartridge can hit a maximum of 4 times. Each kill by the cartridge increases the damage of subsequent hits by {{ e2 }}%.","cost":[40,45,50,55,60],"costType":" Mana","cd":[7,6.5,6,5.5,5],"range":[550,550,550,550,550],"key":"JhinQ"},{"name":"Deadly Flourish","descr":"Jhin brandishes his cane, firing a single shot with incredible range. It pierces through minions and monsters, but stops on the first champion hit. If the target was recently struck by Jhin's allies, lotus traps, or basic attacks, they are rooted.","tooltip":"Jhin fires a long range shot that stops on the first champion hit, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to it, and {{ e4 }}% of that damage to minions and monsters hit along the way.\u003Cbr\u003E\u003Cbr\u003EIf Deadly Flourish strikes a champion that has been hit by one of Jhin's basic attacks, Lotus Traps, or allies within the last 4 seconds it will root them for {{ e2 }} seconds and grants Jhin movement speed as though he had \u003Cspan class=\"colorFF5802\"\u003Ecrit\u003C\/span\u003E them.","cost":[50,60,70,80,90],"costType":" Mana","cd":[14,14,14,14,14],"range":[3000,3000,3000,3000,3000],"key":"JhinW"},{"name":"Captive Audience","descr":"Jhin places an invisible lotus trap that blooms when walked over. It slows nearby enemies before dealing damage with an explosion of serrated petals. \u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#FFFFFF'\u003EBeauty in Death -\u003C\/font\u003E When Jhin kills an enemy champion, a lotus trap will bloom near their corpse.","tooltip":"Jhin places an invisible Lotus Trap that lasts {{ e5 }} minutes and activates when stepped on, revealing nearby enemies for 4 seconds.\u003Cbr\u003E\u003Cbr\u003EThe trap leaves behind a zone that slows enemies inside by {{ e7 }}% and detonates after 2 seconds, dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage ({{ e1 }}% damage on subsequent hits and vs. minions and monsters).\u003Cbr\u003E\u003Cbr\u003EJhin prepares a new trap every \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E seconds and can store 2 at once. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFFFF\"\u003EBeauty in Death -\u003C\/span\u003E When Jhin kills an enemy champion a Lotus Trap will spawn and detonate where they were killed.","cost":[30,35,40,45,50],"costType":" Mana","cd":[2,2,2,2,2],"range":[750,750,750,750,750],"key":"JhinE"},{"name":"Curtain Call","descr":"Jhin channels, transforming Whisper into a shoulder-mounted mega-cannon. It is able to fire 4 super shots at extreme range that pierce through minions and monsters, but stop on the first champion impacted. Whisper cripples enemies hit, which slows them and deals execute damage. The 4th shot is perfectly crafted, epically powerful, and guaranteed to critically strike.","tooltip":"Jhin sets up and channels, enabling him to fire 4 super shots at extreme range in a cone in front of him. The shots stop on the first champion hit, slowing it by {{ e3 }}% for {{ e4 }} seconds and dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage, increased by {{ e5 }}% for each 1% health the target is missing (up to {{ f2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f3 }})\u003C\/span\u003E). The 4th shot \u003Cspan class=\"colorFF5802\"\u003Ecrits\u003C\/span\u003E for \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}%\u003C\/span\u003E damage.","cost":[100,100,100],"costType":" Mana","cd":[120,105,90],"range":[25000,25000,25000],"key":"JhinR"}]}