{"id":37,"key":"Sona","name":"Sona","title":"Maven of the Strings","lore":"Sona has no memories of her true parents. As an infant, she was found abandoned on the doorstep of an Ionian adoption house, nestled atop an ancient instrument in an exquisite case of unknown origins. She was an unusually well-behaved child, always quiet and content. Her caretakers were sure she would find a home quickly, but it soon became apparent that what they mistook for uncommon geniality was actually an inability to speak or to produce any sound whatsoever. Sona remained at the adoption house until her teens, watching in hopeless silence as prospective adopters passed her by. During this time, the caretakers sold her unusual instrument to anxious collectors, hoping to build her a trust. For a myriad of bizarre and unexpected reasons, however, it would be returned, or simply appear again outside the house.\u003Cbr\u003E\u003Cbr\u003EWhen a wealthy Demacian woman named Lestara Buvelle learned of the instrument, she immediately embarked to Ionia. When the caretakers showcased the instrument for her, she rose wordlessly and explored the house, stopping outside Sona's room. Without hesitation, Lestara adopted her and left a generous donation for the instrument. With Lestara's guidance, Sona discovered a deep connection with the instrument which Lestara called an 'etwahl'. In her hands, it played tones which stilled or quivered the hearts of those around her. Within months, she was headlining with the mysterious etwahl for sold-out audiences. She played as though plucking heartstrings, effortlessly manipulating the emotions of her listeners - all without a single written note. In secret, she discovered a potent and deadly use for her etwahl, using its vibrations to slice objects from a distance. She honed this discipline in private, mastering her gift. When she felt prepared, she went to the only place which could offer her a fitting recital: the League of Legends.\u003Cbr\u003E\u003Cbr\u003E''Her melody moves the soul, her silence sunders the body.''\u003Cbr\u003E-- Jericho Swain, after attending her concert","skins":[{"id":37000,"name":"default","num":0},{"id":37001,"name":"Muse Sona","num":1},{"id":37002,"name":"Pentakill Sona","num":2},{"id":37003,"name":"Silent Night Sona","num":3},{"id":37004,"name":"Guqin Sona","num":4},{"id":37005,"name":"Arcade Sona","num":5},{"id":37006,"name":"DJ Sona","num":6},{"id":37007,"name":"Sweetheart Sona","num":7}],"allytips":["Make sure to tag your allies while Sona's auras are active, but avoid getting caught out by enemies.","Save Crescendo for the game-altering moment.","Well-timed uses of Aria of Perseverance will grant you maximum survivability."],"enemytips":["Spread out when you see Sona so she can't make your entire team dance.","Kill Sona first, as she will heal up her team if left alone for too long."],"tags":["Support","Mage"],"info":{"attack":5,"defense":2,"magic":8,"difficulty":4},"stats":{"arm":20.544,"ad":50.04,"aso":-0.03,"crit":0,"hp":482.36,"mp":340.6,"mp5":11.5,"hp5":5.424,"range":550,"ms":325,"mr":30,"lvl":{"arm":3.3,"ad":3,"aso":2.3,"crit":0,"hp":77,"mp":45,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Power Chord","descr":"After casting 3 spells, Sona's next attack deals bonus magic damage in addition to a bonus effect depending on what song Sona last activated.","img":"Sona_Passive_Charged.png"},"spells":[{"name":"Hymn of Valor","descr":"Sona plays the Hymn of Valor, sends out bolts of sound, dealing magic damage to two nearby enemies, prioritizing champions and monsters. Sona gains a temporary aura that grants allies tagged by the zone bonus damage on their next attack against enemies.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to the nearest two enemies (prioritizes champions) and changes her \u003Cspan class=\"colorEEEEEE\"\u003EPower Chord\u003C\/span\u003E bonus to \u003Cspan class=\"color4477FF\"\u003EStaccato\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMelody:\u003C\/span\u003E Sona gains an aura for {{ e3 }} seconds. Allied champions that enter the aura will gain an additional {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage on their next attack.","cost":[45,50,55,60,65],"costType":" Mana","cd":[8,8,8,8,8],"range":[825,825,825,825,825],"key":"SonaQ"},{"name":"Aria of Perseverance","descr":"Sona plays the Aria of Perseverance, sending out protective melodies, healing Sona and a nearby wounded ally. Sona gains a temporary aura that grants allies tagged by the zone a temporary shield.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Restores {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E health to Sona and a nearby allied champion (prioritizes most wounded) and changes her \u003Cspan class=\"colorEEEEEE\"\u003EPower Chord\u003C\/span\u003E bonus to \u003Cspan class=\"color44FF77\"\u003EDiminuendo\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMelody:\u003C\/span\u003E Sona gains an aura for {{ e3 }} seconds. Allied champions that enter the aura will gain a shield that prevents up to {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage within the next {{ e5 }} seconds.","cost":[80,85,90,95,100],"costType":" Mana","cd":[10,10,10,10,10],"range":[1000,1000,1000,1000,1000],"key":"SonaW"},{"name":"Song of Celerity","descr":"Sona plays the Song of Celerity, granting nearby allies bonus Movement Speed. Sona gains a temporary aura that grants allied champions tagged by the zone bonus Movement Speed on their next attack.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Grants Sona \u003Cspan class=\"color99FF99\"\u003E{{ f1*100 }}%\u003C\/span\u003E movement speed [{{ e1 }}% + {{ f2*100 }}% per 100 ability power] for {{ e9 }} seconds (or until damaged) and changes her \u003Cspan class=\"colorEEEEEE\"\u003EPower Chord\u003C\/span\u003E bonus to \u003Cspan class=\"colorDD5599\"\u003ETempo\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMelody:\u003C\/span\u003E Sona gains an aura for {{ e3 }} seconds. Allied champions that enter the aura will gain \u003Cspan class=\"color99FF99\"\u003E{{ f3*100 }}%\u003C\/span\u003E movement speed for {{ e5 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003ESona's personal movement speed increase will always last at least {{ e5 }} seconds.\u003C\/i\u003E\u003C\/span\u003E","cost":[65,65,65,65,65],"costType":" Mana","cd":[12,12,12,12,12],"range":[430,430,430,430,430],"key":"SonaE"},{"name":"Crescendo","descr":"Sona plays her ultimate chord, stunning enemy champions and forcing them to dance and dealing magic damage to them. Each rank reduces the base cooldown of Sona's basic abilities.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EStrikes an irresistible chord, stunning enemy Champions and forcing them to dance for {{ e2 }} seconds and take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EReduces the base cooldown of Sona's basic abilities by {{ e3 }}%.","cost":[100,100,100],"costType":" Mana","cd":[140,120,100],"range":[900,900,900],"key":"SonaR"}]}