{"id":29,"key":"Twitch","name":"Twitch","title":"the Plague Rat","lore":"H.I.V.E. Incident Report\u003Cbr\u003ECode Violation: Industrial Homicide\u003Cbr\u003ECasefile Status: Unsolved\u003Cbr\u003EInvestigating Agent: Rol, P.\u003Cbr\u003E\u003Cbr\u003ETeam responded to report of suspicious character, criminal activity; proceeded to Sump Works, Sector 90TZ. Sector 90TZ notably absent. In its place: sinkhole, smoke, noxious fumes. Interviews with private security indicate urgent need for better private security.\u003Cbr\u003EResponse team entered sinkhole. Toxic runoff had melted away building wreckage. Two survivors located, one partially liquefied and dripping off catwalk. Six deceased bodies found among wreckage, three of them partial; two appear to predate incident. Causes of death include acute deceleration, caustic liquidation, and\/or fatal crossbow wounds. Unclear if lab's destruction was itself the perpetrator's motive or an attempt to cover tracks.\u003Cbr\u003E\u003Cbr\u003ESurvivor #1 (Ra Qintava, facility researcher) brought up for interview, but unable to provide statement due to 1) post-traumatic stress and 2) liquefaction of tongue and lower jaw. Awaiting toxin screen and prosthesis fitting.\u003Cbr\u003E\u003Cbr\u003ESearch-and-rescue discovered apparent shantytown constructed from refuse. Recovered items include:\u003Cbr\u003E\u003Cbr\u003E     57 waterlogged romance novels, illegible, with edits made in crayon\u003Cbr\u003E     108 bottles, unlabeled (possible toxic runoff or discarded shampoo remnants)\u003Cbr\u003E     200 pounds chewing gum (possible installation art project)\u003Cbr\u003E     1 jar toenails, labeled by toe\/finger, date, and mood\u003Cbr\u003ESurvivor #2 (Valori Olant, Sludge Analyst) in recovery; regained lucidity following prolonged therapeutic electrocution. Statement transcript excerpt follows:\u003Cbr\u003E\u003Cbr\u003E     V.O.: GOT TO DO SOMETHING - \u003Cbr\u003E     NURSE: She's lost so much blood --\u003Cbr\u003E     P.R.: Her co-workers lost a lot more than that --\u003Cbr\u003E     V.O.: IT'S STILL OUT THERE!\u003Cbr\u003E     P.R.: Ma'am, I need you to focus. Tell me what he looked like.\u003Cbr\u003E     V.O.: LIKE A RAT! (pause)\u003Cbr\u003E     NURSE: Like a what?\u003Cbr\u003E     P.R.: You mean, small? Beady-eyed? Sorta rat-faced -- ?\u003Cbr\u003E     V.O.: I MEAN IT LOOKED LIKE A GIANT GODSDAMNED RAT! (pause). WITH A CROSSBOW! (pause).\u003Cbr\u003E     P.R.: (to nurse) Can we moderate her painkillers?\u003Cbr\u003E     V.O.: YOU'RE NOT LISTENING! IT'S A HOMICIDAL, PSYCHOPATHIC, GIANT FREAKING RAT! \u003Cbr\u003E     IN A WAISTCOAT!\u003Cbr\u003E     P.R.: Nurse?\u003Cbr\u003E     NURSE: (injecting Olant's arm with sedative) On it.\u003Cbr\u003E     [EDIT]\u003Cbr\u003E     V.O.: We were just scientists, working on refining human waste into inexpensive baby formula... [EDIT] I saw - I don't know how else to - this crazed, enormous RAT - screaming at us! Kicking over vats! Spitting on our food! [EDIT] The lab was sealed. Industrial waste was spilling everywhere. Nowhere to run. [EDIT] I woke up in the dark. Well, the acid had melted my eyeballs. I could SMELL the twitchy bastard inches from my face. It said, 'NOBODY STEALS TWITCH'S JUICE!' cackled wildly, and skittered off... I can still smell it in my mind. OH MY GODS, I CAN STILL SMELL IT-\u003Cbr\u003E\u003Cbr\u003EEnd transcript. At this point victim began screaming; has yet to stop. \u003Cbr\u003E\u003Cbr\u003E[UPDATE: Qintava, Written Testimony]\u003Cbr\u003ESuspect summary, as reported:\u003Cbr\u003E     NAME\/KNOWN ALIASES: ''Twitch.''\u003Cbr\u003E     SEX: Male (unconfirmed).\u003Cbr\u003E     AGE: Unknown.\u003Cbr\u003E     HEIGHT: 4'9'' (hunched) \u003Cbr\u003E     WEIGHT: \u003C 99 lbs. (wet). \u003Cbr\u003E     DISTINGUISHING FEATURES: Is a giant rat. \u003Cbr\u003E     STATUS: At large; armed, extremely dangerous; DO NOT ENGAGE.\u003Cbr\u003E\u003Cbr\u003EH.I.V.E - Enforcing Progress!","skins":[{"id":29000,"name":"default","num":0},{"id":29001,"name":"Kingpin Twitch","num":1},{"id":29002,"name":"Whistler Village Twitch","num":2},{"id":29003,"name":"Medieval Twitch","num":3},{"id":29004,"name":"Gangster Twitch","num":4},{"id":29005,"name":"Vandal Twitch","num":5},{"id":29006,"name":"Pickpocket Twitch","num":6},{"id":29007,"name":"SSW Twitch","num":7}],"allytips":["Twitch's Attack Speed is among the highest in the game; try purchasing items with on-hit effects such as Black Cleaver or Wit's End.","Contaminate has a large range; apply as many stacks of Deadly Venom as possible before using it.","You can catch up to an enemy out of attack range with Venom Cask."],"enemytips":["Twitch is fragile. Work with teammates to focus on him when you're able to catch him out of Camouflage.","Spell Shields won't block the damage from Deadly Venom, but they will block the effects Twitch can trigger with it.","If you suspect Twitch has left the lane, let your teammates know that Twitch is ''MIA.''"],"tags":["Marksman","Assassin"],"info":{"attack":9,"defense":2,"magic":3,"difficulty":6},"stats":{"arm":23.04,"ad":55.46,"aso":-0.08,"crit":0,"hp":525.08,"mp":287.2,"mp5":7.256,"hp5":6.008,"range":550,"ms":330,"mr":30,"lvl":{"arm":3,"ad":2.41,"aso":3.38,"crit":0,"hp":81,"mp":40,"mp5":0.45,"hp5":0.6,"mr":0}},"pass":{"name":"Deadly Venom","descr":"Twitch's basic attacks infect the target, dealing true damage each second.","img":"Twitch_Passive.png"},"spells":[{"name":"Ambush","descr":"Twitch becomes Camouflaged for a short duration and gains Movement Speed. When leaving Camouflage, Twitch gains Attack Speed for a short duration.\u003Cbr\u003E\u003Cbr\u003EWhen an enemy champion with Deadly Venom dies, Ambush's cooldown is reset.","tooltip":"Twitch becomes \u003Cspan class=\"colorcd90ee\"\u003ECamouflaged\u003C\/span\u003E and gains {{ e3 }}% Movement Speed for {{ e2 }} seconds. This bonus triples when he is nearby an enemy champion that cannot see him. \u003Cbr\u003E\u003Cbr\u003ETwitch gains {{ e1 }}% Attack Speed for {{ e6 }} seconds after exiting Ambush. Ambush resets when a champion dies while affected by \u003Cspan class=\"color3ca126\"\u003EDeadly Venom.\u003C\/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#cd90ee'size='16'\u003E\u003Cu\u003EStealth - Camouflage:\u003C\/u\u003E\u003C\/span\u003E \u003Cfont color='#8C8C8C'size='16'\u003ETwitch is hidden from view while enemy champions remain outside his detection radius. Attacking or casting spells ends Camouflage.\u003C\/span\u003E","cost":[40,40,40,40,40],"costType":" Mana","cd":[16,16,16,16,16],"range":[20,20,20,20,20],"key":"TwitchQ"},{"name":"Venom Cask","descr":"Twitch hurls a cask of venom that explodes in an area, slowing targets and applying deadly venom to the target.","tooltip":"Twitch hurls a cask that adds a stack of \u003Cspan class=\"color3ca126\"\u003EDeadly Venom\u003C\/span\u003E to all enemies struck and leaves behind a toxic cloud that persists for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EEnemies that remain within the cloud have {{ e2 }}% reduced Movement Speed and receive an additional stack of \u003Cspan class=\"color3ca126\"\u003EDeadly Venom\u003C\/span\u003E each second.","cost":[70,70,70,70,70],"costType":" Mana","cd":[13,12,11,10,9],"range":[950,950,950,950,950],"key":"TwitchW"},{"name":"Contaminate","descr":"Twitch wreaks further havoc on poisoned enemies with a blast of his vile diseases.","tooltip":"Deals {{ e2 }} physical damage plus {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E per stack of \u003Cspan class=\"color3ca126\"\u003EDeadly Venom\u003C\/span\u003E to all nearby enemies affected by \u003Cspan class=\"color3ca126\"\u003EDeadly Venom.\u003C\/span\u003E \u003Cspan class=\"colora3554e\"\u003E(Max Stack Damage: {{ f2 }})\u003C\/span\u003E","cost":[50,60,70,80,90],"costType":" Mana","cd":[12,11,10,9,8],"range":[1200,1200,1200,1200,1200],"key":"TwitchE"},{"name":"Spray and Pray","descr":"Twitch unleashes the full power of his crossbow, shooting bolts over a great distance that pierce all enemies caught in their path.","tooltip":"For {{ e2 }} seconds Twitch gains {{ e5 }} Attack Range and {{ e1 }} Bonus Attack Damage.\u003Cbr\u003E\u003Cbr\u003EFor the duration, his basic attacks become piercing bolts that deal {{ e3 }}% less damage to subsequent targets, down to a minimum of {{ e4 }}% damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#cd90ee'size='16'\u003E\u003Cu\u003EStealth - Camouflage:\u003C\/u\u003E\u003C\/span\u003E \u003Cfont color='#8C8C8C'size='16'\u003EActivating Spray and Pray does not end Camouflage.","cost":[100,100,100],"costType":" Mana","cd":[90,90,90],"range":[1200,1200,1200],"key":"TwitchR"}]}