{"id":106,"key":"Volibear","name":"Volibear","title":"the Thunder's Roar","lore":"The unforgiving northern reaches of the Freljord are home to the Ursine, a fierce and warlike race that has endured the barren tundra for thousands of years. Their leader is a furious adversary who commands the force of lightning to strike fear within his foes: Volibear. Both a warrior and a mystic, Volibear seeks to defend the ancient ways and the warrior spirit of his tribe.\u003Cbr\u003E\u003Cbr\u003EThough history recorded their once legendary feats in battle, the Ursine now lived in tranquil seclusion. The warriors were headed by a triumvirate of leaders who maintained a long-lived isolation, avoiding the petty affairs and conflicts of others. As shaman to the three, Volibear was a respected sage known for his insight. It was an era of unprecedented peace, but Volibear felt dread stirring within him. Prosperity was turning the tribe soft and weak, and many had long forgotten the sacred art of war. In time, Volibear felt the fire of their souls would be extinguished. When he revealed his misgivings to the triumvirate, they refused to listen and warned him to know his place.\u003Cbr\u003E\u003Cbr\u003ESeeking wisdom, Volibear undertook a perilous climb to the peak of the Ursine's sacred mountain, a place forever shrouded in a thundering maelstrom. The eye of the storm was said to bestow portents, and legend held that the tempest would mark the next great chieftain of the tribe. As Volibear ascended the peak, he was struck by an unnatural bolt of lightning. When the shaman awoke, he was possessed by a horrific vision of the Freljord utterly consumed by darkness. Volibear saw an unprepared and complacent Ursine force slaughtered by terrible creatures of ice. In an instant, he knew his race would perish if they did not prepare for war.\u003Cbr\u003E\u003Cbr\u003EVolibear rushed down the mountainside to recount what he had seen, but found the path blocked by three Ursine - the triumvirate. Knowing he would end the lasting peace, they refused to heed Volibear's warning and demanded his silence, by his word - or his death. Resolute and adamant, Volibear swore that the Ursine's very survival depended on his message, and launched into ferocious combat against the three. A terrible clash ensued, and just as Volibear succumbed to his opponents, he called upon the power of the maelstrom. Unleashing raw lightning, he struck the trio down with a thunderous blow. Stunned and astonished, the triumvirate beheld the sign of Ursine leadership: the force of the sacred storm.\u003Cbr\u003E\u003Cbr\u003ERecognizing his foretold ascendance, the triumvirate appointed Volibear as the Ursine's new leader. His influence was swift and decisive: he roused his tribe from complacency, revived their battle-hardened traditions, and allied with Sejuani, the warrior who would fight with them against the coming evil. With time, the tribe grew lean and fierce, becoming known again as fearsome warriors of legend. Volibear and the Ursine now stand ready for the dark day that looms on the icy horizon.\u003Cbr\u003E\u003Cbr\u003E''The Ursine cannot know peace without war.''\u003Cbr\u003E\u003Cbr\u003E-- Volibear","skins":[{"id":106000,"name":"default","num":0},{"id":106001,"name":"Thunder Lord Volibear","num":1},{"id":106002,"name":"Northern Storm Volibear","num":2},{"id":106003,"name":"Runeguard Volibear","num":3},{"id":106004,"name":"Captain Volibear","num":4},{"id":106005,"name":"El Rayo Volibear","num":5}],"allytips":["Lead the charge with Rolling Thunder and slow enemies with Majestic Roar.","Volibear benefits a great deal from additional Health and cooldown reduction.","You must attack three times in rapid succession before Frenzy can be activated - having the toughness to survive for a long time is one way to accomplish this goal."],"enemytips":["Volibear can gain great Movement Speed while chasing targets, but he gains much less of a bonus when running away.","Volibear regenerates a large amount of Health when he drops to critical Health.","Slowing or stunning Volibear when he tries to charge will greatly reduce his effectiveness."],"tags":["Fighter","Tank"],"info":{"attack":7,"defense":7,"magic":4,"difficulty":3},"stats":{"arm":26.38,"ad":59.544,"aso":-0.05,"crit":0,"hp":584.48,"mp":270.4,"mp5":8.092,"hp5":8.092,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.3,"aso":2.67,"crit":0,"hp":86,"mp":30,"mp5":0.65,"hp5":0.65,"mr":1.25}},"pass":{"name":"Chosen of the Storm","descr":"Volibear heals rapidly for a few seconds when his Health drops to a critical level.","img":"VolibearPassive.png"},"spells":[{"name":"Rolling Thunder","descr":"Volibear drops to all fours and runs faster. This bonus speed increases when chasing enemy champions. The first enemy he attacks is thrown backwards over Volibear.","tooltip":"Volibear drops to all fours to hunt his enemies, gaining {{ e4 }}% Movement Speed for {{ e3 }} seconds. This bonus is enhanced to {{ e2 }}% Movement Speed while moving toward enemy champions.\u003Cbr\u003E\u003Cbr\u003EVolibear's next attack during this time deals an additional {{ e1 }} physical damage and flings the target behind him.","cost":[40,40,40,40,40],"costType":" Mana","cd":[12,11,10,9,8],"range":[300,300,300,300,300],"key":"VolibearQ"},{"name":"Frenzy","descr":"Volibear's repeated attacks grant him additional Attack Speed. Once Volibear has repeatedly attacked three times, he can perform a vicious bite on his target which deals increased damage based on the target's missing Health.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EVolibear gains {{ e1 }}% Attack Speed with each attack. Stacks up to {{ e2 }} times.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EWhen Volibear has {{ e2 }} stacks of Frenzy, he can bite an enemy to deal {{ e3 }} \u003Cspan class=\"colorCC3300\"\u003E(+{{ f1 }} [{{ e4 }}% of bonus Health])\u003C\/span\u003E physical damage, increased by {{ e5 }}% for each {{ e7 }}% Health the target is missing. If Volibear bites a monster, Frenzy's cooldown is reduced by {{ e6 }}%.","cost":[35,35,35,35,35],"costType":" Mana","cd":[18,18,18,18,18],"range":[350,350,350,350,350],"key":"VolibearW"},{"name":"Majestic Roar","descr":"Volibear lets out a powerful roar that damages and slows enemies. Minions and monsters are feared as well.","tooltip":"Volibear deals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and slows them by {{ e1 }}% for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EMinions and monsters are feared as well.","cost":[60,65,70,75,80],"costType":" Mana","cd":[11,11,11,11,11],"range":[425,425,425,425,425],"key":"VolibearE"},{"name":"Thunder Claws","descr":"Volibear erupts with chain lightning, damaging a number nearby enemies. The power of the storm causes Volibear's attacks to blast his targets with lightning that bounces to other nearby enemies.","tooltip":"Volibear erupts with chain lightning, striking up to 4 nearby enemies with {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003EFor the next {{ e3 }} seconds, the storm empowers Volibear, causing his basic attacks to deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage that chains to {{ e4 }} nearby enemies.","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[500,500,500],"key":"VolibearR"}]}