{"id":7,"key":"Leblanc","name":"LeBlanc","title":"the Deceiver","lore":"Every city has its dark side, even one whose reputation is already of a questionable hue. Noxus - though its name is already invoked with a mixture of reverence and revulsion - is no exception to this simple truth. Deep within the winding dungeons that honeycomb the earth beneath its dark, meandering streets lies the real underbelly of this sprawling metropolis, a haven for all manner of malevolence. Amongst the cults, covens, and secret societies that call this labyrinth their home, LeBlanc, the Deceiver, presides over the Black Rose, a remnant from a lost, yet similarly unscrupulous time in Noxian history. Ruthless and seemingly ageless, LeBlanc and her ilk were a mainstay in Noxian political affairs during the era before the militarization of the Noxian government. In those days, this guild of powerful magicians met in secret to further their hidden agenda, and to hone a craft more subtle than that preferred by those currently in power.\u003Cbr\u003E\u003Cbr\u003EWhile their exact motives have always remained mysterious, it was widely believed that the Black Rose was the true power behind the throne while the aristocracy still reigned in Noxus. When raw martial prowess became the ultimate determination of whose will held sway in the Empire, the Black Rose seemed to vanish overnight. Many believed that perhaps their time had simply passed, and that its members had put aside their quests for social and political dominance. When LeBlanc reemerged at the gates of the Institute of War, however, it became clear that these masters of shadow and flame had simply been biding their time, waiting for a new global authority to emerge: the League of Legends.\u003Cbr\u003E\u003Cbr\u003E''The world is very different for those who cannot see beyond what is placed before their very eyes.''\u003Cbr\u003E-- LeBlanc, the Deceiver","skins":[{"id":7000,"name":"default","num":0},{"id":7001,"name":"Wicked LeBlanc","num":1},{"id":7002,"name":"Prestigious LeBlanc","num":2},{"id":7003,"name":"Mistletoe LeBlanc","num":3},{"id":7004,"name":"Ravenborn LeBlanc","num":4},{"id":7005,"name":"Elderwood LeBlanc","num":5}],"allytips":["Distortion allows you to be aggressive with your other spells while being able to return to safety.","Using Distortion can help your positioning to land Ethereal Chains.","You can chain Sigil of Malice and Ethereal Chains to prevent characters with blink from escaping for up to 4 seconds."],"enemytips":["LeBlanc's ultimate can create fake LeBlancs during her spellcast or, rarely, at a distant position. ","The fake LeBlanc created at a distance will always run at the nearest Champion, cast a harmless spell, then immediately disappear.","Attacking LeBlanc first avoids most of her tricks, especially if she's recently used her dash, Distortion.","Stunning or silencing LeBlanc will prevent her from activating the return part of Distortion."],"tags":["Assassin","Mage"],"info":{"attack":1,"defense":4,"magic":10,"difficulty":9},"stats":{"arm":21.88,"ad":54.88,"aso":0,"crit":0,"hp":516,"mp":334,"mp5":6,"hp5":7.4,"range":525,"ms":340,"mr":30,"lvl":{"arm":3.5,"ad":3.5,"aso":1.4,"crit":0,"hp":80,"mp":50,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Sigil of Malice","descr":"When LeBlanc damages an enemy with a spell, she marks the target for 4 seconds. After 1.5 seconds, LeBlanc's next spell shatters the Sigil to deal magic damage.\u003Cbr\u003E\u003Cbr\u003ESigil of Malice cannot occur again on the same unit for 5 seconds.","img":"LeblancP.png"},"spells":[{"name":"Shatter Orb","descr":"LeBlanc projects an orb towards her target, dealing magic damage. When Shatter Orb is empowered by Sigil of Malice, the spell bounces to the nearest ready Sigil of Malice (bounces deal reduced damage to minions).","tooltip":"Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. When Shatter Orb is empowered by Sigil of Malice, the spell bounces to the nearest ready Sigil of Malice (bounces deal {{ e7 }}% damage to minions). ","cost":[40,45,50,55,60],"costType":" Mana","cd":[6,6,6,6,6],"range":[700,700,700,700,700],"key":"LeblancQ"},{"name":"Distortion","descr":"LeBlanc rapidly dashes to a target location, dealing magic damage to nearby units. In the following 4 seconds, she can activate Distortion again to return to her starting location.","tooltip":"Dashes to target location, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in the target area.\u003Cbr\u003E\u003Cbr\u003EFor the next 4 seconds, she can activate Distortion again to return to her starting location.","cost":[70,80,90,100,110],"costType":" Mana","cd":[18,16,14,12,10],"range":[600,600,600,600,600],"key":"LeblancW"},{"name":"Ethereal Chains","descr":"LeBlanc flings illusionary chains towards a target location. If it hits an enemy unit, it will deal initial magic damage and shackle them. If the target remains shackled for 1.5 seconds, the target takes additional magic damage and is unable to move.","tooltip":"Launches a chain that shackles the first unit hit to LeBlanc, granting \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E of the unit and dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003EIf the target remains shackled for {{ e2 }} seconds they are rooted for {{ e2 }} seconds and take an additional {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. ","cost":[40,40,40,40,40],"costType":" Mana","cd":[0,0,0,0,0],"range":[925,925,925,925,925],"key":"LeblancE"},{"name":"Mimic","descr":"LeBlanc creates a clone and casts a mimicked version of one of her basic spells. The clone casts a fake copy of that spell. LeBlanc can instead send the clone far away, where it casts a fake copy of her most recently cast spell.","tooltip":"LeBlanc copies one of her spells and creates a \u003Cspan class=\"colorCC00FF\"\u003EMimic\u003C\/span\u003E decoy to cast it with her. The \u003Cspan class=\"colorCC00FF\"\u003EMimic\u003C\/span\u003E lasts {{ e7 }} seconds. \u003Cbr\u003E\u003Cbr\u003E\u003Cli\u003EShatter Orb deals {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage.\u003Cbr\u003EDistortion deals {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003EEthereal Chains deals {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage each time.\u003Cbr\u003EUsing this spell on itself invokes \u003Cspan class=\"colorDDDD77\"\u003EShadow of the Rose\u003C\/span\u003E.\u003C\/li\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EShadow of the Rose\u003C\/span\u003E\u003Cbr\u003EThe \u003Cspan class=\"colorCC00FF\"\u003EMimic\u003C\/span\u003E appears at target location and approaches the closest visible enemy Champion, then casts a fake version of LeBlanc's most recent basic ability. \u003Cbr\u003E\u003Cbr\u003EHas a separate \u003Cspan class=\"colorFFFFFF\"\u003E{{ f2 }} second\u003C\/span\u003E cooldown. This \u003Cspan class=\"colorCC00FF\"\u003EMimic\u003C\/span\u003E lasts much longer but cannot be controlled.","cost":[0,0,0],"costType":"Toggle","cd":[54,42,30],"range":[25000,25000,25000],"key":"LeblancR"}]}