{"id":60,"key":"Elise","name":"Elise","title":"the Spider Queen","lore":"''Beauty is power too, and can strike swifter than any sword.''\u003Cbr\u003E\u003Cbr\u003EElise is a deadly predator who dwells in a shuttered, lightless palace, deep in the Immortal Bastion of Noxus. Once she was mortal, the mistress of a once-powerful house, but the bite of a vile spider god transformed her into something beautiful, undying, and utterly inhuman. To maintain her eternal youth, Elise preys upon the innocent, and there are few who can resist her seductions.","skins":[{"id":60000,"name":"default","num":0},{"id":60001,"name":"Death Blossom Elise","num":1},{"id":60002,"name":"Victorious Elise","num":2},{"id":60003,"name":"Blood Moon Elise","num":3},{"id":60004,"name":"SKT T1 Elise","num":4}],"allytips":["Spider Form is most effective at finishing off enemies with low health; Human Form's Neurotoxin does more damage to healthy foes. ","When in Spider Form, Spiderlings will attack the target that Elise uses Venomous Bite on. ","Elise's Spider Form and Spider Form abilities do not cost mana and can be prioritized when you are trying to conserve mana."],"enemytips":["Elise's Spider Form is more dangerous when you are at low health, and her Human Form more potent when you are at high health.","Rappel will only move Elise straight up and down unless she can descend upon an enemy unit.","Rappel has a long cooldown. Elise is vulnerable after she has used it."],"tags":["Mage","Fighter"],"info":{"attack":6,"defense":5,"magic":7,"difficulty":9},"stats":{"arm":22.128,"ad":50.54,"aso":0,"crit":0,"hp":529.4,"mp":324,"mp5":6,"hp5":5.708,"range":550,"ms":325,"mr":30,"lvl":{"arm":3.35,"ad":3,"aso":1.75,"crit":0,"hp":80,"mp":50,"mp5":0.8,"hp5":0.6,"mr":0}},"pass":{"name":"Spider Queen","descr":"Human Form: When Elise's abilities hit an enemy, she gains a dormant Spiderling.\u003Cbr\u003E\u003Cbr\u003ESpider Form: Basic attacks deal bonus magic damage and restore health to Elise.","img":"ElisePassive.png"},"spells":[{"name":"Neurotoxin \/ Venomous Bite","descr":"Human Form: Deals damage based upon how high the target's Health is.\u003Cbr\u003E\u003Cbr\u003ESpider Form: Lunges at an enemy and deals damage based upon how low their Health is.","tooltip":"Deals magic damage equal to {{ e1 }} plus {{ e6 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}%)\u003C\/span\u003E of the target's current health. Maximum bonus against monsters: {{ e2 }}.","cost":[80,85,90,95,100],"costType":" Mana","cd":[6,6,6,6,6],"range":[625,625,625,625,625],"key":"EliseQ"},{"name":"Volatile Spiderling \/ Skittering Frenzy","descr":"Human Form: Releases a venom-gorged Spiderling that explodes when it nears a target.\u003Cbr\u003E\u003Cbr\u003ESpider Form: Elise and her Spiderlings gain Attack Speed.","tooltip":"Summons a venom-gorged Spiderling that moves to target location and explodes, dealing {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage when it nears an enemy or after 3 seconds.","cost":[60,70,80,90,100],"costType":" Mana","cd":[12,12,12,12,12],"range":[950,950,950,950,950],"key":"EliseW"},{"name":"Cocoon \/ Rappel","descr":"Human Form: Stuns the first enemy unit hit and reveals them if they are not stealthed.\u003Cbr\u003E\u003Cbr\u003ESpider Form: Elise and her Spiderlings ascend into the air and then descend upon target enemy.","tooltip":"Stuns the first enemy hit for {{ e5 }} seconds and reveals them if they are not stealthed.","cost":[50,50,50,50,50],"costType":" Mana","cd":[14,13,12,11,10],"range":[1075,1075,1075,1075,1075],"key":"EliseE"},{"name":"Spider Form","descr":"Transforms into a menacing spider, reducing her attack range in exchange for movement speed, new abilities, and a Spiderling swarm that will attack her foes.","tooltip":"Elise transforms into a menacing spider, sacrificing 425 attack range in exchange for {{ e3 }} movement speed and access to arachnid abilities. All dormant Spiderlings are awakened and will attack nearby foes.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003ESpiderlings: \u003C\/span\u003ESpiderlings deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage and take {{ e4 }}% reduced damage from multi-target abilities.","cost":[0,0,0,0],"costType":"No Cost","cd":[4,4,4,4],"range":[20,20,20,20],"key":"EliseR"}]}