{"id":8,"key":"Vladimir","name":"Vladimir","title":"the Crimson Reaper","lore":"There is a temple hidden in the mountains between Noxus and the Tempest Flats, where the secrets of an ancient and terrifying sorcery are kept. The area surrounding the temple is littered with the exsanguinated corpses of those who have mistakenly wandered too close. These served only to pique the curiosity of Vladimir, when - in his youth - he trekked through these mountains during his flight from Noxus. A day earlier, the teenaged Vladimir had brutally murdered two boys his age, for no better reason than to enjoy the intoxicating scarlet bloom that surged forth. He realized immediately that he would never be able to suppress his murderous desires, and if he remained in Noxus, his foul deeds were sure to catch up with him. Without hesitation, he abandoned the city-state, and journeyed south.\u003Cbr\u003E\u003Cbr\u003EThe trail of bodies led him to a crumbling stone temple. Inside he found an aging monk who appraised him with eyes of pure crimson. Vladimir surprised the monk by returning the wicked gaze with zeal. Recognizing the boy's sinister craving, the monk taught Vladimir how to manipulate and control the fluid of life, often practicing on passing travelers. When it came time for Vladimir to learn the final lesson, the monk warned that failure would result in death. Vladimir did not fail, but success bore a grisly surprise. During the ritual, every drop of the monk's blood was drawn from his body and fused with Vladimir's, imbuing him with his master's magical essence, and that of every hemomancer before him. Left alone and suddenly without purpose, Vladimir resolved to return to Noxus, demanding enrollment in the League to prove the supremacy of his craft. When the Noxian High Command observed the gruesome fates which befell the palace guards, they elected to avail themselves of Vladimir's unsavory talents.\u003Cbr\u003E\u003Cbr\u003E''That which runs through you will run you through.''\u003Cbr\u003E-- Vladimir","skins":[{"id":8000,"name":"default","num":0},{"id":8001,"name":"Count Vladimir","num":1},{"id":8002,"name":"Marquis Vladimir","num":2},{"id":8003,"name":"Nosferatu Vladimir","num":3},{"id":8004,"name":"Vandal Vladimir","num":4},{"id":8005,"name":"Blood Lord Vladimir","num":5},{"id":8006,"name":"Soulstealer Vladimir","num":6},{"id":8007,"name":"Academy Vladimir","num":7}],"allytips":["Transfusion instantly deals damage to the enemy before healing Vladimir, making it one of the best last hitting tools in the game.","Cast Hemoplague where it will afflict the most units.","Sanguine Pool pops incoming missiles, so it can be used to dodge disables."],"enemytips":["Try to take Vladimir down before Hemoplague detonates, as it will heal him for each afflicted enemy Champion.","Making Vladimir use Sanguine Pool at the start of a fight will maximize the Health cost of the ability to him.","Items that counter Health stacking, such as Liandry's Torment and Blade of the Ruined King, are very effective against Vladimir."],"tags":["Mage","Tank"],"info":{"attack":2,"defense":6,"magic":8,"difficulty":7},"stats":{"arm":23,"ad":55,"aso":-0.05,"crit":0,"hp":525,"mp":2,"mp5":0,"hp5":7.008,"range":450,"ms":330,"mr":30,"lvl":{"arm":3.3,"ad":3,"aso":2,"crit":0,"hp":84,"mp":0,"mp5":0,"hp5":0.6,"mr":0}},"pass":{"name":"Crimson Pact","descr":"Every 40 points of bonus Health gives Vladimir 1 Ability Power and every 1 point of Ability Power gives Vladimir 1.4 bonus Health (does not stack with itself).","img":"VladimirP.png"},"spells":[{"name":"Transfusion","descr":"Vladimir steals life from the target enemy. When Vladimir's resource is full, Transfusion will benefit from massively increased damage and healing for a brief time.","tooltip":"Vladimir drains the lifeforce of his target, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and healing himself for {{ e2 }}\u003Cspan class=\"color99ff99\"\u003E (+{{ a2 }})\u003C\/span\u003E health. After casting Transfusion twice, Vladimir gains \u003Cspan class=\"colorFFB3B3\"\u003ECrimson Rush\u003C\/span\u003E the next time it becomes available to cast.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFB3B3\"\u003ECrimson Rush:\u003C\/span\u003E Vladimir is briefly hasted and for the next {{ e8 }} seconds Transfusion deals {{ e7 }}% increased damage and heals for an additional \u003Cspan class=\"colorFFFFFF\"\u003E{{ f7 }}\u003C\/span\u003E plus {{ e5 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ f6 }}%)\u003C\/span\u003E of his missing health (empowered heal has {{ e9 }}% effectiveness against minions). ","cost":[0,0,0,0,0],"costType":"No Cost","cd":[9,8,7,6,5],"range":[600,600,600,600,600],"key":"VladimirQ"},{"name":"Sanguine Pool","descr":"Vladimir sinks into a pool of blood, becoming untargetable for 2 seconds. Additionally, enemies on the pool are slowed and Vladimir siphons life from them.","tooltip":"Vladimir sinks into a pool of blood for 2 seconds, gaining a brief haste and becoming untargetable while slowing enemies above him by {{ e3 }}%.\u003Cbr\u003E\u003Cbr\u003EVladimir deals {{ e1 }} \u003Cspan class=\"colorCC3300\"\u003E(+{{ f1 }}) [{{ e4 }}% of bonus Health]\u003C\/span\u003E magic damage over the duration and heals himself for {{ e5 }}% of that amount.\u003Cbr\u003E\u003Cbr\u003ESanguine Pool can be cast while charging Tides of Blood.","cost":[0,0,0,0,0],"costType":"% of current Health","cd":[28,25,22,19,16],"range":[350,350,350,350,350],"key":"VladimirW"},{"name":"Tides of Blood","descr":"Vladimir pays his own health to charge up a reservoir of blood which, when released, deals damage in the area around him but can be blocked by enemy units.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EFirst Cast: \u003C\/span\u003EVladimir charges up a reservoir of blood, spending up to \u003Cspan class=\"colorCC3300\"\u003E{{ e2 }}% of his max Health ({{ f3 }})\u003C\/span\u003E to increase this spell's damage. While at full charge, Vladimir is slowed.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ESecond Cast: \u003C\/span\u003EVladimir unleashes a nova of blood at surrounding enemies which deals between {{ e3 }}\u003Cspan class=\"colorCC3300\"\u003E (+{{ f2 }})\u003C\/span\u003E\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E and {{ e0 }}\u003Cspan class=\"colorCC3300\"\u003E (+{{ f4 }})\u003C\/span\u003E\u003Cspan class=\"color99FF99\"\u003E (+{{ a2 }})\u003C\/span\u003E magic damage and, at full charge, briefly slows by {{ e9 }}%. Targets hit block a portion of the nova.\u003Cbr\u003E\u003Cbr\u003ETides of Blood will release automatically if held for more than {{ e7 }} seconds.","cost":[0,0,0,0,0],"costType":"% of max Health","cd":[13,11,9,7,5],"range":[600,600,600,600,600],"key":"VladimirE"},{"name":"Hemoplague","descr":"Vladimir infects an area with a virulent plague. Affected enemies take increased damage for the duration. After a few seconds, Hemoplague deals magic damage to infected enemies and heals Vladimir for each enemy Champion hit.","tooltip":"Vladimir infects enemies in a target area with a virulent plague, causing them to take {{ e2 }}% increased damage from all sources for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAfter {{ e4 }} seconds, Vladimir deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all infected targets. If Hemoplague damages an enemy Champion, Vladimir heals himself for {{ f4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f3 }})\u003C\/span\u003E, plus {{ e5 }}% for each Champion beyond the first.","cost":[0,0,0],"costType":"No Cost","cd":[150,135,120],"range":[625,625,625],"key":"VladimirR"}]}