{"id":43,"key":"Karma","name":"Karma","title":"the Enlightened One","lore":"Karma is a woman of indomitable will and unbound spiritual power. She is the soul of Ionia made manifest and an inspiring presence on the battlefield, shielding her allies and turning back her foes. A strong leader torn between tradition and revolution, Karma seeks to protect the peace of Ionia - by force if necessary.\u003Cbr\u003E\u003Cbr\u003EKarma once lived a tranquil life in a small Ionian village. Led by elder monks, the villagers practiced a tradition of benevolent magic and pacifism. Known for her powerful connection to the spiritual realm and beloved as a just mediator amongst her people, Karma embraced these traditions as an essential aspect of the enlightenment sought by all Ionians. \u003Cbr\u003E\u003Cbr\u003EHer inner peace was tested when the armies of Noxus invaded Ionia. While the village's elder monks insisted their peaceful ways would spare them from violence, Karma had heard enough tales of Noxian cruelty to openly question the elders' wisdom. Stern and unmoving, they told her to trust in tradition. When the invaders marched on the village, the elder monks rode out to negotiate a bloodless end to the battle. The Noxian general was offended by their show of weakness and slaughtered the monks himself as he ordered his soldiers to strike the village.\u003Cbr\u003E\u003Cbr\u003EAs the Noxians advanced, the villagers prepared to accept death, bound to their peaceful vows. But Karma would not accept death and instead saw another way: sacrificing a single life to spare many others. To save her people, she drew upon the power within and summoned the full force of her will. A burst of spirit fire emerged from her body and spiraled towards the Noxian general. The flame took the form of twin dragons, the symbol of Ionia itself. It was the first time Karma had ever used her powers to harm instead of protect, and neither she nor the villagers had ever seen anything like it. When the magic subsided, the general had fallen before her and his soldiers had scattered. The opposing forces surrendered to Karma's strength leaving her people, and their traditions, untouched. \u003Cbr\u003E\u003Cbr\u003EWhile the war raged on, Karma became a formidable leader of the Ionian resistance, but the conflict did not end when Noxus's armies fled the Ionian shores. Ionia became divided between the resistance fighters who craved vengeance and the monks who demanded a return to spiritual tradition. Karma saw a third path, one that combined the strength Ionia found in war with the peaceful traditions the nation still held dear. She now seeks to return her ravaged land to an enduring peace.\u003Cbr\u003E\u003Cbr\u003E''Your spirit is something no one can take from you. Use it wisely.'' \u003Cbr\u003E-- Karma","skins":[{"id":43000,"name":"default","num":0},{"id":43001,"name":"Sun Goddess Karma","num":1},{"id":43002,"name":"Sakura Karma","num":2},{"id":43003,"name":"Traditional Karma","num":3},{"id":43004,"name":"Order of the Lotus Karma","num":4},{"id":43005,"name":"Warden Karma","num":5},{"id":43006,"name":"Winter Wonder Karma","num":6}],"allytips":["Gathering Fire rewards aggressive play. Look to land abilities and basic attacks on your opponent to lower Mantra's cooldown and stay on the offensive.","When using Focused Resolve, slow your opponents with Inner Flame or speed yourself up with Inspire if you're having trouble sticking to a target. ","Don't be too conservative with Mantra. Gathering Fire is strongest in teamfights, making it easy to recharge Mantra multiple times."],"enemytips":["Karma's passive lowers her Mantra cooldown when she hits enemy champions with abilities and basic attacks. Deny her from getting free hits on you.","Karma's Soulflare erupts for bonus damage in the area in which it's placed. React quickly and escape the circle to avoid taking heavy damage.","Focused Resolve is a strong disengage tool. Create distance to avoid being rooted and seek to engage afterwards."],"tags":["Mage","Support"],"info":{"attack":1,"defense":7,"magic":8,"difficulty":5},"stats":{"arm":20.384,"ad":53.544,"aso":0,"crit":0,"hp":522.44,"mp":374,"mp5":8.5,"hp5":5.624,"range":525,"ms":335,"mr":30,"lvl":{"arm":3.8,"ad":3.3,"aso":2.3,"crit":0,"hp":83,"mp":50,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Gathering Fire","descr":"Reduces Mantra's cooldown each time Karma damages an enemy champion with one of her abilities (Half-effect for Karma's basic attacks)","img":"Karma_Passive.png"},"spells":[{"name":"Inner Flame","descr":"Karma sends forth a ball of spirit energy that explodes and deals damage upon hitting an enemy unit.\u003Cbr\u003E\u003Cbr\u003EMantra Bonus: In addition to the explosion, Mantra increases the destructive power of her Inner Flame, creating a cataclysm which deals damage after a short delay.","tooltip":"Fires a blast of energy that explodes upon enemy contact, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slowing Movement Speed by {{ e2 }}% for {{ e3 }} seconds. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMantra Bonus - Soulflare:\u003C\/span\u003E Deals {{ f1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E additional magic damage and leaves a circle of flame that slows enemies by {{ f3 }}%. After 1.5 seconds the circle erupts, dealing {{ f2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in the area.","cost":[50,55,60,65,70],"costType":" Mana","cd":[7,6.5,6,5.5,5],"range":[950,950,950,950,950],"key":"KarmaQ"},{"name":"Focused Resolve","descr":"Karma creates a tether between herself and a targeted enemy, dealing damage and revealing them. If the tether is not broken, the enemy will be rooted and damaged again.\u003Cbr\u003E\u003Cbr\u003EMantra Bonus: Karma strengthens the link, healing herself and extending the root duration.","tooltip":"Links Karma to an enemy champion or monster, granting \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E and dealing {{ effect1amount*0.5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f4 }}) \u003C\/span\u003Emagic damage. If the link is unbroken for {{ e3 }} seconds, the target is rooted for {{ e2 }} second(s) and takes an additional {{ effect1amount*0.5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f4 }}) \u003C\/span\u003Emagic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMantra Bonus - Renewal:\u003C\/span\u003E Karma is healed for {{ f1 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ f3 }}%)\u003C\/span\u003E of her missing health. If the link is not broken or the target dies, the root duration is increased by {{ f2 }} second(s) and Karma is healed for {{ f1 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ f3 }}%)\u003C\/span\u003E of her missing health.","cost":[50,55,60,65,70],"costType":" Mana","cd":[12,12,12,12,12],"range":[675,675,675,675,675],"key":"KarmaW"},{"name":"Inspire","descr":"Karma summons a protective shield that absorbs incoming damage and increases the Movement Speed of the protected ally.\u003Cbr\u003E\u003Cbr\u003EMantra Bonus: Energy radiates out from her target, strengthening the initial shield and applying Inspire to nearby allied champions.","tooltip":"Target ally gains a shield, granting {{ e3 }}% Movement Speed for {{ e2 }} seconds and absorbing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMantra Bonus - Defiance:\u003C\/span\u003E The shield overflows with energy, absorbing an additional {{ f1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage. Nearby allied champions gain shields that absorb {{ f2 }}% as much as the initial target's shield. All champions shielded gain {{ f3 }}% movement speed for {{ e2 }} seconds.","cost":[60,65,70,75,80],"costType":" Mana","cd":[10,9.5,9,8.5,8],"range":[800,800,800,800,800],"key":"KarmaE"},{"name":"Mantra","descr":"Karma empowers her next ability to do an additional effect. Mantra is available at level 1 and does not require a skill point.","tooltip":"Karma empowers her next ability within 8 seconds for an additional effect. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ESoulflare: \u003C\/span\u003EDeals bonus damage and leaves behind a circle of flame, slowing enemies and dealing additional damage. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ERenewal: \u003C\/span\u003EKarma heals for a portion of her missing health. If the link is unbroken the root is longer and Karma is healed again.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EDefiance: \u003C\/span\u003EThe shield is stronger and allied champions around the target also gain a shield and movement speed.","cost":[0,0,0,0],"costType":"No Cost","cd":[45,42,39,36],"range":[1100,1100,1100,1100],"key":"KarmaR"}]}