{"id":154,"key":"Zac","name":"Zac","title":"the Secret Weapon","lore":"Zac is the product of a Zaun experiment to manufacture a hexchem-engineered supersoldier - the Zaun Amorphous Combatant. Combining brute strength with limitless flexibility, he is a versatile juggernaut: a creative fighter who bounces over obstacles and pounds his foes into submission. Though he was created inside a weapons laboratory, Zac was rescued and adopted by two loving parents who raised him to be a kind and friendly child. As the years passed, he grew up to be a fierce hero, sworn to protect the ordinary, everyday people of Zaun.\u003Cbr\u003E\u003Cbr\u003ELong ago, two Zaun scientists developed an organic substance that could withstand extreme conditions, spontaneously alter its biological structure, and generate tremendous amounts of kinetic force. As the scientists, husband and wife, watched the prototype grow from a spoon-sized droplet to a small blob, they noticed that their creation would respond to their presence. It sprung forward when they called and bounced when they sang. The couple began to see more than an experiment; they saw a small child, filled with affection and joy.\u003Cbr\u003E\u003Cbr\u003EAfter testing the prototype one evening, the scientists placed the blob back in its cage. It slouched and shuddered in the corner, inconsolably sad. At that moment, the couple realized that their beloved creation wished for a free life outside the lab. They were struck by their conscience and could not allow the prototype to be used as a weapon. The husband and wife fled with the young blob, replacing its weapon designation - Zaun Amorphous Combatant - with a proper name: Zac. In a quiet neighborhood far from the cities of Zaun, the scientists raised Zac as their own child.\u003Cbr\u003E\u003Cbr\u003EZac was always different from the other children. None had his powers of strength and flexibility, so the couple taught him to tell right from wrong and to use his gifts responsibly. Thanks to the care and affection of his loving parents, Zac lived a peaceful, happy childhood.\u003Cbr\u003E\u003Cbr\u003EThat childhood ended when the Zaun laboratory finally found Zac. Unable to replicate the formula used to create the amorphous prototype, the laboratory's staff never stopped searching for the scientists and their experiment. When they tracked down the family, they threatened to tear it apart. The staff abducted Zac's parents and demanded that the couple assist in his capture and return. Seized by the fear of losing his freedom and his parents, Zac unleashed every ounce of his raw energy and mass for the very first time. He subdued his parents' captors, sent the laboratory's workers fleeing, and brought his loved ones home. From then on, Zac vowed to defend all ordinary lives threatened by extraordinary treachery and wickedness. Originally built to destroy, he now protects the innocent and the helpless.\u003Cbr\u003E\u003Cbr\u003E''Even if you don't have a spine, you still have to stand up for yourself.''\u003Cbr\u003E -- Zac","skins":[{"id":154000,"name":"default","num":0},{"id":154001,"name":"Special Weapon Zac","num":1},{"id":154002,"name":"Pool Party Zac","num":2}],"allytips":["Picking up goo chunks is very important to staying alive.","When Cell Division is ready, try to die in a position that makes it difficult for the enemy team to kill your bloblets.","Charging Elastic Slingshot from the fog of war will give opponents less time to react."],"enemytips":["Zac heals from the goo that separates from him. You can crush the goo pieces by stepping on them.","Kill all of Zac's bloblets when he splits apart to stop him from reforming.","Silences, stuns, roots and knockups will all interrupt Zac when he is charging Elastic Slingshot."],"tags":["Tank","Fighter"],"info":{"attack":3,"defense":7,"magic":7,"difficulty":8},"stats":{"arm":23.88,"ad":59.67,"aso":-0.02,"crit":0,"hp":614.6,"mp":0,"mp5":0,"hp5":7.924,"range":175,"ms":340,"mr":32.1,"lvl":{"arm":3.5,"ad":3.375,"aso":1.6,"crit":0,"hp":95,"mp":0,"mp5":0,"hp5":0.55,"mr":1.25}},"pass":{"name":"Cell Division","descr":"Each time Zac hits an enemy with an ability, he sheds a chunk of himself that can be reabsorbed to restore Health. Upon taking fatal damage, Zac splits into 4 bloblets that attempt to recombine. If any bloblets remain, he will revive with an amount of Health depending on the Health of the surviving bloblets. Each bloblet has a percentage of Zac's maximum Health, Armor and Magic Resistance. This ability has a 5 minute cooldown.","img":"ZacPassive.png"},"spells":[{"name":"Stretching Strike","descr":"Zac extends his arms, slowing and dealing damage to nearby enemies.","tooltip":"Smacks enemies, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and slowing them by {{ e4 }}% for {{ e5 }} seconds.","cost":[0,0,0,0,0],"costType":"% of current Health","cd":[9,8.5,8,7.5,7],"range":[550,550,550,550,550],"key":"ZacQ"},{"name":"Unstable Matter","descr":"Zac's body erupts, damaging nearby enemies.","tooltip":"Zac's body erupts, dealing {{ e1 }} Magic Damage +{{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E% of the enemy's maximum Health as Magic Damage to all nearby enemies (Max: {{ e5 }} damage against minions and monsters).\u003Cbr\u003E\u003Cbr\u003EWhen Zac reabsorbes a piece of himself, Unstable Matter's cooldown is reduced by {{ e4 }} second.","cost":[0,0,0,0,0],"costType":"% of current Health","cd":[5,5,5,5,5],"range":[350,350,350,350,350],"key":"ZacW"},{"name":"Elastic Slingshot","descr":"Zac attaches his arms to the ground and stretches back, launching himself forward.","tooltip":"\u003Cspan class=\"colorFFFFFF\"\u003ECharges up and launches towards a target area, knocking up enemies.\u003C\/span\u003E\u003Cbr\u003EZac faces the cursor and charges up over {{ e4 }} seconds. Reactivating the ability launches him towards his target, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage to all enemies hit and knocking them back for {{ e5 }} second.\u003Cbr\u003E\u003Cbr\u003EIn addition, Zac will spawn extra chunks if he hits multiple enemy champions.\u003Cbr\u003E\u003Cbr\u003ECan be cancelled by moving, refunding half of the ability's cooldown and cost.","cost":[0,0,0,0,0],"costType":"% of current Health","cd":[24,21,18,15,12],"range":[300,300,300,300,300],"key":"ZacE"},{"name":"Let's Bounce!","descr":"Zac launches into the air, gaining Movement Speed, and slams down three times, each time damaging, slowing and knocking up nearby enemies.","tooltip":"\u003Cspan class=\"colorFFFFFF\"\u003EZac bounces 4 times, knocking up and slowing enemies.\u003C\/span\u003E\u003Cbr\u003EEach bounce deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage to nearby enemies, knocks them up for {{ e7 }} second, and slows them by {{ e5 }}% for {{ e0 }} second. Enemies hit more than once take {{ e2 }}% damage and are not knocked up. Upon activation, Zac removes all slows affecting him and gains an accelerating Movement Speed buff ({{ e3 }}-{{ e4 }}%) for the duration.\u003Cbr\u003E\u003Cbr\u003EZac can right-click to move and can activate Unstable Matter while in the air.","cost":[0,0,0],"costType":"No Cost","cd":[130,115,100],"range":[300,300,300],"key":"ZacR"}]}