{"id":131,"key":"Diana","name":"Diana","title":"Scorn of the Moon","lore":"''I am the light coursing in the soul of the moon.''\u003Cbr\u003E\u003Cbr\u003EBearing her crescent moonblade, Diana fights as a warrior of the Lunari, a faith all but quashed in the lands around Mount Targon. Clad in shimmering armor the color of winter snow at night, she is a living embodiment of the silver moon's power. Imbued with the essence of an Aspect from beyond Targon's towering summit, Diana is no longer wholly human, and struggles to divine her power and purpose in this world.","skins":[{"id":131000,"name":"default","num":0},{"id":131001,"name":"Dark Valkyrie Diana","num":1},{"id":131002,"name":"Lunar Goddess Diana","num":2},{"id":131003,"name":"Infernal Diana","num":3},{"id":131011,"name":"Blood Moon Diana","num":11}],"allytips":["Landing Crescent Strike is critically important, but don't be afraid to miss. The cooldown is short and the mana cost is low.","Consider when to cast Lunar Rush without Moonlight and when to wait for another Crescent Strike.","Use Moonfall and Lunar Rush to stay on targets and activate Moonsilver Blade for extra damage."],"enemytips":["Dodge Crescent Strike, or move to safety if you are affected by Moonlight.","Pale Cascade orbs only last a few seconds. Avoid Diana and engage her after the shield dissipates.","Diana can play very aggressively if she uses Lunar Rush without Moonlight, but you can punish her by slowing or stunning her when she has no way to get back into position."],"tags":["Fighter","Mage"],"info":{"attack":7,"defense":6,"magic":8,"difficulty":4},"stats":{"arm":26.048,"ad":53.04,"aso":0,"crit":0,"hp":589.2,"mp":297.2,"mp5":6,"hp5":7.428,"range":150,"ms":345,"mr":32.1,"lvl":{"arm":3.6,"ad":3,"aso":2.25,"crit":0,"hp":90,"mp":40,"mp5":0.8,"hp5":0.85,"mr":1.25}},"pass":{"name":"Moonsilver Blade","descr":"Gains Attack Speed. Every third strike cleaves nearby enemies for additional magic damage.","img":"Diana_Passive_LunarBlade.png"},"spells":[{"name":"Crescent Strike","descr":"Diana swings her blade to unleash a bolt of lunar energy that deals damage in an arc before exploding. Afflicts enemies struck with the Moonlight debuff, revealing them if they are not stealthed. ","tooltip":"Unleashes a bolt of lunar energy in an arc dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003EAfflicts enemies struck with Moonlight, revealing them if they are not stealthed for {{ e4 }} seconds.","cost":[55,55,55,55,55],"costType":" Mana","cd":[10,9,8,7,6],"range":[900,900,900,900,900],"key":"DianaQ"},{"name":"Pale Cascade","descr":"Diana creates three orbiting spheres that detonate on contact with enemies to deal damage in an area. She also gains a temporary shield that absorbs damage. If her third sphere detonates, the shield gains additional strength.","tooltip":"Creates three orbiting spheres that explode on contact with enemies dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. Lasts {{ e1 }} seconds.\u003Cbr\u003E\u003Cbr\u003EGrants a temporary shield that absorbs {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage. If the third sphere detonates, the shield increases by {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E.","cost":[60,70,80,90,100],"costType":" Mana","cd":[10,10,10,10,10],"range":[800,800,800,800,800],"key":"DianaW"},{"name":"Moonfall","descr":"Diana draws in and slows all nearby enemies.","tooltip":"Reveals and draws in all nearby enemies and then slows them by {{ e1 }}% for {{ e2 }} seconds.","cost":[70,70,70,70,70],"costType":" Mana","cd":[26,24,22,20,18],"range":[450,450,450,450,450],"key":"DianaE"},{"name":"Lunar Rush","descr":"Diana dashes to an enemy and deals magic damage. Lunar Rush has no cooldown when used to teleport to a target afflicted with Moonlight.","tooltip":"Becomes the living embodiment of the vengeful moon, dashing to an enemy and dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003ELunar Rush has no cooldown when used to dash to an enemy afflicted with Moonlight. All other enemies will have the Moonlight debuff removed regardless of whether they were the target of Lunar Rush.","cost":[50,65,80],"costType":" Mana","cd":[25,20,15],"range":[825,825,825],"key":"DianaR"}]}