{"id":267,"key":"Nami","name":"Nami","title":"the Tidecaller","lore":"Nami channels the primal energies of the ocean, harnessing its mystical restorative properties and commanding the raw power of the tides themselves. Though many doubted her, Nami had the bravery and determination to take on a dangerous quest when no one else would. Now her people believe she is the Tidecaller, a chosen one destined to complete a quest essential to the survival of her entire race.\u003Cbr\u003E\u003Cbr\u003EThe Tidecaller's sacred duty is to acquire a moonstone, a powerful object found only in the towering reaches of the surface world. Her people, the Marai, rely on the moonstone's light to ward off the terrors of the depths. However, the stone's power lasts only one hundred years. Before its light fades, the Tidecaller must journey into the Great Deep, retrieve an abyssal pearl, and carry it to the surface. There, on the night of the winter solstice of the hundredth year, the Tidecaller makes a ceremonial exchange with a landwalker bearing a moonstone. By trading the pearl for the moonstone, the Tidecaller ensures the survival of the Marai for another century.\u003Cbr\u003E\u003Cbr\u003EHowever, in Nami's time, as the hundred years drew to a close, no Tidecaller had been found. Without a chosen one to complete the quest, her people would face disaster, but the Marai waited in faith that the Tidecaller would appear. Nami refused to sit idle, insisting that without a Tidecaller to save them, someone had to act. Bravely, she decided to begin the quest herself and ventured alone into the dangerous depths. None expected her to survive, but after six days of battles with untold horrors, Nami returned with the pearl in hand. The Marai hailed her as the new Tidecaller. All that remained was for Nami to journey to the surface and complete the exchange.\u003Cbr\u003E\u003Cbr\u003EWhen Nami arrived at the surface, however, she found only an empty shore. She waited for days in a mystic cove, unsure of what to do. In all the legends of the Tidecallers, the bearer of the moonstone had never failed to arrive. Nami faced a choice. She knew the surface world only through tale and rumor, but the survival of the Marai depended upon her. Summoning the tide to bear her ashore, Nami began her search for the moonstone and became the first of her kind to explore the world above the ocean. She left her home behind, and vowed not to return until she had completed the Tidecaller's quest.\u003Cbr\u003E\u003Cbr\u003E''I am the tide, and I cannot be turned.''\u003Cbr\u003E-- Nami","skins":[{"id":267000,"name":"default","num":0},{"id":267001,"name":"Koi Nami","num":1},{"id":267002,"name":"River Spirit Nami","num":2},{"id":267003,"name":"Urf the Nami-tee","num":3},{"id":267007,"name":"Deep Sea Nami","num":7}],"allytips":["Aqua Prison has a long cooldown, make sure to use it at the right moment.","Using Ebb and Flow during an engagement with enemy champions will help sway the battle in your favor.","Nami's ultimate can come in very handy for initiating on enemies who are far away."],"enemytips":["Aqua Prison is a very powerful ability with a long cooldown, take advantage of the situation if Nami misses this ability.","Tidal Wave has a very long range but travels slowly, be aware of when it is coming your way as you can move out of its path.","Try to avoid fighting an opponent affected by Tidecaller's Blessing, it lasts a short duration so waiting it out can help you greatly."],"tags":["Support","Mage"],"info":{"attack":4,"defense":3,"magic":7,"difficulty":5},"stats":{"arm":19.72,"ad":51.208,"aso":-0.03,"crit":0,"hp":489.32,"mp":377.24,"mp5":11.5,"hp5":5.424,"range":550,"ms":335,"mr":30,"lvl":{"arm":4,"ad":3.1,"aso":2.61,"crit":0,"hp":74,"mp":43,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Surging Tides","descr":"When Nami's abilities hit allied champions they gain Movement Speed for a short duration.","img":"NamiPassive.png"},"spells":[{"name":"Aqua Prison","descr":"Sends a bubble to a target area, dealing damage and stunning all enemies on impact.","tooltip":"Sends a bubble to target area, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies, and stunning them for {{ e2 }} seconds.","cost":[60,60,60,60,60],"costType":" Mana","cd":[14,13,12,11,10],"range":[875,875,875,875,875],"key":"NamiQ"},{"name":"Ebb and Flow","descr":"Unleashes a stream of water that bounces back and forth between allied and enemy champions, healing allies and damaging enemies.","tooltip":"Unleashes a stream of water that bounces back and forth between allied and enemy champions.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorCCFF99\"\u003EOn Ally Hit: \u003C\/span\u003EHeals {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Health and will bounce to a nearby enemy champion.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9999\"\u003EOn Enemy Hit: \u003C\/span\u003EDeals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and bounces to a nearby allied champion.\u003Cbr\u003E\u003Cbr\u003EBounces to each target only once, and hits up to {{ e2 }} targets. The damage and healing value is modified by \u003Cspan class=\"color99FF99\"\u003E({{ f1 }}%)\u003C\/span\u003E each bounce. ","cost":[70,85,100,115,130],"costType":" Mana","cd":[10,10,10,10,10],"range":[725,725,725,725,725],"key":"NamiW"},{"name":"Tidecaller's Blessing","descr":"Empowers an allied champion for a short duration. The ally's basic attacks deal bonus magic damage and slow the target.","tooltip":"Empowers an allied champion's next {{ e4 }} basic attacks, causing them to slow the target by {{ e2 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }}%)\u003C\/span\u003E for {{ e3 }} second and deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage. Lasts for {{ e5 }} seconds.","cost":[55,60,65,70,75],"costType":" Mana","cd":[11,11,11,11,11],"range":[800,800,800,800,800],"key":"NamiE"},{"name":"Tidal Wave","descr":"Summons a massive Tidal Wave that knocks up, slows, and damages enemies. Allies hit gain double the effect of Surging Tides.","tooltip":"Summons a Tidal Wave from Nami's position. The wave knocks up enemies and slows them by {{ e4 }}%, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. The duration of the slow increases based on how far the Tidal Wave has traveled, with a minimum duration of 2 seconds and a maximum of {{ e5 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAllies hit by the wave gain double the effect of Surging Tides.","cost":[100,100,100],"costType":" Mana","cd":[120,110,100],"range":[2550,2550,2550],"key":"NamiR"}]}