{"id":61,"key":"Orianna","name":"Orianna","title":"the Lady of Clockwork","lore":"There once was a Piltovian man named Corin Reveck who had a daughter named Orianna, whom he loved more than anything else in the world. Though Orianna had incredible talent for dancing, she was deeply fascinated by the champions of the League of Legends. This fascination compelled her to begin training to become such a champion. It is unfortunate that her sheltered, wide-eyed naivete led her to take unnecessary and dangerous chances which ultimately led to her tragic demise. Orianna's death shattered Corin, driving him into deep depression and an obsession with techmaturgy. He could not stand the void his daughter's death left in his life, so he decided to build a replacement - one that would complete Orianna's dream of joining the League. What was created is the clockwork killing machine that Corin named after his daughter. Knowing that she was destined to be a champion and seeing the way the times were changing, he created The Ball as her pet and protector. This nearly symbiotic creation uses a different type of techmaturgy, relying more heavily on electricity than clockwork.\u003Cbr\u003E\u003Cbr\u003EOrianna and The Ball now fight as Champions in the League of Legends, using her sometimes misguided morality as a compass. She tries in earnest to fit in with those around her. However, no matter how hard she tries, Orianna can never be human and there is always something unnerving and alien about her. Though she attempts social interaction with other champions in the League of Legends, there are few who can get past her exotic nature. To many, it's as if there's nothing inside, that Orianna is just a soulless clockwork shell - a dangerous and deadly one at that. However, all along she remains the perfect daughter in her father's eyes.\u003Cbr\u003E\u003Cbr\u003E''Dance with me, my pet. Dance with me into oblivion.''","skins":[{"id":61000,"name":"default","num":0},{"id":61001,"name":"Gothic Orianna","num":1},{"id":61002,"name":"Sewn Chaos Orianna","num":2},{"id":61003,"name":"Bladecraft Orianna","num":3},{"id":61004,"name":"TPA Orianna","num":4},{"id":61005,"name":"Winter Wonder Orianna","num":5},{"id":61006,"name":"Heartseeker Orianna","num":6}],"allytips":["Command: Protect can be used on yourself to return the Ball back to you quickly. Combine this with Command: Attack for a quick harassment.","Command: Dissonance is a very powerful escape tool if Orianna has the Ball. The combination of speed and leaving a slowing obstacle can be quite powerful.","Command: Shockwave can be used to drag enemies towards you or away from you if you position the Ball properly."],"enemytips":["Orianna can only affect the area the Ball is around. Use this to your advantage.","Watch out for Orianna's Ball returning to her due to leashing. This may cause some unexpected situations."],"tags":["Mage","Support"],"info":{"attack":4,"defense":3,"magic":9,"difficulty":7},"stats":{"arm":17.04,"ad":40.368,"aso":-0.05,"crit":0,"hp":517.72,"mp":334,"mp5":6,"hp5":6.874,"range":525,"ms":325,"mr":30,"lvl":{"arm":3,"ad":2.6,"aso":3.5,"crit":0,"hp":79,"mp":50,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Clockwork Windup","descr":"Orianna's autoattack deals additional magic damage. This damage increases the more Orianna attacks the same target.","img":"OriannaPassive.png"},"spells":[{"name":"Command: Attack","descr":"Orianna commands her Ball to fire toward a target location, dealing magic damage to targets along the way (deals less damage to subsequent targets). Her Ball remains at the target location after.","tooltip":"Orianna commands her Ball to shoot toward a target location, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to targets along the way. However, it deals {{ e2 }}% less damage for each unit it hits (Minimum {{ e3 }}%).\u003Cbr\u003E\u003Cbr\u003EHer Ball remains behind at the target location afterwards.","cost":[30,35,40,45,50],"costType":" Mana","cd":[6,5.25,4.5,3.75,3],"range":[815,815,815,815,815],"key":"OriannaQ"},{"name":"Command: Dissonance","descr":"Orianna commands the Ball to release a pulse of energy, dealing magic damage around it. This leaves a field behind that speeds up allies and slows enemies.","tooltip":"Orianna commands her Ball to release an electric pulse, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies.\u003Cbr\u003E\u003Cbr\u003EThe pulse leaves behind an energy field for {{ e4 }} seconds, lowering enemy Movement Speed by {{ e2 }}% and increasing ally Movement Speed by {{ e3 }}% for {{ e5 }} seconds. This effect diminishes over time.","cost":[70,80,90,100,110],"costType":" Mana","cd":[9,9,9,9,9],"range":[255,255,255,255,255],"key":"OriannaW"},{"name":"Command: Protect","descr":"Orianna commands her Ball to attach to an allied champion, shielding them and dealing magic damage to any enemies it passes through on the way. Additionally, the Ball grants additional Armor and Magic Resist to the champion it is attached to.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EThe Ball adds {{ e2 }} Armor and Magic Resist to the allied champion it is attached to.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EOrianna commands her Ball to travel to and attach onto an allied champion, shielding them for {{ e5 }} seconds from the next {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage. Enemies the Ball passes through along the way are damaged for {{ e4 }}% of the shield value: {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E.\u003C\/span\u003E","cost":[60,60,60,60,60],"costType":" Mana","cd":[9,9,9,9,9],"range":[1095,1095,1095,1095,1095],"key":"OriannaE"},{"name":"Command: Shockwave","descr":"Orianna commands her Ball to unleash a shockwave, dealing magic damage and launching nearby enemies towards the Ball after a short delay.","tooltip":"Orianna commands her Ball to unleash a shockwave after a brief delay, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and flinging them into the air a set distance in the direction of the Ball.","cost":[100,100,100],"costType":" Mana","cd":[110,95,80],"range":[410,410,410],"key":"OriannaR"}]}