{"id":122,"key":"Darius","name":"Darius","title":"the Hand of Noxus","lore":"There is no greater symbol of Noxian might than Darius, the nation's most feared and battle-hardened warrior. Orphaned at a young age, Darius had to fight to keep himself and his younger brother alive. By the time he joined the military, he had already developed the strength and discipline of a veteran soldier. The first true test of Darius's resolve occurred in a crucial battle against Demacia, where the Noxian forces were exhausted and outnumbered. Darius's captain called for his troops to retreat, but Darius refused to accept such an act of cowardice. Breaking formation, Darius strode towards the captain and decapitated him with one sweep of his gigantic axe. Both terrified and inspired, the soldiers followed Darius into battle and fought with incredible strength and fervor. After a long and grueling battle, they ultimately emerged victorious.\u003Cbr\u003E\u003Cbr\u003ESeizing momentum from this victory, Darius led his now fiercely loyal troops in a devastating campaign against Demacia. After proving his power on the battlefield, Darius turned his gaze homeward. He saw a Noxus riddled with weakness, where greedy, complacent nobles drained the nation's strength. Seeking to restore his country to greatness, Darius took it upon himself to reshape the Noxian leadership. He identified weak figureheads and violently removed them from their positions of power. Many in Noxus saw Darius's cull as an attempt to seize power, but he had a different plan for the throne. He had been watching the rise of Jericho Swain with keen interest. In Swain, Darius saw a leader with the mind and determination to bring Noxus to glory. Now allied with the Master Tactician, Darius works to unite the nation behind his vision of true Noxian strength.\u003Cbr\u003E\u003Cbr\u003E''A united Noxus could control the world - and would deserve to.''\u003Cbr\u003E-- Darius","skins":[{"id":122000,"name":"default","num":0},{"id":122001,"name":"Lord Darius","num":1},{"id":122002,"name":"Bioforge Darius","num":2},{"id":122003,"name":"Woad King Darius","num":3},{"id":122004,"name":"Dunkmaster Darius","num":4},{"id":122008,"name":"Academy Darius","num":8}],"allytips":["Decimate is a powerful harassment ability. Strike an enemy from maximum range for the greatest effect.","Noxian Guillotine does more damage the more attacks you can land prior to it. Use Noxian Might to deal maximum damage.","Darius benefits greatly from enhanced survivability. The longer you can prolong a fight, the more powerful he becomes."],"enemytips":["When Darius's axe grab is on cooldown, he is vulnerable to harassment attacks.","Darius's ability to escape from fights is limited. If you have an advantage against him, press your lead."],"tags":["Fighter","Tank"],"info":{"attack":9,"defense":5,"magic":1,"difficulty":2},"stats":{"arm":30,"ad":56,"aso":0,"crit":0,"hp":582.24,"mp":263,"mp5":6.588,"hp5":9.846,"range":175,"ms":340,"mr":32.1,"lvl":{"arm":4,"ad":5,"aso":1,"crit":0,"hp":100,"mp":37.5,"mp5":0.35,"hp5":0.95,"mr":1.25}},"pass":{"name":"Hemorrhage","descr":"Darius aims his attacks strategically, causing his target to bleed. This effect stacks up to five times. Enemies that reach max Hemorrhage cause Darius to gain Noxian Might, greatly increasing his damage.","img":"Darius_PassiveBuff.png"},"spells":[{"name":"Decimate","descr":"Darius winds up and swings his axe in a wide circle. Enemies struck by the blade take more damage than those struck by the handle. Darius heals based on enemy champions hit by the blade.","tooltip":"After a short delay, Darius swings his axe around himself, striking enemies in its path. Enemies hit by the axe's blade take {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage. Enemies hit by the handle take {{ e6 }}% damage (does not apply Hemorrhage).\u003Cbr\u003E\u003Cbr\u003EDarius heals for \u003Cspan class=\"colorFF0000\"\u003E{{ e5 }}% of his missing Health\u003C\/span\u003E per enemy champion hit by the blade (max: {{ e7 }}%).","cost":[30,35,40,45,50],"costType":" Mana","cd":[9,8,7,6,5],"range":[1,1,1,1,1],"key":"DariusQ"},{"name":"Crippling Strike","descr":"Darius's next attack strikes an enemy's crucial artery. As they bleed out, their Movement Speed is slowed.","tooltip":" Darius's next basic attack deals \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E physical damage and slows the target by {{ e2 }}% for {{ e5 }} second.\u003Cbr\u003E\u003Cbr\u003ECrippling Strike refunds its Mana cost and {{ e3 }}% of its cooldown if it kills the target.","cost":[30,30,30,30,30],"costType":" Mana","cd":[9,8,7,6,5],"range":[300,300,300,300,300],"key":"DariusW"},{"name":"Apprehend","descr":"Darius hones his axe, passively causing his physical damage to ignore a percentage of his target's Armor. When activated, Darius sweeps up his enemies with his axe's hook and pulls them to him.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EDarius gains {{ e1 }}% Armor Penetration.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EPulls in all enemies in front of Darius and slows them by {{ e2 }}% for {{ e3 }} second.","cost":[45,45,45,45,45],"costType":" Mana","cd":[24,21,18,15,12],"range":[535,535,535,535,535],"key":"DariusE"},{"name":"Noxian Guillotine","descr":"Darius leaps to an enemy champion and strikes a lethal blow, dealing true damage. This damage is increased for each stack of Hemorrhage on the target. If Noxian Guillotine is a killing blow, its cooldown is refreshed for a brief duration.","tooltip":"Leaps to target enemy champion and strikes a lethal blow, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E true damage. For each stack of Hemorrhage on the target, Noxian Guillotine deals an additional {{ e3 }}% damage.\u003Cspan class=\"size8 colorFF9900\"\u003E8","cost":[100,100,0],"costType":" Mana","cd":[120,100,80],"range":[460,460,460],"key":"DariusR"}]}