{"id":86,"key":"Garen","name":"Garen","title":"The Might of Demacia","lore":"Throughout Valoran, the resolve of Demacia's military is alternately celebrated or despised, but always respected. Their ''zero tolerance'' moral code is strictly upheld by civilians and soldiers alike. In combat, this means Demacian troops may not make excuses, flee, or surrender under any circumstance. These principles are espoused to their forces by unrivaled demagogues who lead by example. Garen, the valiant warrior who bears the title ''the Might of Demacia'', is the paradigm to which these leaders are compared. Thousands of great heroes have risen and fallen on the bloody battlefields between Demacia and its preeminent rival, Noxus. It was beneath their mighty banners of war that Garen first met steel with Katarina, the Sinister Blade. The infantrymen who beheld this event (and survived) commented that it seemed as though the two were locked in a mortal waltz against a symphony of clashing blades.\u003Cbr\u003E\u003Cbr\u003EGaren, the pride of the Demacian military and leader of the Dauntless Vanguard, returned from this battle breathless for the first time in his career, though some speculate that this was due to reasons other than exhaustion. The plausibility of these rumors was bolstered when, in every instance thereafter, Garen seized the opportunity to encounter the Sinister Blade again. A paragon of Demacian ethic, Garen never entertained such allegations, for he knew others couldn't understand. Even simply the pursuit of a worthy opponent on the battlefield is, to a true warrior, the reason to rise each morning. The promise of one, particularly so beautifully and diametrically opposed, is the validation of his existence. \u003Cbr\u003E\u003Cbr\u003E''The most effective way to kill an opponent is to slice through the man next to him.''\u003Cbr\u003E-- Garen, on front line strategy","skins":[{"id":86000,"name":"default","num":0},{"id":86001,"name":"Sanguine Garen","num":1},{"id":86002,"name":"Desert Trooper Garen","num":2},{"id":86003,"name":"Commando Garen","num":3},{"id":86004,"name":"Dreadknight Garen","num":4},{"id":86005,"name":"Rugged Garen","num":5},{"id":86006,"name":"Steel Legion Garen","num":6},{"id":86010,"name":"Rogue Admiral Garen","num":10},{"id":86011,"name":"Warring Kingdoms Garen","num":11}],"allytips":["Garen's regeneration greatly increases if he can avoid receiving damage for several seconds.","Judgment deals maximum damage when only hitting a single target. For effective trading, try to position such that only the enemy champion is hit.","Garen is only constrained by cooldowns, making items such as Black Cleaver very effective for him."],"enemytips":["Stack armor items to lower the large amount of physical damage that Garen deals out.","Try to run away from Garen as your health gets lower, as he can execute you quickly with Demacian Justice.","Be careful about attacking Garen in brush. It often will lead to taking full damage from Judgment.","Judgment deals maximum damage when only hitting a single target. If getting out of its radius isn't possible, move through allied minions to reduce damage taken."],"tags":["Fighter","Tank"],"info":{"attack":7,"defense":7,"magic":1,"difficulty":5},"stats":{"arm":27.536,"ad":57.88,"aso":0,"crit":0,"hp":616.28,"mp":0,"mp5":0,"hp5":7.84,"range":175,"ms":340,"mr":32.1,"lvl":{"arm":3,"ad":4.5,"aso":2.9,"crit":0,"hp":84.25,"mp":0,"mp5":0,"hp5":0.5,"mr":1.25}},"pass":{"name":"Perseverance","descr":"If Garen has not recently been struck by damage or enemy abilities, he regenerates a percentage of his maximum health each second. Minion damage does not stop Perseverance.","img":"Garen_Passive.png"},"spells":[{"name":"Decisive Strike","descr":"Garen gains a burst of movement speed, breaking free of all slows affecting him. His next attack strikes a vital area of his foe, dealing bonus damage and silencing them.","tooltip":"Garen breaks free from all slows affecting him, and gains {{ e2 }}% movement speed for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EHis next basic attack within {{ e5 }} seconds deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and silences his target for {{ e3 }} seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[8,8,8,8,8],"range":[300,300,300,300,300],"key":"GarenQ"},{"name":"Courage","descr":"Garen passively increases his armor and magic resist by killing enemies. He may also activate this ability to grant himself a shield that reduces incoming damage for a short time.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Killing units permanently grants {{ f2 }} armor and magic resist, up to a maximum of {{ e3 }}. Current Bonus: \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EGaren gains a defensive shield for {{ e4 }} seconds, reducing incoming damage by {{ e2 }}%.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[24,23,22,21,20],"range":[20,20,20,20,20],"key":"GarenW"},{"name":"Judgment","descr":"Garen performs a dance of death with his sword, dealing damage around him for the duration and shredding the armor of enemy champions hit.","tooltip":"Garen rapidly spins his sword around his body for {{ e2 }} seconds, dealing {{ f3 }} physical damage to nearby enemies -- {{ e1 }} plus {{ e3 }}% of his attack damage \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E, \u003Cspan class=\"colorFFFFFF\"\u003E{{ f2 }}\u003C\/span\u003E times (increased by 1 every 3 champion levels) -- over the duration.\u003Cbr\u003E\u003Cbr\u003EEnemy champions hit by {{ e6 }} spins lose {{ e5 }}% of their armor for {{ e7 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EJudgment deals {{ e4 }}% increased damage when striking only one enemy.\u003Cbr\u003ECancelling Judgment returns cooldown equal to the remaining duration.\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EJudgment can critically strike for bonus damage.\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":"No Cost","cd":[9,9,9,9,9],"range":[325,325,325,325,325],"key":"GarenE"},{"name":"Demacian Justice","descr":"The enemy champion with the most recent kills is the Villain. Garen's attacks deal additional true damage to that champion.\u003Cbr\u003E\u003Cbr\u003EGaren can call upon the might of Demacia to deal a finishing blow to an enemy champion that deals damage based upon how much health his target has missing. This damage is true damage against the Villain.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E The enemy champion with the most recent kills is the \u003Cspan class=\"colorFFF673\"\u003EVillain\u003C\/span\u003E. Judgment and basic attacks against it deal an additional {{ e3 }}% of its maximum health as true damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Garen calls upon the might of Demacia to attempt to execute an enemy champion, dealing magic damage equal to {{ e1 }} plus {{ e2 }}% of the target's missing health. Deals true damage to the \u003Cspan class=\"colorFFF673\"\u003EVillain\u003C\/span\u003E.","cost":[0,0,0],"costType":"No Cost","cd":[120,100,80],"range":[400,400,400],"key":"GarenR"}]}