{"id":63,"key":"Brand","name":"Brand","title":"the Burning Vengeance","lore":"In a faraway place known as Lokfar there was a seafaring marauder called Kegan Rodhe. As was his people's way, Kegan sailed far and wide with his fellows, stealing treasures from those unlucky enough to catch their attention. To some, he was a monster; to others, just a man. One night, as they sailed through the arctic waters, strange lights danced over the frozen wastes. There was something hypnotic about them; it was something that drew them to it like moths to a flame. Trekking across the frozen waste, they came to a cave covered in ancient runes. The meaning of the runes long lost to them, Kegan led the way inside. There, inside a perfect cage of ice floated a dancing column of flame. There was no way such a thing should be burning, especially not in this place. However, its movement was as hypnotic as a siren's song, captivating and seductive. While the others stayed back, Kegan could not help but approach it while holding out his hand...\u003Cbr\u003E\u003Cbr\u003EThat is the last thing Kegan Rodhe remembers, for now his body belongs to Brand. It is a creature of olden times, perhaps even a casualty of the Rune Wars. It is known in ancient texts as the Burning Vengeance. It is a creature of pure fiery hate that exists for no other reason than to lay waste the world of men and yordles. No one is quite sure how Brand found his way to Valoran, but he began his predations at once. Overcome by Demacian forces, he was given a choice: fight within the confines of the League or die. Naturally, he chose to use his destructive powers in the League, for now...\u003Cbr\u003E\u003Cbr\u003E''This place will burn, not by cinder flying or breath of wind, but by the vengeance of my hand.''\u003Cbr\u003E-- Brand","skins":[{"id":63000,"name":"default","num":0},{"id":63001,"name":"Apocalyptic Brand","num":1},{"id":63002,"name":"Vandal Brand","num":2},{"id":63003,"name":"Cryocore Brand","num":3},{"id":63004,"name":"Zombie Brand","num":4},{"id":63005,"name":"Spirit Fire Brand","num":5}],"allytips":["You can deter enemies from standing near their minions by setting them ablaze, due to Conflagration.","You can use Brand's abilities in a variety of combinations to maximize his damage in different situations.","Pyroclasm bounces randomly between enemies, so try to cast it on a small group of enemies if you want to hit the same target multiple times."],"enemytips":["Brand must land an ability before his combo is able to get started. Dodging his Sear or Pillar of Flame will disrupt his rhythm.","Try to move away from allies when you see Pyroclasm being cast. The initial missile speed is slow, which should give your team time to react.","Brand's passive allows him to excel against teams that cluster together. Be sure to split up against him."],"tags":["Mage"],"info":{"attack":2,"defense":2,"magic":9,"difficulty":4},"stats":{"arm":21.88,"ad":57.04,"aso":0,"crit":0,"hp":507.68,"mp":375.6,"mp5":8.008,"hp5":5.424,"range":550,"ms":340,"mr":30,"lvl":{"arm":3.5,"ad":3,"aso":1.36,"crit":0,"hp":76,"mp":42,"mp5":0.6,"hp5":0.55,"mr":0}},"pass":{"name":"Blaze","descr":"Brand's spells light his targets ablaze, dealing 2% of their maximum Health in magic damage over 4 seconds, stacking up to 3 times. When Blaze reaches max stacks on a Champion or monster, it becomes unstable. It detonates in 2 seconds for massive damage in an area around the victim.","img":"BrandP.png"},"spells":[{"name":"Sear","descr":"Brand launches a ball of fire forward that deals magic damage. If the target is ablaze, Sear will stun the target for 1.5 seconds.","tooltip":"Brand launches a ball of fire forward that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EBlaze:\u003C\/span\u003E If the target is ablaze, Sear will stun the target for 1.5 seconds.","cost":[50,50,50,50,50],"costType":" Mana","cd":[8,7.5,7,6.5,6],"range":[1050,1050,1050,1050,1050],"key":"BrandQ"},{"name":"Pillar of Flame","descr":"After a short delay, Brand creates a Pillar of Flame at a target area, dealing magic damage to enemy units within the area. Units that are ablaze take an additional 25% damage.","tooltip":"After a short delay, Brand creates a Pillar of Flame at a target area, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemy units within the area.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EBlaze:\u003C\/span\u003E Units that are ablaze take an additional 25% damage from Pillar of Flame.","cost":[60,70,80,90,100],"costType":" Mana","cd":[10,9.5,9,8.5,8],"range":[900,900,900,900,900],"key":"BrandW"},{"name":"Conflagration","descr":"Brand conjures a powerful blast at his target, dealing magic damage to them. If the target is ablaze, Conflagration spreads to nearby enemies.","tooltip":"Brand conjures a powerful blast at his target, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EBlaze:\u003C\/span\u003E If the target is ablaze, Conflagration spreads to nearby enemies. ","cost":[70,75,80,85,90],"costType":" Mana","cd":[10,9,8,7,6],"range":[625,625,625,625,625],"key":"BrandE"},{"name":"Pyroclasm","descr":"Brand unleashes a devastating torrent of fire, dealing magic damage each time it bounces, up to 5 bounces. Bounces prioritize stacking Blaze to max on Champions. If a target is ablaze, Pyroclasm will briefly slow them.","tooltip":"Brand unleashes a devastating torrent of fire, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage each time it bounces up to 5 bounces. Bounces prioritize stacking Blaze to max on Champions.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EBlaze:\u003C\/span\u003E If the target is ablaze, Pyroclasm will briefly slow the target by {{ e4 }}%.","cost":[100,100,100],"costType":" Mana","cd":[105,90,75],"range":[750,750,750],"key":"BrandR"}]}