{"id":114,"key":"Fiora","name":"Fiora","title":"the Grand Duelist","lore":"''I have come to kill you for the sake of honor. And though you possess none, still you die.''\u003Cbr\u003EThe most feared duelist in all Valoran, Fiora is as renowned for her brusque manner and cunning mind as she is for the speed of her bluesteel rapier. Born to House Laurent in the kingdom of Demacia, Fiora took control of the family from her father in the wake of a scandal that nearly destroyed them. House Laurent's reputation was sundered, but Fiora bends her every effort to restore her family's honor and return them to their rightful place among the great and good of Demacia.","skins":[{"id":114000,"name":"default","num":0},{"id":114001,"name":"Royal Guard Fiora","num":1},{"id":114002,"name":"Nightraven Fiora","num":2},{"id":114003,"name":"Headmistress Fiora","num":3},{"id":114004,"name":"PROJECT: Fiora","num":4},{"id":114005,"name":"Pool Party Fiora","num":5}],"allytips":["Thanks to Duelist's Dance, Fiora excels at quick trades. Use the movement speed boost from striking a Vital to escape unscathed or set up for the next one.","Grand Challenge allows Fiora to take down even the most durable opponents and then recover if successful, so do not hesitate to attack the enemy's front line."],"enemytips":["Duelist's Dance shows you where Fiora will try to attack from, so be ready to punish her when she tries.","Be careful when casting immobilizing disables on Fiora. If her Riposte is available, she can turn their power against you."],"tags":["Fighter","Assassin"],"info":{"attack":10,"defense":4,"magic":2,"difficulty":3},"stats":{"arm":24,"ad":60,"aso":0,"crit":0,"hp":550,"mp":300,"mp5":8,"hp5":8.25,"range":150,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.3,"aso":3.2,"crit":0,"hp":85,"mp":40,"mp5":0.7,"hp5":0.55,"mr":1.25}},"pass":{"name":"Duelist's Dance","descr":"Fiora challenges nearby enemy Champions to dodge her. She calls out a direction from which she will try to strike. If she can complete her own challenge, she receives a small bonus and calls out a new direction.","img":"Fiora_P.png"},"spells":[{"name":"Lunge","descr":"Fiora lunges in a direction and stabs a nearby enemy, dealing physical damage and applying on-hit effects.","tooltip":"Fiora lunges in a direction and stabs a nearby enemy, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and applying on-hit effects. This attack prioritizes \u003Cspan class=\"colorD4BD22\"\u003EVitals\u003C\/span\u003E and enemies it will kill.\u003Cbr\u003E\u003Cbr\u003EIf this ability hits an enemy, {{ e4 }}% of its cooldown is refunded. ","cost":[20,25,30,35,40],"costType":" Mana","cd":[16,14,12,10,8],"range":[400,400,400,400,400],"key":"FioraQ"},{"name":"Riposte","descr":"Fiora parries all incoming damage and disables for a short time, then stabs in a direction. This stab slows the first enemy champion hit, or stuns them if Fiora blocked an immobilizing effect with this ability.","tooltip":"Fiora parries all incoming damage, debuffs, and disables for the next {{ e2 }} seconds and then stabs in the target direction.\u003Cbr\u003E\u003Cbr\u003EThe stab deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E magic damage to the first enemy champion hit and slows their movement and attack speed by {{ e4 }}% for {{ e3 }} seconds. \u003Cbr\u003E\u003Cbr\u003EIf Fiora parries an immobilizing effect, Riposte stuns instead of slowing.","cost":[50,50,50,50,50],"costType":" Mana","cd":[0,0,0,0,0],"range":[750,750,750,750,750],"key":"FioraW"},{"name":"Bladework","descr":"Fiora has increased attack speed for the next two attacks. The first attack slows the target, and the second attack will critically strike.","tooltip":"Fiora gains {{ e4 }}% attack speed for her next two attacks. The first attack cannot critically strike, but will apply a {{ e3 }}% slow for {{ e2 }} second. The second attack is guaranteed to critically strike for {{ f4 }}% damage \u003Cspan class=\"colorFF8C00\"\u003E({{ f3 }})\u003C\/span\u003E.","cost":[40,45,50,55,60],"costType":" Mana","cd":[13,11,9,7,5],"range":[425,425,425,425,425],"key":"FioraE"},{"name":"Grand Challenge","descr":"Fiora reveals all four Vitals on an enemy champion and gains movement speed while near them. If Fiora hits all 4 Vitals or if the target dies after she has hit at least one, Fiora and her allies in the area are healed over the next few seconds.","tooltip":"Fiora reveals all four \u003Cspan class=\"colorD4BD22\"\u003EVitals\u003C\/span\u003E on target champion, for a potential \u003Cspan class=\"colorFFFFFF\"\u003E{{ f8 }}%\u003C\/span\u003E max health true damage. In addition, Fiora gains Duelist's Dance's movement speed bonus \u003Cspan class=\"colorFFFFFF\"\u003E({{ f6 }}%)\u003C\/span\u003E while near the target.\u003Cbr\u003E\u003Cbr\u003EIf Fiora hits all 4 \u003Cspan class=\"colorD4BD22\"\u003EVitals\u003C\/span\u003E in {{ e1 }} seconds or if the target dies after she has hit at least one, Fiora and her allies in the area are healed for {{ e7 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f9 }})\u003C\/span\u003E each second for between {{ e9 }} to {{ e6 }} seconds, scaling with the amount of Vitals hit.","cost":[100,100,100],"costType":" Mana","cd":[110,90,70],"range":[500,500,500],"key":"FioraR"}]}