{"id":22,"key":"Ashe","name":"Ashe","title":"the Frost Archer","lore":"With each arrow she fires from her ancient ice-enchanted bow, Ashe proves she is a master archer. She chooses each target carefully, waits for the right moment, and then strikes with power and precision. It is with this same vision and focus that she pursues her goal of uniting the tribes of the Freljord and forging them into a mighty nation.\u003Cbr\u003E\u003Cbr\u003EAs a child, Ashe was always a dreamer. She marveled at the colossal, abandoned fortresses of her ancestors, and spent hours by the fire listening to tales of the Freljord's fabled champions. Most of all she loved the legend of Avarosa, the renowned Queen of the once magnificent and united Freljord. Though her mother chided her foolishness, Ashe swore one day she would join the scattered and warlike tribes of the tundra. She knew in her heart that if her people would stand together once more, they would reach greatness again.\u003Cbr\u003E\u003Cbr\u003EWhen Ashe was only fifteen, her mother was killed while commanding the tribe on a brash raid. Suddenly thrust into the role of leader, Ashe made the difficult decision to follow her childhood vision instead of seeking the revenge she craved. She spoke passionately against her tribe's demand for retribution, declaring the time had come to put blood feuds aside and broker a lasting peace. Some of her warriors questioned her fitness to rule and soon hatched a treasonous plot to kill the young leader.\u003Cbr\u003E\u003Cbr\u003EThe assassins struck while Ashe was on a routine hunt, but their plan was interrupted by the warning cry of a great hawk. Ashe looked back to see her tribesmen approaching with swords drawn. Outnumbered and overwhelmed, Ashe ran for hours. She found herself deep in uncharted territory, her weapon lost in the chase. When she heard another cry from the hawk, Ashe put her faith in the strange creature and followed it to a clearing. There she found the bird perched on a pile of stones - an ancient Freljord burial cairn. With a last glance at her, the hawk screeched and flew away. Approaching the mound, Ashe felt her breath turn to frost and an unnatural cold chill her to the bone. The stone at the top of the cairn was marked with a single rune: Avarosa.\u003Cbr\u003E\u003Cbr\u003EThe assassins burst into the clearing. Ashe lifted the runestone from the cairn to defend herself, revealing something hidden underneath: an ornate bow carved from ice. She grasped it, crying out in pain as frost formed on her fingers, and tore the bow from its resting place. Cold flowed from the enchanted weapon into Ashe, awakening a tremendous power that had always lived within her. \u003Cbr\u003E\u003Cbr\u003EAshe turned to face the assassins. She drew the bow, and by sheer instinct, willed arrows of pure ice to form from the cold, crisp air. With a single frozen volley, she ended the insurrection. Carefully replacing the cairn stone, she gave thanks to Avarosa for her gift, and returned home. Ashe's tribe immediately recognized the legendary weapon in the archer's hand as a blessing from the ancient Freljord queen herself.\u003Cbr\u003E\u003Cbr\u003EWith Avarosa's bow and her vision of peaceful unification, Ashe's tribe soon swelled, becoming the largest in the Freljord. Now known as the Avarosan, they stand together with the belief that a united Freljord will once again become a great nation.\u003Cbr\u003E\u003Cbr\u003E''One tribe, one people, one Freljord.''\u003Cbr\u003E -- Ashe","skins":[{"id":22000,"name":"default","num":0},{"id":22001,"name":"Freljord Ashe","num":1},{"id":22002,"name":"Sherwood Forest Ashe","num":2},{"id":22003,"name":"Woad Ashe","num":3},{"id":22004,"name":"Queen Ashe","num":4},{"id":22005,"name":"Amethyst Ashe","num":5},{"id":22006,"name":"Heartseeker Ashe","num":6},{"id":22007,"name":"Marauder Ashe","num":7},{"id":22008,"name":"PROJECT: Ashe","num":8}],"allytips":["Try to fire Enchanted Crystal Arrow in the same direction enemies are moving, so it is more likely to hit.","Volley arrows are blocked by the first enemy they hit, so keep your distance to avoid having them all absorbed by enemy frontliners.","Hawkshot reveals units in brush. If a team fight is occuring in the jungle it can give you a significant advantage."],"enemytips":["Ashe has very few defensive options, and she's a good target to gank.","Be wary of moving around the map alone if Ashe has not recently cast her Enchanted Crystal Arrow."],"tags":["Marksman","Support"],"info":{"attack":7,"defense":3,"magic":2,"difficulty":4},"stats":{"arm":21.212,"ad":56.508,"aso":-0.05,"crit":0,"hp":527.72,"mp":280,"mp5":6.972,"hp5":5.424,"range":600,"ms":325,"mr":30,"lvl":{"arm":3.4,"ad":2.26,"aso":3.33,"crit":0,"hp":79,"mp":32,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Frost Shot","descr":"Ashe's attacks slow their target, causing her to deal increased damage to these targets.\u003Cbr\u003E\u003Cbr\u003EAshe's critical strikes deal no bonus damage but apply an empowered slow to the target.","img":"Ashe_P.png"},"spells":[{"name":"Ranger's Focus","descr":"Ashe builds up Focus by attacking. At maximum Focus, Ashe can cast Ranger's Focus to consume all stacks of Focus, temporarily increasing her Attack Speed and transforming her basic attack into a powerful flurry attack for the duration.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EBasic attacks grant Focus for {{ e1 }} seconds, stacking up to {{ e2 }} times. Stacks fall off one at a time, and at {{ e2 }} stacks, Ranger's Focus can be cast, consuming all Focus.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E For {{ e3 }} seconds, Ashe gains {{ e4 }}% Attack Speed, and her basic attacks fire a flurry of arrows dealing \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E physical damage. During this time, she does not stack Focus. Ranger's Focus applies Frost Shot.","cost":[50,50,50,50,50],"costType":" Mana, {{ e2 }} Focus","cd":[0,0,0,0,0],"range":[400,400,400,400,400],"key":"AsheQ"},{"name":"Volley","descr":"Ashe fires 9 arrows in a cone for increased damage. Also applies Frost Shot.","tooltip":"Fires arrows in a cone, each dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage. Enemies can block multiple arrows, but only take damage from the first.\u003Cbr\u003E\u003Cbr\u003EChampion hits count as Critical Strikes for the purposes of Frost Shot.","cost":[50,50,50,50,50],"costType":" Mana","cd":[15,12.5,10,7.5,5],"range":[1200,1200,1200,1200,1200],"key":"AsheW"},{"name":"Hawkshot","descr":"Ashe sends her Hawk Spirit on a scouting mission anywhere on the map.","tooltip":"Reveals terrain as it flies toward target location anywhere on the map. Grants vision for {{ e4 }} seconds. Ashe can store up to 2 charges of Hawkshot.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[5,5,5,5,5],"range":[25000,25000,25000,25000,25000],"key":"AsheE"},{"name":"Enchanted Crystal Arrow","descr":"Ashe fires a missile of ice in a straight line. If the arrow collides with an enemy Champion, it deals damage and stuns the Champion, stunning for longer the farther arrow has traveled. In addition, surrounding enemy units take damage and are slowed.","tooltip":"Launches a crystal arrow of ice that stuns the first enemy Champion hit, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. The farther the arrow flies, the longer the stun, up to {{ e2 }} seconds. Surrounding enemies take half damage.","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[20000,20000,20000],"key":"AsheR"}]}