{"id":15,"key":"Sivir","name":"Sivir","title":"the Battle Mistress","lore":"''I don't care what face is on your coin, as long as it pays.''\u003Cbr\u003E\u003Cbr\u003ESivir is a renowned fortune hunter and mercenary captain who plies her trade in the deserts of Shurima. Armed with her legendary jeweled crossblade, she has fought and won countless battles for those who can afford her exorbitant price. Known for her fearless resolve and endless ambition, she prides herself on recovering buried treasures from the perilous tombs of Shurima - for a generous bounty. With ancient forces stirring the very bones of Shurima, Sivir finds herself torn between conflicting destinies.","skins":[{"id":15000,"name":"default","num":0},{"id":15001,"name":"Warrior Princess Sivir","num":1},{"id":15002,"name":"Spectacular Sivir","num":2},{"id":15003,"name":"Huntress Sivir","num":3},{"id":15004,"name":"Bandit Sivir","num":4},{"id":15005,"name":"PAX Sivir","num":5},{"id":15006,"name":"Snowstorm Sivir","num":6},{"id":15007,"name":"Warden Sivir","num":7},{"id":15008,"name":"Victorious Sivir","num":8}],"allytips":["Sivir's Boomerang Blade returns to her after reaching the max range, so you can shift position to hit enemies who would otherwise have evaded it.","Ricochet resets Sivir's basic attack timer on activation, so activating this immediately after landing a normal basic attack will maximize damage output.","Try saving Spell Shield for enemy abilities that can disable you such as stuns and roots."],"enemytips":["Boomerang Blade costs a lot of mana to cast, so dodging it sets Sivir back. If it hits you on the way out, avoid its path on the way back.","Sivir is a powerful pushing champion, so leaving her unattended in a lane for too long will often result in your turrets being destroyed.","When laning against Sivir, it is possible to throw off the timing of her Spell Shield by faking an advance, then backing off."],"tags":["Marksman"],"info":{"attack":9,"defense":3,"magic":1,"difficulty":4},"stats":{"arm":22.21,"ad":57.46,"aso":0,"crit":0,"hp":515.76,"mp":284,"mp5":8.012,"hp5":5.174,"range":500,"ms":335,"mr":30,"lvl":{"arm":3.25,"ad":2.41,"aso":1.6,"crit":0,"hp":82,"mp":50,"mp5":0.9,"hp5":0.55,"mr":0}},"pass":{"name":"Fleet of Foot","descr":"Sivir gains a short burst of Movement Speed when she attacks an enemy champion.","img":"Sivir_Passive.png"},"spells":[{"name":"Boomerang Blade","descr":"Sivir hurls her crossblade like a boomerang, dealing damage each way.","tooltip":"Sivir hurls her crossblade like a boomerang, which deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to the first target hit and {{ e2 }}% reduced damage to each subsequent target down to a minimum of {{ e3 }}%.","cost":[70,80,90,100,110],"costType":" Mana","cd":[9,9,9,9,9],"range":[1200,1200,1200,1200,1200],"key":"SivirQ"},{"name":"Ricochet","descr":"Sivir's next few basic attacks will bounce to nearby targets, dealing reduced damage to secondary targets.","tooltip":"Sivir's next {{ e4 }} basic attacks bounce to nearby targets, dealing \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E physical damage to the first target and \u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E physical damage to each subsequent target.\u003Cbr\u003E\u003Cbr\u003EIf a given Ricochet attack critically strikes its first target, all subsequent bounces from that attack will also critically strike.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003ETargets cannot be hit more than once by a given Ricochet attack and on-hit effects are applied only to the first target of each attack.\u003C\/i\u003E\u003C\/span\u003E","cost":[60,60,60,60,60],"costType":" Mana","cd":[12,10.5,9,7.5,6],"range":[20,20,20,20,20],"key":"SivirW"},{"name":"Spell Shield","descr":"Creates a magical barrier that blocks a single enemy ability cast on Sivir. She receives Mana back if a spell is blocked.","tooltip":"Sivir creates a magical barrier for {{ e1 }} seconds that blocks the next incoming enemy ability.\u003Cbr\u003E\u003Cbr\u003EIf an ability is blocked by the shield, Sivir regains {{ e2 }} Mana.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[22,19,16,13,10],"range":[20,20,20,20,20],"key":"SivirE"},{"name":"On The Hunt","descr":"Sivir leads her allies in battle, granting them a surge Movement Speed for a period of time. Additionally passively grants Sivir bonus Attack Speed while Ricochet is active.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003ESivir gains {{ e1 }}% Attack Speed while Ricochet is active.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003ESivir rallies her allies for {{ e3 }} seconds, granting all nearby allies an initial {{ e4 }}% Movement Speed bonus that reduces to {{ e2 }}% after the first {{ e5 }} seconds of On The Hunt elapse.","cost":[100,100,100],"costType":" Mana","cd":[120,100,80],"range":[1000,1000,1000],"key":"SivirR"}]}