{"id":1,"key":"Annie","name":"Annie","title":"the Dark Child","lore":"There have always been those within Noxus who did not agree with the evils perpetrated by the Noxian High Command. The High Command had just put down a coup attempt from the self-proclaimed Crown Prince Raschallion, and a crackdown on any form of dissent against the new government was underway. These political and social outcasts, known as the Gray Order, sought to leave their neighbors in peace as they pursued dark arcane knowledge.\u003Cbr\u003E\u003Cbr\u003EThe leaders of this outcast society were a married couple: Gregori Hastur, the Gray Warlock, and his wife Amoline, the Shadow Witch. Together they led an exodus of magicians and other intelligentsia from Noxus, resettling their followers beyond the Great Barrier to the northern reaches of the unforgiving Voodoo Lands. Though survival was a challenge at times, the Gray Order's colony managed to thrive in a land where so many others would have failed.\u003Cbr\u003E\u003Cbr\u003EYears after the exodus, Gregori and Amoline had a child: Annie. Early on, Annie's parents knew there was something special about their daughter. At the age of two, Annie miraculously ensorcelled a shadow bear - a ferocious denizen of the petrified forests outside the colony - turning it into her pet. To this day she keeps her bear ''Tibbers'' by her side, often keeping him spellbound as a stuffed doll to be carried like a child's toy. The combination of Annie's lineage and the dark magic of her birthplace have given this little girl tremendous arcane power.","skins":[{"id":1000,"name":"default","num":0},{"id":1001,"name":"Goth Annie","num":1},{"id":1002,"name":"Red Riding Annie","num":2},{"id":1003,"name":"Annie in Wonderland","num":3},{"id":1004,"name":"Prom Queen Annie","num":4},{"id":1005,"name":"Frostfire Annie","num":5},{"id":1006,"name":"Reverse Annie","num":6},{"id":1007,"name":"FrankenTibbers Annie","num":7},{"id":1008,"name":"Panda Annie","num":8},{"id":1009,"name":"Sweetheart Annie","num":9},{"id":1010,"name":"Hextech Annie","num":10}],"allytips":["Storing a stun for use with her ultimate can turn the tide of a team fight.","Striking killing blows on minions with Disintegrate enables Annie to farm extremely well early in the game.","Molten Shield is a good spell to cast to work up to Annie's stun, so sometimes it's beneficial to grab at least 1 rank in it early."],"enemytips":["Annie's summoned bear, Tibbers, burns opposing units around himself. Try to keep your distance from him after he's been summoned.","Summoner Smite can be used to help take down Tibbers.","Keep an eye out for a white, swirling power around Annie. It means she's ready to unleash her stun."],"tags":["Mage"],"info":{"attack":2,"defense":3,"magic":10,"difficulty":6},"stats":{"arm":19.22,"ad":50.41,"aso":0.08,"crit":0,"hp":511.68,"mp":334,"mp5":6,"hp5":5.424,"range":575,"ms":335,"mr":30,"lvl":{"arm":4,"ad":2.625,"aso":1.36,"crit":0,"hp":76,"mp":50,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Pyromania","descr":"After casting 4 spells, Annie's next offensive spell will stun the target for a short duration.","img":"Annie_Passive.png"},"spells":[{"name":"Disintegrate","descr":"Annie hurls a Mana infused fireball, dealing damage and refunding the Mana cost if it destroys the target.","tooltip":"Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. Mana cost and half the cooldown are refunded if Disintegrate kills the target.","cost":[60,65,70,75,80],"costType":" Mana","cd":[4,4,4,4,4],"range":[625,625,625,625,625],"key":"AnnieQ"},{"name":"Incinerate","descr":"Annie casts a blazing cone of fire, dealing damage to all enemies in the area.","tooltip":"Casts a cone of fire dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all enemies in the area.","cost":[70,80,90,100,110],"costType":" Mana","cd":[8,8,8,8,8],"range":[600,600,600,600,600],"key":"AnnieW"},{"name":"Molten Shield","descr":"Grants Annie and Tibbers increased percentage Damage Resist and damages enemies who attack with basic attacks.","tooltip":"Annie grants herself and Tibbers {{ e1 }}% damage reduction for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EWhile the shield is active, enemies who basic attack it take {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.","cost":[20,20,20,20,20],"costType":" Mana","cd":[10,10,10,10,10],"range":[0,0,0,0,0],"key":"AnnieE"},{"name":"Summon: Tibbers","descr":"Annie wills her bear Tibbers to life, dealing damage to units in the area. Tibbers can attack and also burns enemies that stand near him.","tooltip":"Summons Tibbers, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in the target area. For the next 45 seconds, Tibbers burns nearby enemies for {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E per second and attacks for {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E as magic damage. Annie can control Tibbers by reactivating this ability.\u003Cbr\u003E\u003Cbr\u003ETibbers \u003Cspan class=\"colorFFEB7F\"\u003EEnrages\u003C\/span\u003E when: summoned; Annie uses Pyromania on an enemy Champion; and when Annie dies.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFEB7F\"\u003EEnrages\u003C\/span\u003E: Tibbers gains 275% Attack Speed and 100% Movement Speed, decaying over 3 seconds.","cost":[100,100,100],"costType":" Mana","cd":[120,100,80],"range":[600,600,600],"key":"AnnieR"}]}