{"id":74,"key":"Heimerdinger","name":"Heimerdinger","title":"the Revered Inventor","lore":"From the Journal of Professor Cecil B. Heimerdinger\u003Cbr\u003E\u003Cbr\u003E10.14\u003Cbr\u003E\u003Cbr\u003E09:15\u003Cbr\u003E\u003Cbr\u003ECurrent meteorological conditions in Bandle City seem optimal. Atmospheric pressure is ideal for today's experiments!\u003Cbr\u003E\u003Cbr\u003ERunning a fifth trial for my Tridyminiumobulator this afternoon. Some fine tuning is required; singed my mustache. Need to adjust the energy throughput.\u003Cbr\u003E\u003Cbr\u003E16:00\u003Cbr\u003E\u003Cbr\u003ETridyminiumobulator is still not maintaining intended proper energy efficiency! Necessary to run more numbers. In the meantime, I have found something else that's very intriguing.\u003Cbr\u003E\u003Cbr\u003EWhile returning home after today's tests, I passed a gaggle of young yordles throwing a spherical projectile at each other. It's a simple enough concept: throw the object at someone, catch it, throw it at another yordle, repeat. But yordle miscalculations result in several errors! They throw with inconsistent accuracy and force, and the ''ball'' (as they refer to it) is frequently dropped... There are many ways for this process to be improved. According to my calculations, and after collecting data from the participants, if the pitching was consistent in both speed and arc there would be a 44.57% increase to fun! I need to ponder this for the evening.\u003Cbr\u003E\u003Cbr\u003E10.15\u003Cbr\u003E\u003Cbr\u003E05:20\u003Cbr\u003E\u003Cbr\u003EEureka! I've devised a solution.\u003Cbr\u003E\u003Cbr\u003EI've invented an automated ball pitcher. Current name: H-28G. It employs a consistent speed and trajectory, ensuring that the recipient will always be able to catch the ball. It redirects itself to the nearest yordle (if there is more than one in the vicinity) ensuring everyone has a turn. I'll take it to the young yordles today and demonstrate my invention.\u003Cbr\u003E\u003Cbr\u003EAlso: spilled toxic acid on my shoes this morning. Bothersome.\u003Cbr\u003E\u003Cbr\u003E10:30\u003Cbr\u003E\u003Cbr\u003ETested the automated pitcher today. It did not go as planned. The young ones were excited enough about my invention, but, when the machine was turned on, it was far too powerful! Even at its lowest setting it completely knocked a yordle off his feet. Clearly, I overestimated the velocity behind their throws... I'll return soon to make adjustments.\u003Cbr\u003E\u003Cbr\u003EBut my priority, for now, is the Tridyminiumobulator; I must fix its complications before lunch. Once it's in good shape, I'll need to test it somewhere else. Bandle City is proving insufficient for field research.\u003Cbr\u003E\u003Cbr\u003E10.16\u003Cbr\u003E\u003Cbr\u003E15:55\u003Cbr\u003E\u003Cbr\u003EApparently, there's a giant in town. A highly annoying anomaly. The noise outside is disturbing my research!\u003Cbr\u003E\u003Cbr\u003EMust check fish tank today. They've been strangely quiet...\u003Cbr\u003E\u003Cbr\u003E10.17\u003Cbr\u003E\u003Cbr\u003E10:40\u003Cbr\u003E\u003Cbr\u003EI have heard that many yordles have been injured due to the giant-related disturbance. If this doesn't stop soon, intervention will be necessary! I hope H-28G is still intact. I would lose a lot of time if it has to be rebuilt.\u003Cbr\u003E\u003Cbr\u003E16:30\u003Cbr\u003E\u003Cbr\u003EEverything is quiet again. It seems that the giant came to his senses and ran off. I need to gather H-28G tomorrow, once I've finished with more pressing matters. I've almost perfected the Tridyminiumobulator!\u003Cbr\u003E\u003Cbr\u003E10.18\u003Cbr\u003E\u003Cbr\u003E08:30\u003Cbr\u003E\u003Cbr\u003EToday has been quite eventful already. I was surprised by a knock at my door. It seemed like the entire city was standing in front of my house. Normally, when a crowd has gathered, it's because they have some petty grievance about my work. But this time, they were celebrating!\u003Cbr\u003E\u003Cbr\u003EAstonishingly, it seems one of the young yordles took advantage of the H-28G prototype I had left behind amidst the giant tomfoolery. He proved to be innovative, and repurposed the invention into a makeshift turret. It's powerful enough to scare off a giant - imagine that! What an ingenious little fellow.\u003Cbr\u003E\u003Cbr\u003EI wish I could employ his like-minded encephalon in the near future - I have big plans and his assistance could be valuable - but he'd have to leave Bandle City. The scope of my plans necessitates a more expansive testing ground.\u003Cbr\u003E\u003Cbr\u003ERuneterra should suffice!","skins":[{"id":74000,"name":"default","num":0},{"id":74001,"name":"Alien Invader Heimerdinger","num":1},{"id":74002,"name":"Blast Zone Heimerdinger","num":2},{"id":74003,"name":"Piltover Customs Heimerdinger","num":3},{"id":74004,"name":"Snowmerdinger","num":4},{"id":74005,"name":"Hazmat Heimerdinger","num":5}],"allytips":["Turret placement can be a deciding factor in a battle. Against most enemies turrets are best when they can support each other, but if the enemy has a lot of area of effect damage your turrets can be destroyed quickly. Placing turrets in brush can lead to a surprise attack in your favor.","The success of Electron Storm Grenade is very important to Heimerdinger's survival. The slow and stun both are capable of keeping enemies in place long enough to punish them, but it is also the first line of defense against a surprise attack.","Spreading out Hextech Micro-Rockets leads to more reliable damage and more efficiency against multiple targets, but focusing it creates the biggest impact."],"enemytips":["It's better to destroy all of Heimerdinger's turrets at once with the help of creeps than to fight them one at a time.","Be wary of Heimerdinger's Upgrade!!!, as he can use it to find an answer to most trouble he gets into. Once his ultimate is down, go in for the kill!"],"tags":["Mage","Support"],"info":{"attack":2,"defense":6,"magic":8,"difficulty":8},"stats":{"arm":19.04,"ad":55.536,"aso":0,"crit":0,"hp":476,"mp":307.2,"mp5":6,"hp5":11.008,"range":550,"ms":340,"mr":30,"lvl":{"arm":3,"ad":2.7,"aso":1.36,"crit":0,"hp":75,"mp":40,"mp5":0.8,"hp5":1.75,"mr":0}},"pass":{"name":"Techmaturgical Repair Bots","descr":"Heimerdinger gives nearby allied H-28G Turrets and Champions increased Health Regeneration. ","img":"Heimerdinger_Passive.png"},"spells":[{"name":"H-28G Evolution Turret","descr":"Heimerdinger lays down a rapid-fire cannon turret equipped with a secondary pass-through beam attack (turrets deal half damage to towers).","tooltip":"Places a Turret at target location. Turret attacks prioritize Heimerdinger's targets and enemies attacking Heimerdinger. Their Health increases with Heimerdinger's level and they shut down if he moves far away. Heimerdinger generates a Turret Kit every \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E seconds and can hold {{ e3 }} Kit(s) at once. \u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"colorFFFFFF\"\u003EH-28G Evolution Turret Stats\u003C\/span\u003E\u003C\/u\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EHealth:\u003C\/span\u003E \u003Cspan class=\"colorFFFFFF\"\u003E{{ f4 }}\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EAttack - Cannon:\u003C\/span\u003E {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and +{{ e9 }}% beam charge each attack. \u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EAttack - Beam:\u003C\/span\u003E {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage in a line every {{ e6 }} seconds.\u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EMaximum Turrets Placed:\u003C\/span\u003E 3","cost":[20,20,20,20,20],"costType":" Mana and  Turret Kit","cd":[1,1,1,1,1],"range":[350,350,350,350,350],"key":"HeimerdingerQ"},{"name":"Hextech Micro-Rockets","descr":"Heimerdinger fires long-range rockets that converge on his cursor. ","tooltip":"Unleashes a barrage of 5 rockets that converge towards the cursor and fan out past it. Each rocket deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage. Units hit multiple times take reduced damage:\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EChampions and Monsters:\u003C\/span\u003E {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage, max {{ e6 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E total damage\u003Cbr\u003E\u003Cspan class=\"colorFFDD77\"\u003EMinions:\u003C\/span\u003E 60% of base damage\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EAiming between Heimerdinger and the target increases the rocket spread.","cost":[70,80,90,100,110],"costType":" Mana","cd":[11,11,11,11,11],"range":[1325,1325,1325,1325,1325],"key":"HeimerdingerW"},{"name":"CH-2 Electron Storm Grenade","descr":"Heimerdinger lobs a grenade at a location, dealing damage to enemy units, as well as stunning anyone directly hit and slowing surrounding units.","tooltip":"Hurls a grenade that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage to enemy units and slows their Movement Speed by {{ e3 }}% for {{ e2 }} seconds. Enemies in the center of the blast are also stunned for {{ e4 }} seconds.","cost":[85,85,85,85,85],"costType":" Mana","cd":[18,16,14,12,10],"range":[970,970,970,970,970],"key":"HeimerdingerE"},{"name":"UPGRADE!!!","descr":"Heimerdinger invents an upgrade, causing his next spell to have increased effects. ","tooltip":"Makes next basic ability free and gives it bonus effects. Reactivate to cancel. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF99\"\u003EH-28Q Apex Turret:\u003C\/span\u003E Places a Turret that deals {{ e7 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage with its cannon and {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage with its beam for 8 seconds. It has splash damage, immunity to disables, its attacks slow targets by 25% for 2 seconds, it receives 20% of a beam charge per attack, and it doesn't count toward the Turret limit. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF99\"\u003EHextech Rocket Swarm:\u003C\/span\u003E Fires 4 waves of rockets that deal {{ e8 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E Magic Damage each. Champions and Monsters hit by multiple rockets take reduced damage, max {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFF99\"\u003ECH-3X Lightning Grenade:\u003C\/span\u003E Throws a bouncing grenade that discharges three times, dealing {{ e0 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f4 }})\u003C\/span\u003E Magic Damage. Both the stun and slow areas are larger and the slow is improved to 80%. ","cost":[100,100,100],"costType":" Mana","cd":[100,85,70],"range":[1,1,1],"key":"HeimerdingerR"}]}