{"id":14,"key":"Sion","name":"Sion","title":"The Undead Juggernaut","lore":"BLOOD.\u003Cbr\u003E\u003Cbr\u003ESMELL IT.\u003Cbr\u003E\u003Cbr\u003EWANT. ACHING. NEED!\u003Cbr\u003E\u003Cbr\u003ECLOSE NOW. THEY COME.\u003Cbr\u003E\u003Cbr\u003ENO CHAINS? FREE! KILL!\u003Cbr\u003E\u003Cbr\u003EIN REACH. YES! DIE! DIE!\u003Cbr\u003E\u003Cbr\u003EGone. Too quick. No fight. More. I want... more.\u003Cbr\u003E\u003Cbr\u003EA voice? Unfamiliar. I see him. The Grand General. My general.\u003Cbr\u003E\u003Cbr\u003EHe leads. I follow. Marching. To where? I should know. I can't remember.\u003Cbr\u003E\u003Cbr\u003EIt all bleeds together. Does it matter? Noxus conquers. The rest? Trivial. So long...  since I've tasted victory.\u003Cbr\u003E\u003Cbr\u003EThe war wagon rocks. Rattles. A cramped cage. Pointless ceremony. The waiting. Maddening. Faster, dogs!\u003Cbr\u003E\u003Cbr\u003EThere. Banners. Demacians and their walls. Cowards. Their gates will shatter. Thoughts of the massacre come easily.\u003Cbr\u003E\u003Cbr\u003EWho gave the order to halt? The underlings don't answer. No familiar faces. If I do not remember, neither will history.\u003Cbr\u003E\u003Cbr\u003EThe cage is opened. Finally! No more waiting. WE CHARGE!\u003Cbr\u003E\u003Cbr\u003ESlings and arrows? The weapons of children! Their walls will not save them!\u003Cbr\u003E\u003Cbr\u003EI can taste their fear. They shrink at every blow as their barricades splinter. SOON!\u003Cbr\u003E\u003Cbr\u003ENoxian drums. Demacian screams. Glory isn't accolades; glory is hot blood on your hands! This is life!\u003Cbr\u003E\u003Cbr\u003EA thousand shattered corpses lie at my feet, and Demacian homes burn all around me. It's over too quickly! Just one more...\u003Cbr\u003E\u003Cbr\u003EThe men stare. There's fear in their eyes. If they're afraid to look upon victory, I should pluck those craven eyes out. There is no fear in the Grand General's eyes, only approval. He is pleased with this conquest.\u003Cbr\u003E\u003Cbr\u003EWalking the field with the Grand General, surveying the carnage, I ache for another foe. He is hobbled, a leg wound from the battle? If it pains him, he does not show it. A true Noxian. I do not like his pet, though; it picks over the dead, having earned nothing. His war hounds were more fitting company.\u003Cbr\u003E\u003Cbr\u003EDemacia will be within our grasp soon. I can feel it. I am ready to march. The Grand General insists that I rest. How can I rest when my enemies still live?\u003Cbr\u003E\u003Cbr\u003EWhy do we mill about? The waiting eats at me. I'm left to my own devices. The bird watches. It's unsettling. Were it anyone else's, I would crush it.\u003Cbr\u003E\u003Cbr\u003EFatigue sets in. I've never felt so... tired.\u003Cbr\u003E\u003Cbr\u003EBoram? Is that you? What are you whispering?\u003Cbr\u003E\u003Cbr\u003EWhere am I?\u003Cbr\u003E\u003Cbr\u003ECaptured? Kenneled like some dog. How?\u003Cbr\u003E\u003Cbr\u003EThere was... the battle, the razing of the fortress, the quiet of the aftermath. Were we ambushed? I can't remember.\u003Cbr\u003E\u003Cbr\u003EI was wounded. I can feel the ragged gash... but no pain. They thought me dead. Now, I am their prize. Fate is laughing. I will not be caged! They will regret sparing me.\u003Cbr\u003E\u003Cbr\u003EDemacian worms! They parrot kind words, but they are ruthless all the same. This place is a dank pit. They bring no food. There is no torture. They do not make a show of me. I am left to rot.\u003Cbr\u003E\u003Cbr\u003EI remember my finest hour. I held a king by his throat and felt the final beat of his heart through my tightening grasp. I don't remember letting go. Is this your vengeance, Jarvan?\u003Cbr\u003E\u003Cbr\u003EI hear the triumphal march. Boots on stone. Faint, through the dungeon walls. The cadence of Noxian drums. I shall be free. Demacian blood will run in the streets!\u003Cbr\u003E\u003Cbr\u003ENo one came. I heard no struggle. No retreat. Did I imagine it?\u003Cbr\u003E\u003Cbr\u003EThere is no aching in this stump. I barely noticed the iron boot. It's caked in rust.\u003Cbr\u003E\u003Cbr\u003EWhen did I lose my leg?\u003Cbr\u003E\u003Cbr\u003EI still smell the blood. Battle. It brings comfort.\u003Cbr\u003E\u003Cbr\u003EThe hunger gnaws. I have not slept. Time crawls. So tired.\u003Cbr\u003E\u003Cbr\u003EHow long?\u003Cbr\u003E\u003Cbr\u003ESo dark. This pit. I remember. Grand General. His whispering. What was it?\u003Cbr\u003E\u003Cbr\u003ENot who I think.\u003Cbr\u003E\u003Cbr\u003EFading. Mustn't forget.\u003Cbr\u003E\u003Cbr\u003EMessage. Cut. Remember.\u003Cbr\u003E\u003Cbr\u003E''SION – Beware ravens.''\u003Cbr\u003E\u003Cbr\u003EFREE ME!\u003Cbr\u003E\u003Cbr\u003EBLOOD.","skins":[{"id":14000,"name":"default","num":0},{"id":14001,"name":"Hextech Sion","num":1},{"id":14002,"name":"Barbarian Sion","num":2},{"id":14003,"name":"Lumberjack Sion","num":3},{"id":14004,"name":"Warmonger Sion","num":4},{"id":14005,"name":"Mecha Zero Sion","num":5}],"allytips":["You only have very slight turning ability during Unstoppable Onslaught, so make sure to use it in straight paths.","Roar of the Slayer is a great setup ability to land a very powerful Decimating Smash.","The Soul Furnace buff displays how much shield strength is remaining, use this information to time its explosion perfectly."],"enemytips":["Even if Sion still hits a Decimating Smash, making him release the charge earlier reduces its impact.","Use the time after Sion has died to reposition and prepare for his return."],"tags":["Tank","Fighter"],"info":{"attack":5,"defense":9,"magic":3,"difficulty":5},"stats":{"arm":23.04,"ad":59.72,"aso":-0.08,"crit":0,"hp":542.64,"mp":325.6,"mp5":8.008,"hp5":10.18,"range":175,"ms":345,"mr":32.1,"lvl":{"arm":3,"ad":4,"aso":1.3,"crit":0,"hp":73,"mp":42,"mp5":0.6,"hp5":0.8,"mr":1.25}},"pass":{"name":"Glory in Death","descr":"After being killed, Sion will reanimate with rapidly decaying Health. His attacks become very rapid, gain 100% Lifesteal and deal bonus damage equal to 10% of his target's maximum Health (max 75 to monsters).\u003Cbr\u003E\u003Cbr\u003EAll his abilities are replaced with Death Surge, which grants a burst of Movement Speed.","img":"Sion_Passive1.png"},"spells":[{"name":"Decimating Smash","descr":"Sion charges a powerful swing in an area in front of himself that will deal damage to enemies when released. If he charges for enough time, enemies hit by the swing will also be knocked up and stunned.\u003C\/font\u003E","tooltip":"Sion charges up a heavy blow for up to 2 seconds. When released, he deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E to {{ e4 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E physical damage to enemies hit ({{ e8 }}% damage to minions) and briefly slows them.\u003Cbr\u003E\u003Cbr\u003EIf Sion charges for at least 1 second, enemies are knocked up and stunned for 1.25 to 2.25 seconds.","cost":[45,45,45,45,45],"costType":" Mana","cd":[10,9,8,7,6],"range":[10000,10000,10000,10000,10000],"key":"SionQ"},{"name":"Soul Furnace","descr":"Sion shields himself and can reactivate after 3 seconds to deal Magic Damage to enemies nearby. When Sion kills enemies, he passively gains maximum Health.","tooltip":"\u003Cspan class=\"colorFFE076\"\u003EPassive:\u003C\/span\u003E Sion gains {{ e5 }} maximum Health when he kills a unit ({{ e6 }} for large monsters and champion kills or assists). \u003Cspan class=\"colorFF3300\"\u003ECurrent Bonus: {{ f1 }} \u003C\/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFE076\"\u003EActive:\u003C\/span\u003E Sion shields himself for {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"colorFF3300\"\u003E(+{{ f2 }})\u003C\/span\u003E ({{ e3 }}% of maximum Health) for 6 seconds. After {{ e7 }} seconds, while the shield holds, Sion can reactivate to deal {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E plus {{ e4 }}% of the target's maximum Health as magic damage to nearby enemies. Max 400 bonus damage to minions and monsters.","cost":[65,70,75,80,85],"costType":" Mana","cd":[13,13,13,13,13],"range":[500,500,500,500,500],"key":"SionW"},{"name":"Roar of the Slayer","descr":"Sion fires a short range shockwave that damages and slows and reduces the Armor of the first enemy hit. If the shockwave hits a minion or monster, it will be knocked back, damaging and slowing all enemies that it passes through.","tooltip":"Sion fires a shockwave, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to the first enemy hit, slowing it by {{ e2 }}%, and reducing its Armor by {{ e5 }}% for 2.5 seconds.\u003Cbr\u003E\u003Cbr\u003EIf the target is not a champion, it will be knocked back. Enemies that the knocked back unit collides with take {{ e6 }}% bonus damage and are slowed by {{ e2 }}%.","cost":[35,40,45,50,55],"costType":" Mana","cd":[12,11,10,9,8],"range":[800,800,800,800,800],"key":"SionE"},{"name":"Unstoppable Onslaught","descr":"Sion charges in a direction, ramping up speed over time. He can steer his charge slightly with the mouse cursor location. When he collides with an enemy he deals damage and knocks them up based on the distance he has charged.","tooltip":"Sion charges in a direction for 8 seconds and can steer slowly towards the mouse cursor. While charging, Sion is immune to all Crowd Control. Reactivating will cancel Sion's charge early.\u003Cbr\u003E\u003Cbr\u003EWhen Sion collides with an enemy champion or wall, he deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and knocks up enemies in a small area for {{ e5 }} seconds. Enemies in a larger area take the same damage and are slowed by {{ e3 }}% for 3 seconds.\u003Cbr\u003E\u003Cbr\u003EThe damage increases to {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E and the stun increases to {{ e6 }} seconds as Sion charges farther.","cost":[100,100,100],"costType":" Mana","cd":[140,100,60],"range":[7500,7500,7500],"key":"SionR"}]}