{"id":126,"key":"Jayce","name":"Jayce","title":"the Defender of Tomorrow","lore":"Armed with wit, charm, and his signature transforming hammer, Jayce lives to protect his native Piltover. Long before his nation called him a hero, however, he was a promising young inventor. When Piltover commissioned him to study a rare arcane crystal, Jayce discovered it could be used as a vast energy source. Eager to make a name for himself, he began developing a device to harness its power. Word of the crystal's potential reached beyond the borders of Piltover. Viktor, the machine-augmented scientist from Zaun, brought Jayce an offer - together, they could use the crystal to advance his ''glorious evolution,'' a vision of humanity fused with technology. Jayce refused, but the Zaunite had no intention of leaving empty handed. He effortlessly blasted Jayce aside and seized the crystal, incinerating the lab's meager security force as he left for Zaun. Jayce implored the Piltover government to respond, but the officials refused to support an act of aggression. He decided to act alone, realizing that if no one struck back, Piltover would never be safe.\u003Cbr\u003E\u003Cbr\u003EJayce returned to the lab to prepare for his attack. After intense research, development, and hands-on testing, he emerged with his crowning achievement - the Mercury Hammer. Weapon in hand, Jayce marched to Zaun and began his one-man assault. Viktor's acolytes rushed to stop him, but Jayce smashed them aside, fighting his way into the heart of the lab. Inside, Jayce saw the horrifying brilliance of Viktor's creations, all powered by the energy of the arcane crystal. He realized that his only option was to destroy the power source, but Viktor stood in his way. Though their clash left both scientists heavily wounded, Jayce managed a desperate strike at the crystal. He shattered it and escaped as Viktor's machines erupted in flames. When he returned home, exhausted but victorious, the citizens of Piltover hailed Jayce as a hero. He reveled in the adoration, but knew that his actions had drawn the attention of dangerous enemies. Now devoted to the defense of his people, Jayce is Piltover's best hope for a bright future.\u003Cbr\u003E\u003Cbr\u003E''Trust me: if we're smart, Piltover can stand strong against any threat. Hey, I'm living proof.''\u003Cbr\u003E-- Jayce","skins":[{"id":126000,"name":"default","num":0},{"id":126001,"name":"Full Metal Jayce","num":1},{"id":126002,"name":"Debonair Jayce","num":2},{"id":126003,"name":"Forsaken Jayce","num":3},{"id":126004,"name":"Jayce Brighthammer","num":4}],"allytips":["Be sure to switch stances often. It will enhance your attacks and grant you quick bursts of speed.","If you find yourself taking lots of damage, try using Jayce's Hammer Stance, as it grants you additional defenses.","For increased range and damage, try casting Shock Blast through the Acceleration Gate."],"enemytips":["Jayce can attack in melee or at range. Pay attention to his stance and weapon color to know how he is going to attack.","If you see Jayce drop his Acceleration Gate, be careful, he is probably about to cast Shock Blast.","Jayce is strong in the early game. If he gains the advantage, play defensively."],"tags":["Fighter","Marksman"],"info":{"attack":8,"defense":4,"magic":3,"difficulty":7},"stats":{"arm":22.38,"ad":50.38,"aso":-0.05,"crit":0,"hp":571.2,"mp":357.2,"mp5":6,"hp5":7.344,"range":125,"ms":335,"mr":30,"lvl":{"arm":3.5,"ad":3.5,"aso":3,"crit":0,"hp":90,"mp":37,"mp5":0.8,"hp5":0.8,"mr":0}},"pass":{"name":"Hextech Capacitor","descr":"After casting Transform Jayce gains 40 Movement Speed and can move through units for the next 1.25 seconds.","img":"Jayce_Passive.png"},"spells":[{"name":"To the Skies! \/ Shock Blast","descr":"Hammer Stance: Leaps to an enemy dealing physical damage and slowing enemies.\u003Cbr\u003E\u003Cbr\u003ECannon Stance: Fires an orb of electricity that detonates upon hitting an enemy (or reaching the end of its path) dealing physical damage to all enemies hit.","tooltip":"Leaps to an enemy dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to nearby enemies and slowing them by {{ e3 }}% for {{ e5 }} seconds.","cost":[40,40,40,40,40,40],"costType":" Mana","cd":[16,14,12,10,8,6],"range":[600,600,600,600,600,600],"key":"JayceQ"},{"name":"Lightning Field \/ Hyper Charge","descr":"Hammer Stance: Passive: Restores Mana per strike. Active: Creates a field of lightning damaging nearby enemies for several seconds.\u003Cbr\u003E\u003Cbr\u003ECannon Stance: Gains a burst of energy, increasing Attack Speed to maximum for several attacks.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Gains {{ e5 }} Mana per strike while in Hammer Stance.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Creates an electric aura dealing {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage over {{ e2 }} seconds to nearby enemies.","cost":[40,40,40,40,40,40],"costType":" Mana","cd":[10,10,10,10,10,10],"range":[285,285,285,285,285,285],"key":"JayceW"},{"name":"Thundering Blow \/ Acceleration Gate","descr":"Hammer Stance: Deals magic damage to an enemy and knocks them back a short distance.\u003Cbr\u003E\u003Cbr\u003ECannon Stance: Deploys an Acceleration Gate increasing the Movement Speed of all allied champions who pass through it. If Shock Blast is fired through the gate the missile speed, range, and damage will increase.","tooltip":"Deals {{ e4 }}% of the target's maximum health \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E as magic damage and knocks them back a short distance. ({{ e1 }} Maximum Damage against monsters)","cost":[55,55,55,55,55,55],"costType":" Mana","cd":[15,14,13,12,11,10],"range":[240,240,240,240,240,240],"key":"JayceE"},{"name":"Mercury Cannon \/ Mercury Hammer","descr":"Hammer Stance: Transforms the Mercury Hammer into the Mercury Cannon gaining new abilities and increased range. The first attack in this form reduces the target's Armor and Magic Resist.\u003Cbr\u003E\u003Cbr\u003ECannon Stance: Transforms the Mercury Cannon into the Mercury Hammer gaining new abilities and increasing Armor and Magic Resist. The first attack in this form deals additional magic damage.","tooltip":"\u003Cspan class=\"colorFF8C00\"\u003EActive: \u003C\/span\u003ETransforms the Mercury Hammer into the Mercury Cannon gaining new abilities and ranged attacks.\u003Cbr\u003E\u003Cbr\u003EThe next attack in Cannon Stance reduces the target's Armor and Magic Resist by {{ f3 }}% for {{ e3 }} seconds.","cost":[0],"costType":"No Cost","cd":[6],"range":[600],"key":"JayceR"}]}