{"id":85,"key":"Kennen","name":"Kennen","title":"the Heart of the Tempest","lore":"There exists an ancient order originating in the Ionian Isles dedicated to the preservation of balance. Order, chaos, light, darkness -- all things must exist in perfect harmony for such is the way of the universe. This order is known as the Kinkou and it employs a triumvirate of shadow warriors to uphold its causes in the world. Kennen is one of these shadow warriors, entrusted with the sacred duty of Coursing the Sun - tirelessly conveying the justice of the Kinkou.\u003Cbr\u003E\u003Cbr\u003EKennen was born in Bandle City and it was said that in his first living moments he bolted first from the womb and second from the midwife who delivered him. His parents had thought that he would outgrow his boundless energy, but as he matured his energy found no limits and was matched only by his unnerving speed. Despite his astonishing gifts, he remained unnoticed (or at least uncaught, as he was quite the prankster) until, on a dare, he ran straight up the great outer wall of the Placidium. When word of this feat reached Kinkou ears, Kennen was quickly and quietly brought in for an audience. He found that the role of the Heart of the Tempest suited him, frenetically delivering both the word and the punishments of the Kinkou across the realm. He now works with his fellows Akali and Shen to enforce the balance of Valoran. This hallowed pursuit has unsurprisingly led the triumvirate to the Fields of Justice.\u003Cbr\u003E\u003Cbr\u003E''The Heart of the Tempest beats eternal...and those beaten remember eternally.''","skins":[{"id":85000,"name":"default","num":0},{"id":85001,"name":"Deadly Kennen","num":1},{"id":85002,"name":"Swamp Master Kennen","num":2},{"id":85003,"name":"Karate Kennen","num":3},{"id":85004,"name":"Kennen M.D.","num":4},{"id":85005,"name":"Arctic Ops Kennen","num":5},{"id":85006,"name":"Blood Moon Kennen","num":6}],"allytips":["You can stun your opponents by inflicting 3 Marks of the Storm upon them.","Lightning Rush can be used to initiate fights with its Energy return component, allowing him to use other abilities afterward.","You can land an initial Mark of the Storm debuff on an opponent with Thundering Shuriken, and then add to it with Electrical Surge."],"enemytips":["Consider playing a bit more cautiously around Kennen when you have a Mark of the Storm debuff. If he hits you with 3 Marks of the Storm, you will get stunned.","Kennen is flimsy by nature - turn and attack him if he gets careless with Lightning Rush."],"tags":["Mage","Marksman"],"info":{"attack":6,"defense":4,"magic":7,"difficulty":4},"stats":{"arm":24.3,"ad":50.544,"aso":-0.0947,"crit":0,"hp":535.72,"mp":200,"mp5":50,"hp5":5.592,"range":550,"ms":335,"mr":30,"lvl":{"arm":3.75,"ad":3.3,"aso":3.4,"crit":0,"hp":79,"mp":0,"mp5":0,"hp5":0.65,"mr":0}},"pass":{"name":"Mark of the Storm","descr":"Kennen's abilities add one stack of Mark of the Storm to their target for 6 seconds. If the target reaches 3 stacks, it is stunned for 1.25 seconds and Kennen gains 25 Energy. \u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#99FF99'\u003EThe stun will be a diminished duration of 0.5 seconds if it occurs again within 6 seconds.\u003C\/font\u003E","img":"Kennen_Passive.png"},"spells":[{"name":"Thundering Shuriken","descr":"Kennen throws a fast moving shuriken towards a location, causing damage and adding a Mark of the Storm to any opponent that it hits.","tooltip":"Throws a shuriken that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to the first enemy it hits.","cost":[60,55,50,45,40],"costType":" Energy","cd":[8,7,6,5,4],"range":[950,950,950,950,950],"key":"KennenQ"},{"name":"Electrical Surge","descr":"Kennen passively deals extra damage and adds a Mark of the Storm to his target every few attacks, and he can activate this ability to damage and add another Mark of the Storm to targets who are already marked.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Every 5 attacks, Kennen deals bonus magic damage equal to {{ e2 }}% of his attack damage and adds a Mark of the Storm to his target.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Sends a surge of electricity through all nearby enemies affected by Mark of the Storm or Slicing Maelstrom, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.","cost":[40,40,40,40,40],"costType":" Energy","cd":[14,12,10,8,6],"range":[725,725,725,725,725],"key":"KennenW"},{"name":"Lightning Rush","descr":"Kennen morphs into a lightning form, enabling him to pass through units. Each enemy unit he touches takes damage and receives a Mark of the Storm.","tooltip":"Kennen doubles his base movement speed and ignores unit collision for 2 seconds, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to any enemy he passes through. Additionally, Kennen will gain {{ e2 }} Armor and Magic Resist for 4 seconds.\u003Cbr\u003E\u003Cbr\u003EKennen gains 40 Energy the first time he passes through an enemy.\u003Cbr\u003ELightning Rush deals half damage to minions.","cost":[100,95,90,85,80],"costType":" Energy","cd":[10,9,8,7,6],"range":[200,200,200,200,200],"key":"KennenE"},{"name":"Slicing Maelstrom","descr":"Kennen summons a storm that strikes at nearby enemy champions for magical damage.","tooltip":"Summons a magical storm for {{ e3 }} seconds that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all enemies near Kennen every {{ e2 }} seconds. Each maelstrom hit applies Mark of the Storm, up to a maximum of 3.\u003Cbr\u003E\u003Cbr\u003ESuccessive maelstrom hits against the same enemy deal an additional {{ e4 }}% damage for each hit they've already suffered from this storm.","cost":[0,0,0],"costType":"No Cost","cd":[120,120,120],"range":[550,550,550],"key":"KennenR"}]}