{"id":133,"key":"Quinn","name":"Quinn","title":"Demacia's Wings","lore":"Quinn and Valor are an elite ranger team. With crossbow and claw, they undertake their nation's most dangerous missions deep within enemy territory, from swift reconnaissance to lethal strikes. The pair's unbreakable bond is deadly on the battlefield, leaving opponents ravaged and riddled with arrows long before they realize who they're fighting: not one, but two Demacian legends.\u003Cbr\u003E\u003Cbr\u003EAs a young girl, Quinn shared a hunger for adventure with her twin brother. They dreamed of becoming knights, but lived a quiet, humble life in the rural borderlands of Demacia. Together they imagined triumphant battles in faraway lands, seizing glory for their king and slaying foes in the name of Demacian justice. When daydreams alone could no longer satisfy their warriors souls, they embarked on daring wilderness adventures in search of true danger. One such quest turned to tragedy when a terrible accident claimed her brother's life. Overcome with grief, Quinn abandoned her dreams of knighthood. \u003Cbr\u003E\u003Cbr\u003EOn the anniversary of her loss, Quinn gathered the courage to return to the scene of the tragedy. To her surprise, she found a wounded Demacian eagle at the site of her brother's death - a rare and beautiful bird long believed extinct. Quinn nursed the fledgling back to health, and as they grew up together, a deep bond formed between the two. She saw the same quality in her newfound friend that had lived within her brother, and so she gave him the name ''Valor.'' The pair found strength in each other, and together they pursued the dream she had once abandoned. \u003Cbr\u003E\u003Cbr\u003EThe Demacian army had never seen heroes like Quinn and Valor. Their deadly skills quickly set them apart from their rank-and-file peers, but many still had their doubts. How could a common-born girl, even with such a powerful creature at her side, forego years of military training? Quinn and Valor proved themselves on one critical mission, tracking down a Noxian assassin who had evaded an entire Demacian battalion. When they brought him to justice, they finally earned the admiration and respect of their nation. The two now serve as living, fighting icons of Demacian strength and perseverance. Together, Quinn and Valor will stand against any threat to their beloved home.\u003Cbr\u003E\u003Cbr\u003E''Most soldiers only rely on their weapons. Few truly rely on each other.''\u003Cbr\u003E -- Quinn","skins":[{"id":133000,"name":"default","num":0},{"id":133001,"name":"Phoenix Quinn","num":1},{"id":133002,"name":"Woad Scout Quinn","num":2},{"id":133003,"name":"Corsair Quinn","num":3},{"id":133004,"name":"Heartseeker Quinn","num":4}],"allytips":["Attacking a ","Vulnerable"," target marked by Valor will put Harrier on cooldown. Quickly consuming Harrier marks will allow you to generate them faster.","Vault is powerful but must be used with caution, as enemies can attack Quinn when she strikes them. Vault can sometimes be used to cross terrain if your back is to a wall.","Use Behind Enemy Lines for traveling very long distances quickly, for farming minions around the map, or for chasing wounded targets."],"enemytips":["After being marked, move away from Quinn so she can't take advantage of it.","Keep tabs on Quinn's position. Behind Enemy Lines can enable Valor to cross the map very quickly and attack you by surprise.","When Quinn is using Behind Enemy Lines, damaging her will end the effect."],"tags":["Marksman","Fighter"],"info":{"attack":9,"defense":4,"magic":2,"difficulty":5},"stats":{"arm":23.38,"ad":54.46,"aso":-0.065,"crit":0,"hp":532.8,"mp":268.8,"mp5":6.972,"hp5":5.424,"range":525,"ms":335,"mr":30,"lvl":{"arm":3.5,"ad":2.41,"aso":3.1,"crit":0,"hp":85,"mp":35,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Harrier","descr":"Valor periodically marks enemies as \u003Cfont color='#FFF673'\u003EVulnerable\u003C\/font\u003E. Quinn's first basic attack against \u003Cfont color='#FFF673'\u003EVulnerable\u003C\/font\u003E targets will deal bonus physical damage.","img":"Quinn_Passive.png"},"spells":[{"name":"Blinding Assault","descr":"Quinn calls Valor to mark an enemy and hinder its vision before damaging all enemies in the immediate area.","tooltip":"Valor flies in a line, marking the first enemy he hits as \u003Cspan class=\"colorFFF673\"\u003EVulnerable\u003C\/span\u003E and reducing its vision radius dramatically for {{ e3 }} seconds. He then deals {{ e1 }} \u003Cspan class=\"colorFF9900\"\u003E(+{{ f2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to all nearby enemies.\u003Cbr\u003E\u003Cbr\u003EIf the primary target is not a champion, it cannot attack for {{ e3 }} seconds.","cost":[50,55,60,65,70],"costType":" Mana","cd":[11,10.5,10,9.5,9],"range":[1025,1025,1025,1025,1025],"key":"QuinnQ"},{"name":"Heightened Senses","descr":"Passively grants Quinn Attack Speed and Movement Speed after she attacks a \u003Cfont color='#FFF673'\u003EVulnerable\u003C\/font\u003E target. Activate to have Valor reveal a large area nearby.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Attacking a \u003Cspan class=\"colorFFF673\"\u003EVulnerable\u003C\/span\u003E target increases Quinn's Attack Speed and Movement Speed by {{ e2 }}% for {{ e1 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Valor reveals a large area nearby for {{ e5 }} seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[50,45,40,35,30],"range":[2100,2100,2100,2100,2100],"key":"QuinnW"},{"name":"Vault","descr":"Quinn dashes to an enemy, dealing physical damage and slowing the target's Movement Speed. Upon reaching the target, she leaps off the target, briefly interrupting it, and lands near her maximum Attack Range away from the target.","tooltip":"Quinn dashes to an enemy, dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage while Valor marks it as \u003Cspan class=\"colorFFF673\"\u003EVulnerable\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003EUpon reaching the target, Quinn leaps off, briefly displacing and slowing it by {{ e1 }}% (diminishing over {{ e3 }} seconds).","cost":[50,50,50,50,50],"costType":" Mana","cd":[12,11,10,9,8],"range":[675,675,675,675,675],"key":"QuinnE"},{"name":"Behind Enemy Lines","descr":"Quinn and Valor team up to fly around at great speed.","tooltip":"Quinn calls down Valor to assist her. After a 2 second channel, they unite, gaining {{ e3 }}% Total Movement Speed and the ability to cast Skystrike by recasting this ability or taking offensive action. Skystrike damages nearby enemies.\u003Cbr\u003E\u003Cbr\u003ETaking champion or turret damage puts Behind Enemy Lines on a 3 second cooldown.","cost":[100,50,0],"costType":" Mana","cd":[0,0,0],"range":[700,700,700],"key":"QuinnR"}]}