{"id":51,"key":"Caitlyn","name":"Caitlyn","title":"the Sheriff of Piltover","lore":"''Go ahead, run. I'll give you a five minute head start.''\u003Cbr\u003E\u003Cbr\u003EOne of the reasons Piltover is known as the City of Progress is because it has an extraordinarily low crime rate. This hasn't always been the case; brigands and thieves of all sorts used to find the city-state an ideal mark for plunder, primarily due to the valuable resources it imports to fuel its techmaturgical research. Some even theorize that it would have fallen long ago to the chaos of organized crime if not for Caitlyn, the Sheriff of Piltover.\u003Cbr\u003E\u003Cbr\u003EBorn the daughter of a wealthy statesman and a pioneering hextech researcher, Caitlyn discovered her natural gift for investigation when, at age 14, her father was assaulted and robbed on his way home. She snuck out of her house that night with her father's rifle and tracked down the muggers from the crime scene. At first, her parents did their best to discourage her from such risky hobbies, but she was incorrigible. Wishing to protect her daughter in the only way she knew how, Caitlyn's mother began outfitting her with techmaturgical devices tailored to her sleuthing needs.\u003Cbr\u003E\u003Cbr\u003ECaitlyn quickly gained notoriety, as she was single-handedly defeating crime in Piltover and had developed into a ravishing beauty as well. She never backed down from a case or a challenge, and she was one of the sharpest shots in the city-state. Her services were soon requested by Demacia to help track down a mysterious outlaw who had begun committing high-profile heists.\u003Cbr\u003E\u003Cbr\u003EThe bandit, who always left a card with an ornate 'C' at the scene of the crime, became Caitlyn's arch-nemesis. To this day, Caitlyn still searches for this cat burglar, and the chase has led her all across Valoran. As she travels, she seeks to hone her skills and gain the influence necessary to track down the only quarry that has managed to evade her.","skins":[{"id":51000,"name":"default","num":0},{"id":51001,"name":"Resistance Caitlyn","num":1},{"id":51002,"name":"Sheriff Caitlyn","num":2},{"id":51003,"name":"Safari Caitlyn","num":3},{"id":51004,"name":"Arctic Warfare Caitlyn","num":4},{"id":51005,"name":"Officer Caitlyn","num":5},{"id":51006,"name":"Headhunter Caitlyn","num":6},{"id":51010,"name":"Lunar Wraith Caitlyn","num":10}],"allytips":["Make use of her Yordle Snap Traps by placing them pre-emptively to ensure that you'll have one off of cooldown during combat.","Avoid using Ace in the Hole in large team melees as it might be blocked by the wrong target.","Fire 90 Caliber Net away from the opponent to close the gap or hop over walls."],"enemytips":["Keep behind allied minions if Caitlyn is harassing you with Piltover Peacemaker (it deals less damage with each subsequent target).","You can intercept Ace in the Hole's missile from hitting an ally if you stand in its path."],"tags":["Marksman"],"info":{"attack":8,"defense":2,"magic":2,"difficulty":6},"stats":{"arm":22.88,"ad":53.66,"aso":0.1,"crit":0,"hp":524.4,"mp":313.7,"mp5":7.4,"hp5":5.674,"range":650,"ms":325,"mr":30,"lvl":{"arm":3.5,"ad":2.18,"aso":4,"crit":0,"hp":80,"mp":35,"mp5":0.55,"hp5":0.55,"mr":0}},"pass":{"name":"Headshot","descr":"Every few basic attacks, or against a target she has trapped or netted, Caitlyn will fire a headshot dealing bonus damage that scales with her critical strike chance. On trapped or netted targets, Caitlyn's Headshot attack range is doubled.","img":"Caitlyn_Headshot.png"},"spells":[{"name":"Piltover Peacemaker","descr":"Caitlyn revs up her rifle for 1 second to unleash a penetrating shot that deals physical damage (deals less damage to subsequent targets).","tooltip":"Revs the rifle for {{ e4 }} second to fire a narrow piercing shot dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage. After hitting any target, it opens into a wider shot that deals {{ e2 }}% less damage. \u003Cbr\u003E\u003Cbr\u003EAlways deals full damage to trap revealed targets.","cost":[50,60,70,80,90],"costType":" Mana","cd":[10,9,8,7,6],"range":[1250,1250,1250,1250,1250],"key":"CaitlynQ"},{"name":"Yordle Snap Trap","descr":"Caitlyn sets a trap to find sneaky yordles. When sprung, the trap reveals and immobilizes the enemy champion for 1.5 seconds.","tooltip":"Sets traps that an enemy Champion can spring, immobilizing them for {{ e1 }} seconds and granting \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E for a short duration.\u003Cbr\u003E\u003Cbr\u003ETraps last for {{ e3 }} seconds. {{ e5 }} traps may be active at once.\u003Cbr\u003E\u003Cbr\u003ETrapped enemies take an additional {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E increased damage from Headshot.","cost":[20,20,20,20,20],"costType":" Mana","cd":[0.5,0.5,0.5,0.5,0.5],"range":[800,800,800,800,800],"key":"CaitlynW"},{"name":"90 Caliber Net","descr":"Caitlyn fires a heavy net to slow her target. The recoil knocks Caitlyn back.","tooltip":"Fires a net, knocking Caitlyn backwards. The net deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slows the first enemy hit by {{ e3 }}% for {{ e2 }} second.","cost":[75,75,75,75,75],"costType":" Mana","cd":[16,14.5,13,11.5,10],"range":[750,750,750,750,750],"key":"CaitlynE"},{"name":"Ace in the Hole","descr":"Caitlyn takes time to line up the perfect shot, dealing massive damage to a single target at a huge range. Enemy champions can intercept the bullet for their ally.","tooltip":"Takes a second to line up the perfect shot on an enemy Champion at up to {{ e2 }} range. The shot deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage, but other enemy Champions can intercept it.\u003Cbr\u003E\u003Cbr\u003EGrants \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E of the target during the channel.","cost":[100,100,100],"costType":" Mana","cd":[90,75,60],"range":[2000,2500,3000],"key":"CaitlynR"}]}