{"id":35,"key":"Shaco","name":"Shaco","title":"the Demon Jester","lore":"Most would say that death isn't funny. It isn't, unless you're Shaco - then it's hysterical. He is Valoran's first fully functioning homicidal comic; he jests until someone dies, and then he laughs. The figure that has come to be known as the Demon Jester is an enigma. No one fully agrees from whence he came, and Shaco never offers any details on his own. A popular belief is that Shaco is not of Runeterra - that he is a thing summoned from a dark and twisted world. Still others believe that he is the demonic manifestation of humanity's dark urges and therefore cannot be reasoned with. The most plausible belief is that Shaco is an assassin for hire, left to his own lunatic devices until his services are needed. Shaco certainly has proven himself to be a cunning individual, evading authorities at every turn who might seek him for questioning for some horrendous, law-breaking atrocity. While such scuttlebutt might reassure the native inhabitants of Valoran, it seems unimaginable that such a malfeasant figure is allowed to remain at large.\u003Cbr\u003E\u003Cbr\u003EWhatever the truth of his history might be, Shaco has joined the League of Legends for reasons only he knows. He is a terrifying figure, typically shunned by both his fellow champions and the media at large. Only the summoners in the Institute of War know why such a creature was allowed into the League, but most Runeterrans suspect it to be a means that allows the power that be to keep an eye on the ever-elusive Shaco. Unsurprisingly, this champion is popular in places where madness can openly reign, such as among the power-hungry summoners of Zaun and Noxus.\u003Cbr\u003E\u003Cbr\u003EWhatever you do, don't tell him you missed the punch line.","skins":[{"id":35000,"name":"default","num":0},{"id":35001,"name":"Mad Hatter Shaco","num":1},{"id":35002,"name":"Royal Shaco","num":2},{"id":35003,"name":"Nutcracko","num":3},{"id":35004,"name":"Workshop Shaco","num":4},{"id":35005,"name":"Asylum Shaco","num":5},{"id":35006,"name":"Masked Shaco","num":6},{"id":35007,"name":"Wild Card Shaco","num":7}],"allytips":["Using Deceive over terrain can help you make a clean escape.","Try getting items with on-hit effects. These will also benefit your Hallucination clone.","Backstab's damage can be increased with increased Critical Damage effects like Infinity Edge."],"enemytips":["If Shaco is doing well early-game, it is worth the investment to place Stealth Wards near his Jungle camps.","If Shaco uses Deceive to enter a fight he won't be able to quickly use it again to get away. Work with your team to quickly focus him down."],"tags":["Assassin"],"info":{"attack":8,"defense":4,"magic":6,"difficulty":9},"stats":{"arm":24.88,"ad":57.58,"aso":-0.1,"crit":0,"hp":582.12,"mp":297.2,"mp5":7.156,"hp5":8.374,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3.5,"ad":3.5,"aso":3,"crit":0,"hp":84,"mp":40,"mp5":0.45,"hp5":0.55,"mr":1.25}},"pass":{"name":"Backstab","descr":"Shaco's basic attack critically strikes for extra damage when striking a unit from behind. Units can't be Backstabbed more than once every few seconds, modified by Shaco's cooldown reduction.","img":"Jester_CarefulStrikes.png"},"spells":[{"name":"Deceive","descr":"Shaco becomes Invisible and teleports to target location. His next attack deals bonus damage.","tooltip":"Shaco teleports nearby and becomes \u003Cspan class=\"color91d7ee\"\u003EInvisible\u003C\/span\u003E for {{ e3 }} seconds. Shaco remains \u003Cspan class=\"color91d7ee\"\u003EInvisible\u003C\/span\u003E even if he uses Jack in the Box or Hallucinate. \u003Cbr\u003E\u003Cbr\u003EHis next basic attack during or shortly after \u003Cspan class=\"color91d7ee\"\u003EInvisibility\u003C\/span\u003E will deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage (\u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E with Backstab) and reduce Deceive's cooldown by {{ f3 }} seconds. \u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"size16 color91d7ee\"\u003E16","cost":[60,60,60,60,60],"costType":" Mana","cd":[14,14,14,14,14],"range":[400,400,400,400,400],"key":"ShacoQ"},{"name":"Jack In The Box","descr":"Shaco creates a hidden animated Jack-in-the-Box. When triggered, it will fear and attack nearby enemies.","tooltip":"Shaco creates a Jack in the Box that hides from view after {{ e5 }} seconds. It pops out when an enemy comes near, making nearby enemies flee very slowly for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EIts attacks deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. It lasts for {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E seconds while hidden or 5 seconds while firing. ","cost":[50,55,60,65,70],"costType":" Mana","cd":[16,16,16,16,16],"range":[500,500,500,500,500],"key":"ShacoW"},{"name":"Two-Shiv Poison","descr":"Shaco's Shivs passively poison targets on hit, slowing their movement speed. He can throw his Shivs to deal damage and poison the target. The thrown Shiv deals bonus damage based on the target's missing Health.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EWhile Two-Shiv Poison is ready to cast, Shaco's basic attacks apply Two-Shiv Poison for {{ e4 }} seconds. It reduces Movement Speed by {{ e2 }}%.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EShaco throws a shiv that applies Two-Shiv Poison for {{ e5 }} seconds and deals magic damage equal to {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E + \u003Cspan class=\"colorFFFFFF\"\u003E{{ f2 }}%\u003C\/span\u003E of the target's missing Health.","cost":[50,55,60,65,70],"costType":" Mana","cd":[8,8,8,8,8],"range":[625,625,625,625,625],"key":"ShacoE"},{"name":"Hallucinate","descr":"Shaco creates an illusion of himself near him, which can attack nearby enemies (Deals reduced damage to turrets).  Upon death, it explodes, spawning three mini Jack in the Boxes and dealing damage to nearby enemies. ","tooltip":"Shaco vanishes briefly and reappears with a clone. The clone lasts up to 18 seconds and detonates when it dies, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and spawning three mini Jack in the Boxes. \u003Cbr\u003E\u003Cbr\u003E\u003Cli\u003EMini boxes deal {{ e6 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage, make enemies flee for {{ e7 }} second(s), and trigger together. \u003Cbr\u003E\u003Cbr\u003EClone deals {{ e8 }}% of Shaco's damage and receives {{ e2 }}% increased damage.\u003C\/li\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EThe clone can be controlled by holding the alt key and using the right mouse button or by reactivating this ability.\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[25000,25000,25000],"key":"ShacoR"}]}