{"id":57,"key":"Maokai","name":"Maokai","title":"the Twisted Treant","lore":"''All around me are empty husks, soulless and unafraid... but I will bring them fear.''\u003Cbr\u003E\u003Cbr\u003EMaokai is a rageful, towering treant who fights the unnatural horrors of the Shadow Isles. He was twisted into a force of vengeance after a magical cataclysm destroyed his home, surviving undeath only through the waters of life infused within his heartwood. Once a peaceful nature spirit, Maokai now furiously battles to banish the scourge of unlife from the Shadow Isles and restore his home to its former beauty.","skins":[{"id":57000,"name":"default","num":0},{"id":57001,"name":"Charred Maokai","num":1},{"id":57002,"name":"Totemic Maokai","num":2},{"id":57003,"name":"Festive Maokai","num":3},{"id":57004,"name":"Haunted Maokai","num":4},{"id":57005,"name":"Goalkeeper Maokai","num":5},{"id":57006,"name":"Meowkai","num":6},{"id":57007,"name":"Victorious Maokai","num":7}],"allytips":["Saplings can be tossed into brush or over terrain to gain line of sight on your enemies.","Save Vengeful Maelstrom for after your opponents have fully committed to a fight.","Ranking up Arcane Smash and Twisted Advance gives Maokai powerful crowd control moves, while ranking up Sapling Toss will improve your damage output and ability to farm."],"enemytips":["Saplings can be avoided by placing friendly minions between yourself and them. You can also just outrun them if you're fast.","Vengeful Maelstrom does more damage if you attack Maokai or his allies within the area of effect. Stay out of the area to avoid the damage.","Maokai will avoid taking damage while he's using Twisted Advance, so don't waste your spells."],"tags":["Tank","Mage"],"info":{"attack":3,"defense":8,"magic":6,"difficulty":3},"stats":{"arm":28.72,"ad":63.544,"aso":-0.1,"crit":0,"hp":572.2,"mp":377.28,"mp5":7.206,"hp5":7,"range":125,"ms":335,"mr":32.1,"lvl":{"arm":4,"ad":3.3,"aso":2.125,"crit":0,"hp":90,"mp":43,"mp5":0.45,"hp5":0.75,"mr":1.25}},"pass":{"name":"Sap Magic","descr":"Each time a spell is cast near Maokai he draws energy from it, gaining a charge of Magical Sap. When Maokai has 5 charges his next basic attack heals him for a percentage of his max Health.","img":"Maokai_Passive.png"},"spells":[{"name":"Arcane Smash","descr":"Maokai knocks back nearby enemies with a shockwave, dealing magic damage and slowing them.","tooltip":"Maokai releases an arcane shockwave. Nearby enemies are knocked back and all affected enemies take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are slowed by {{ e3 }}% for {{ e4 }} seconds.","cost":[45,45,45,45,45],"costType":" Mana","cd":[8,7.5,7,6.5,6],"range":[600,600,600,600,600],"key":"MaokaiQ"},{"name":"Twisted Advance","descr":"Maokai dissolves into a cloud of arcane energies. He regrows near a target enemy, dealing damage and rooting it in place.","tooltip":"Maokai transforms into a cloud of arcane energy that quickly travels to a target enemy, roots it for {{ e2 }} second(s) and deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E% of the target's maximum health as magic damage (Max: {{ e3 }} to minions and monsters).","cost":[75,75,75,75,75],"costType":" Mana","cd":[13,12,11,10,9],"range":[525,525,525,525,525],"key":"MaokaiW"},{"name":"Sapling Toss","descr":"Maokai flings a sapling that deals area damage on impact. The sapling then wards the nearby area. When enemies approach, the sapling attacks enemies with an arcane blast.","tooltip":"Maokai flings a sapling that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage on impact.\u003Cbr\u003E\u003Cbr\u003EThe sapling wards the nearby area, and will chase enemies that approach, exploding to deal {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage and slow enemies hit by {{ e5 }}% for {{ e3 }} second(s). Saplings last for {{ e4 }} seconds.","cost":[60,70,80,90,100],"costType":" Mana","cd":[12,12,12,12,12],"range":[1100,1100,1100,1100,1100],"key":"MaokaiE"},{"name":"Vengeful Maelstrom","descr":"Maokai shields his allies by drawing power from hostile spells and attacks, reducing non-tower damage done to allied champions in the area. When Maokai ends the effect, he unleashes the absorbed energy to deal damage to enemies within the vortex.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EToggle: \u003C\/span\u003EMaokai surrounds himself with a magical vortex that protects him and allied champions by reducing damage from non-turret sources by {{ e1 }}% for up to {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EMaokai can end the effect to release the stored energy, dealing {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E (+2 per damage absorbed) magic damage to enemies within the vortex. Maokai can store up to {{ e5 }} bonus damage.","cost":[40,40,40],"costType":" Mana, {{ e4 }} Mana Per Second","cd":[60,50,40],"range":[500,500,500],"key":"MaokaiR"}]}