{"id":79,"key":"Gragas","name":"Gragas","title":"the Rabble Rouser","lore":"The only thing more important to Gragas than fighting is drinking. His unquenchable thirst for stronger ale has led him in search of the most potent and unconventional ingredients to toss in his still. Impulsive and unpredictable, this rowdy carouser loves cracking kegs as much as cracking heads. Thanks to his strange brews and temperamental nature, drinking with Gragas is always a risky proposition.\u003Cbr\u003E\u003Cbr\u003EGragas has an eternal love of good drink, but his massive constitution prevented him from reaching a divine state of intoxication. One night, when he had drained all the kegs and was left wanting, Gragas was struck by a thought rather than the usual barstool: why couldn't he brew himself something that would finally get him truly drunk? It was then that he vowed to create the ultimate ale.\u003Cbr\u003E\u003Cbr\u003EGragas' quest eventually brought him to the Freljord, where the promise of acquiring the purest arctic water for his recipe led him into uncharted glacial wastes. While lost in an unyielding blizzard, Gragas stumbled upon a great howling abyss. There he found it: a flawless shard of ice unlike anything he had ever seen. Not only did this unmelting shard imbue his lager with incredible properties, but it also had a handy side effect - it kept the mixture chilled at the perfect serving temperature.\u003Cbr\u003E\u003Cbr\u003EUnder the spell of his new concoction, Gragas headed for civilization, eager to share the fermented fruits of his labor. As fate would have it, the first gathering to catch Gragas' bleary eyes would shape the future of the Freljord. He blundered into a deteriorating negotiation between two tribes discussing an alliance with Ashe. Though Ashe welcomed a break in the tension, the other warriors bristled at the intrusion and hurled insults at the drunken oaf. True to his nature, Gragas replied with a diplomatic headbutt, setting off a brawl matched only in the legends of the Freljord.\u003Cbr\u003E\u003Cbr\u003EWhen the fallen from that great melee finally awoke, Ashe proposed a friendly drink as an alternative to fighting. With their tempers doused in suds, the two tribes, formerly on the brink of war, bonded over a common love of Gragas' brew. Although strife was averted and Gragas hailed a hero, he still had not achieved his dream of drunken blissfulness. So once more, he set off to wander the tundra in search of ingredients for Runeterra's perfect pint.\u003Cbr\u003E\u003Cbr\u003E''Now this'll put hair on your chest!''\u003Cbr\u003E -- Gragas","skins":[{"id":79000,"name":"default","num":0},{"id":79001,"name":"Scuba Gragas","num":1},{"id":79002,"name":"Hillbilly Gragas","num":2},{"id":79003,"name":"Santa Gragas","num":3},{"id":79004,"name":"Gragas, Esq.","num":4},{"id":79005,"name":"Vandal Gragas","num":5},{"id":79006,"name":"Oktoberfest Gragas","num":6},{"id":79007,"name":"Superfan Gragas","num":7},{"id":79008,"name":"Fnatic Gragas","num":8},{"id":79009,"name":"Gragas Caskbreaker","num":9}],"allytips":["The damage reduction from Drunken Rage is applied when you start drinking, try to use it when you see damage coming your way.","Try to knock enemies back into your towers with Explosive Cask.","Try to combo Body Slam with Explosive Cask to set up kills for your team."],"enemytips":["Gragas can knock everybody away with his ultimate. Be careful that you don't get knocked into him or, worse, an enemy tower.","Body Slam is on a very low cooldown, making it difficult to pursue Gragas. Don't overextend yourself chasing him."],"tags":["Fighter","Mage"],"info":{"attack":4,"defense":7,"magic":6,"difficulty":5},"stats":{"arm":29.05,"ad":61.38,"aso":-0.04,"crit":0,"hp":583.52,"mp":400,"mp5":6,"hp5":5.5,"range":125,"ms":330,"mr":32.1,"lvl":{"arm":3.6,"ad":3.5,"aso":2.05,"crit":0,"hp":89,"mp":47,"mp5":0.8,"hp5":0.5,"mr":1.25}},"pass":{"name":"Happy Hour","descr":"On ability use, Gragas takes a drink restoring 6% of his max Health. This effect can only happen every 8 seconds.","img":"GragasPassiveHeal.png"},"spells":[{"name":"Barrel Roll","descr":"Gragas rolls his cask to a location, which can be activated to explode or will explode on its own after 4 seconds. Enemies struck by the blast have their Movement Speed slowed.","tooltip":"Gragas rolls his cask to a location. When reactivated, or after {{ e4 }} seconds, the cask will explode, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and slowing their movement speed by {{ e2 }}% for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EThe damage and slow amount increase as the cask ferments, up to {{ e6 }}% after {{ e5 }} seconds. Deals {{ e7 }}% damage to minions.","cost":[60,65,70,75,80],"costType":" Mana","cd":[11,10,9,8,7],"range":[850,850,850,850,850],"key":"GragasQ"},{"name":"Drunken Rage","descr":"Gragas guzzles down brew from his cask for 1 second. After finishing, he becomes drunkenly empowered, dealing magic damage to all nearby enemies on his next basic attack and reducing damage received.","tooltip":"Gragas guzzles down his brew, taking {{ e1 }}% reduced damage for {{ e5 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAfter finishing his drink, his next basic attack deals magic damage to nearby enemies equal to {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E plus {{ e2 }}% of their max Health (max {{ e4 }} vs monsters).","cost":[30,30,30,30,30],"costType":" Mana","cd":[8,7,6,5,4],"range":[20,20,20,20,20],"key":"GragasW"},{"name":"Body Slam","descr":"Gragas charges to a location and collides with the first enemy unit he comes across, dealing damage to all nearby enemy units and stunning them.","tooltip":"Gragas charges forward, colliding with the first enemy unit. He deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in the area and bumps them back, stunning them for {{ e2 }} second.\u003Cbr\u003E\u003Cbr\u003EBody Slam's Cooldown is reduced by {{ f1 }} seconds if Gragas collides with a unit.","cost":[50,50,50,50,50],"costType":" Mana","cd":[16,15,14,13,12],"range":[600,600,600,600,600],"key":"GragasE"},{"name":"Explosive Cask","descr":"Gragas hurls his cask to a location, dealing damage and knocking back enemies caught in the blast radius.","tooltip":"Gragas hurls his cask, causing it to explode when it lands. Enemies hit take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are knocked away from the explosion.","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[1000,1000,1000],"key":"GragasR"}]}