{"id":40,"key":"Janna","name":"Janna","title":"the Storm's Fury","lore":"There are those sorcerers who give themselves over to the primal powers of nature, forgoing the learned practice of magic. Such a sorceress is Janna, who first learned magic as an orphan growing up amidst the chaos that is the city-state of Zaun. Janna eked out what living she could on the streets. Life was tough and dangerous for the beautiful young girl, and she survived by her wits, and by stealing when wits weren't enough. The rampant magic that characterizes Zaun was the first and most alluring tool which Janna realized could both protect and elevate her. Janna discovered that she had an affinity for a particular type of magic - the elemental magic of air. She mastered her studies of air magic in a matter of months, almost as if she was born of it. Janna went from a street vagrant to an avatar of the air virtually overnight, stunning and surpassing those who taught her. Such a rapid ascension also changed her physical appearance, giving her an otherworldly look.\u003Cbr\u003E\u003Cbr\u003ESeeking to right the injustice in the world (particularly the insanity that has become the city of Zaun), Janna has brought her talents to the League. She is a voice for the regulation of magical experimentation and a supporter of the development of techmaturgy, making her an indirect ally of the city-state of Piltover and the amazing techmaturgical minds that live there. Janna is also a new favorite of the League's many fans. She is often the center of attention at functions, fan appreciation days, and other celebratory events. There is something untouchable about Janna, however, and her affections can change as quickly as the wind.\u003Cbr\u003E\u003Cbr\u003EDo not be captivated by Janna's beauty. Like the wind, she is one gust away from terrible destruction.","skins":[{"id":40000,"name":"default","num":0},{"id":40001,"name":"Tempest Janna","num":1},{"id":40002,"name":"Hextech Janna","num":2},{"id":40003,"name":"Frost Queen Janna","num":3},{"id":40004,"name":"Victorious Janna","num":4},{"id":40005,"name":"Forecast Janna","num":5},{"id":40006,"name":"Fnatic Janna","num":6},{"id":40007,"name":"Star Guardian Janna","num":7}],"allytips":["Eye of the Storm can be used on allied turrets.","Quickly firing a Howling Gale without the charge up can be used to heavily disable the other team.","Timing Janna's ultimate can push enemies away from a wounded ally or even separate enemies."],"enemytips":["Save an interrupt ability for when Janna uses her ultimate.","Listen for the charge up sound on Howling Gale in case Janna is trying to hit you with it from off screen or from brush.","Janna's at her strongest when buffing another ally. If you can harass her ally, it will weaken her ability to fight you."],"tags":["Support","Mage"],"info":{"attack":3,"defense":5,"magic":7,"difficulty":7},"stats":{"arm":19.384,"ad":51.956,"aso":0,"crit":0,"hp":487.04,"mp":409.52,"mp5":11.5,"hp5":5.424,"range":475,"ms":335,"mr":30,"lvl":{"arm":3.8,"ad":2.95,"aso":2.61,"crit":0,"hp":78,"mp":64,"mp5":0.4,"hp5":0.55,"mr":0}},"pass":{"name":"Tailwind","descr":"Increases the Movement Speed of all allied champions moving towards Janna by 8%.","img":"Janna_Tailwind.png"},"spells":[{"name":"Howling Gale","descr":"By creating a localized change in pressure and temperature, Janna is able to create a small storm that grows in size with time. She can activate the spell again to release the storm. On release this storm will fly towards the direction it was cast in, dealing damage and knocking away any enemies in its path.","tooltip":"Summons a whirlwind, which deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in its path and knocks them into the air for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EThe whirlwind can be charged for up to {{ e6 }} seconds. For each second it charges, it deals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E bonus damage, knocks up for an additional {{ e5 }} seconds, and travels {{ e3 }}% further.\u003Cbr\u003E\u003Cbr\u003EActivate again to release the whirlwind early.","cost":[90,105,120,135,150],"costType":" Mana","cd":[14,13,12,11,10],"range":[1700,1700,1700,1700,1700],"key":"JannaQ"},{"name":"Zephyr","descr":"Janna summons an air elemental that passively increases her Movement Speed and enables her to pass through units. She may also activate this ability to deal damage and slow an enemy's Movement Speed. The passive is lost while this ability is on cooldown.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EIncreases Movement Speed by {{ e1 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }}%)\u003C\/span\u003E and allows movement through units.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EDeals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to an enemy and slows their Movement Speed by {{ e3 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }}%)\u003C\/span\u003E for {{ e4 }} seconds. Passive benefit is lost while Zephyr is on cooldown.","cost":[40,50,60,70,80],"costType":" Mana","cd":[12,12,12,12,12],"range":[600,600,600,600,600],"key":"JannaW"},{"name":"Eye Of The Storm","descr":"Janna conjures a defensive gale that shields an ally champion or turret from incoming damage and increases their Attack Damage.","tooltip":"Shields an allied Champion or turret for {{ e3 }} seconds. The shield absorbs up to {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage and grants {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Attack Damage until it breaks.","cost":[70,80,90,100,110],"costType":" Mana","cd":[10,10,10,10,10],"range":[800,800,800,800,800],"key":"JannaE"},{"name":"Monsoon","descr":"Janna surrounds herself in a magical storm, throwing enemies back. After the storm has settled, soothing winds heal nearby allies while the ability is active.","tooltip":"Summons forth the might of the wind to knock surrounding enemies back and restores {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Health to nearby allies each second for {{ e3 }} seconds.","cost":[100,100,100],"costType":" Mana","cd":[150,135,120],"range":[725,725,725],"key":"JannaR"}]}