{"id":36,"key":"DrMundo","name":"Dr. Mundo","title":"the Madman of Zaun","lore":"''Beware the Madman of Zaun. In his eyes, you are already dead''\u003Cbr\u003E\u003Cbr\u003EIt is said that the man now known as Dr. Mundo was born without any sort of conscience. Instead, he had an unquenchable desire to inflict pain through experimentation. By the time he was five, most of the pets in the Zaun neighborhood where Mundo grew up had gone missing. By his teenage years, his parents were nowhere to be found. By the time he had legally acquired his license to practice medicine, he had been acquitted of thirty-eight separate charges of murder by the Zaun authorities; the lack of evidence made prosecution impossible.\u003Cbr\u003E\u003Cbr\u003EDr. Mundo has become equal parts serial killer and mad scientist, though no one is entirely sure how his butchery qualifies as science. However, he has made tremendous strides in mapping the pain response in the human brain and body, going so far as being able to suppress it, even in the most excruciating of circumstances. He has also tapped into the primal parts of the brain through chemistry, learning how to enhance aggression and adrenaline, as well as dulling conscience and the survival instinct. In short, Dr. Mundo has spent his life creating the perfect science-enhanced killer, an accomplishment that Noxus noticed. The empire was impressed by his ambition, and recruited his talents to initiate a relationship between the two nations.\u003Cbr\u003E\u003Cbr\u003EHe continues his experiments to this day, even using himself as an experimental subject, as evidenced by his disfigured appearance and his... unique manner of speaking. There are rumors that the High Command in Noxus has given him free reign to pursue his life's work in his spare time.","skins":[{"id":36000,"name":"default","num":0},{"id":36001,"name":"Toxic Dr. Mundo","num":1},{"id":36002,"name":"Mr. Mundoverse","num":2},{"id":36003,"name":"Corporate Mundo","num":3},{"id":36004,"name":"Mundo Mundo","num":4},{"id":36005,"name":"Executioner Mundo","num":5},{"id":36006,"name":"Rageborn Mundo","num":6},{"id":36007,"name":"TPA Mundo","num":7},{"id":36008,"name":"Pool Party Mundo","num":8},{"id":36009,"name":"El Macho Mundo","num":9}],"allytips":["A well-timed Sadism can bait enemy champions into attacking you even when they lack the damage to finish you.","Spirit Visage will increase the healing done by your ultimate and lower cooldowns on all of your abilities.","Cleavers are a powerful tool for killing neutral monsters. Instead of returning to base, farm neutral monsters until your ultimate can heal you."],"enemytips":["Try to coordinate high-damage abilities with your allies right after Dr. Mundo uses his ultimate, but if you're unable to kill him quickly with burst he will heal through the damage.","Try casting Ignite when Dr. Mundo uses Sadism to negate a large portion of its healing."],"tags":["Fighter","Tank"],"info":{"attack":5,"defense":7,"magic":6,"difficulty":5},"stats":{"arm":26.88,"ad":61.27,"aso":0,"crit":0,"hp":582.52,"mp":0,"mp5":0,"hp5":7.76,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3,"aso":2.8,"crit":0,"hp":89,"mp":0,"mp5":0,"hp5":0.75,"mr":1.25}},"pass":{"name":"Adrenaline Rush","descr":"Dr. Mundo regenerates 0.3% of his maximum Health each second.","img":"DrMundo_AdrenalineRush2.png"},"spells":[{"name":"Infected Cleaver","descr":"Dr. Mundo hurls his cleaver, dealing damage equal to a portion of his target's current Health and slowing them for a short time. Dr. Mundo delights in the suffering of others, so he is returned half of the Health cost when he successfully lands a cleaver (increased to the full Health cost on killing blows).","tooltip":"Dr. Mundo hurls his cleaver, dealing magic damage equal to {{ e2 }}% of the target's current Health and slowing them by {{ e4 }}% for {{ e5 }} seconds. {{ e1 }} damage minimum, max {{ e6 }} damage to Monsters.\u003Cbr\u003E\u003Cbr\u003EHalf of the Health cost is refunded if the cleaver hits an enemy. The full Health cost is refunded if the cleaver kills an enemy.","cost":[0,0,0,0,0],"costType":" Health","cd":[4,4,4,4,4],"range":[975,975,975,975,975],"key":"DrMundoQ"},{"name":"Burning Agony","descr":"Dr. Mundo drains his Health to reduce the duration of disables and deal continual damage to nearby enemies.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EToggle: \u003C\/span\u003EDr. Mundo deals {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies per second, and reduces the duration of disables on Dr. Mundo by {{ e2 }}%.","cost":[0,0,0,0,0],"costType":" Health Per Sec","cd":[4,4,4,4,4],"range":[325,325,325,325,325],"key":"DrMundoW"},{"name":"Masochism","descr":"Masochism deals bonus damage on Dr. Mundo's next basic attack and increases Attack Damage by a flat amount for 5 seconds. In addition, Dr. Mundo also gains an additional amount of Attack Damage for each percentage of Health he is missing.","tooltip":"Dr. Mundo deals an additional \u003Cspan class=\"colorFF3300\"\u003E{{ f1 }}\u003C\/span\u003E physical damage ({{ e6 }}% of max health) on his next basic attack and gains {{ e1 }} Attack Damage for {{ e4 }} seconds. Dr. Mundo gains an additional +{{ e3 }} Attack Damage (\u003Cspan class=\"colorFF3300\"\u003E{{ f2 }}\u003C\/span\u003E) for each percent of his Health he is missing.","cost":[0,0,0,0,0],"costType":" Health","cd":[6,6,6,6,6],"range":[300,300,300,300,300],"key":"DrMundoE"},{"name":"Sadism","descr":"Dr. Mundo sacrifices a portion of his Health for increased Movement Speed and drastically increased Health Regeneration.","tooltip":"Dr. Mundo regenerates \u003Cspan class=\"colorCC3300\"\u003E{{ f1 }}\u003C\/span\u003E Health ({{ e1 }}% of max health) over {{ e2 }} seconds. Additionally, he gains {{ e3 }}% movement speed during this time.","cost":[0,0,0],"costType":"% of Current Health","cd":[100,85,70],"range":[20,20,20],"key":"DrMundoR"}]}