{"id":121,"key":"Khazix","name":"Kha'Zix","title":"the Voidreaver","lore":"A vicious Void predator, Kha'Zix infiltrated Valoran to devour the land's most promising creatures. With each kill he absorbs his prey's strength, evolving to grow more powerful. Kha'Zix hungers most to conquer and consume Rengar, the one beast he considers his equal.\u003Cbr\u003E\u003Cbr\u003EWhen Kha'Zix crossed over into this world, he was fragile and ravenous. The animals he first encountered were too small to fuel the rapid evolution he craved. Kha'Zix focused his hunger on the most dangerous creatures he could find, risking his life to satisfy his need. With each kill he feasted and changed, becoming a stronger, faster predator. Kha'Zix soon chased his prey with unrestrained aggression, believing he was unstoppable. One day, while savoring a fresh kill, the predator became the prey. From cover a creature pounced in a blur of fangs and steel, tackling him to the ground. It roared in his face slashing and clawing, and Kha'Zix felt his blood spill for the first time. Screeching in fury, he sliced at the brute's eye driving it back. They fought from sunset to sunrise. Finally, near death, they reluctantly separated. As his wounds closed, Kha'Zix burned with anticipation at the idea of devouring one who could match the Void's strength. He resumed his search for powerful prey with renewed vigor. Someday, Kha'Zix will feast on Rengar.\u003Cbr\u003E\u003Cbr\u003E''Kill. Consume. Adapt.''\u003Cbr\u003E-- Kha'Zix","skins":[{"id":121000,"name":"default","num":0},{"id":121001,"name":"Mecha Kha'Zix","num":1},{"id":121002,"name":"Guardian of the Sands Kha'Zix","num":2},{"id":121003,"name":"Death Blossom Kha'Zix","num":3}],"allytips":["Enemies are considered isolated if they have no allies within a short distance. The damage of Taste Their Fear is massively increased against these targets.","Unseen Threat activates when Kha'Zix cannot be seen by the enemy team. Reactivate by using brush or Void Assault. Don't forget to apply Unseen Threat by autoattacking enemy champions.","Kha'Zix has a great deal of freedom to choose where and when to fight. Pick your battles carefully to succeed."],"enemytips":["Taste Their Fear deals bonus damage to targets that are isolated. Gain an advantage by fighting near allied minions, champions, or turrets.","Leap and Void Assault have long cooldowns. Kha'Zix is very vulnerable when these are not available."],"tags":["Assassin","Fighter"],"info":{"attack":9,"defense":4,"magic":3,"difficulty":6},"stats":{"arm":27,"ad":55.21,"aso":-0.065,"crit":0,"hp":572.8,"mp":327.2,"mp5":7.59,"hp5":7.51,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3,"ad":3.1,"aso":2.7,"crit":0,"hp":85,"mp":40,"mp5":0.5,"hp5":0.75,"mr":1.25}},"pass":{"name":"Unseen Threat","descr":"When Kha'Zix is not visible to the enemy team, he gains Unseen Threat, causing his next basic attack against an enemy Champion to deal bonus magic damage and slow.","img":"Khazix_P.png"},"spells":[{"name":"Taste Their Fear","descr":"Deals physical damage to the target. Damage increased on \u003Cfont color='#FFF673'\u003EIsolated\u003C\/font\u003E targets. If he chooses to \u003Cfont color='#00DD33'\u003EEvolve Reaper Claws\u003C\/font\u003E, this refunds a percent of it's cooldown against \u003Cfont color='#FFF673'\u003EIsolated\u003C\/font\u003E targets. Kha'Zix also gains increased range on his basic attacks and Taste Their Fear.","tooltip":"Deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage. If the target is \u003Cspan class=\"colorFFF673\"\u003EIsolated\u003C\/span\u003E, the damage is increased by {{ e2 }}% (\u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color00DD33\"\u003EEvolved Reaper Claws:\u003C\/span\u003E Increases the range of Taste Their Fear and Kha'Zix's basic attacks by {{ e3 }}. If target is \u003Cspan class=\"colorFFF673\"\u003EIsolated\u003C\/span\u003E, refunds {{ e4 }}% of Taste Their Fear's cooldown.","cost":[20,20,20,20,20],"costType":" Mana","cd":[4,4,4,4,4],"range":[325,325,325,325,325],"key":"KhazixQ"},{"name":"Void Spike","descr":"Kha'Zix fires exploding spikes that deal physical damage to enemies hit. Kha'Zix is healed if he is also within the explosion radius. If he chooses to \u003Cfont color='#00DD33'\u003EEvolve Spike Racks\u003C\/font\u003E, Void Spike now fires three spikes in a cone, slow enemies hit, and reveals enemy champions hit for 2 seconds. \u003Cfont color='#FFF673'\u003EIsolated\u003C\/font\u003E targets are slowed for extra.","tooltip":"Fires exploding spikes, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to enemies hit ({{ e5 }}% bonus damage to monsters). Heals Kha'Zix for {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E if he is within the explosion radius.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color00DD33\"\u003EEvolved Spike Racks:\u003C\/span\u003E Void Spike fires three spikes in a cone and slows targets hit by {{ e3 }}% for {{ e4 }} seconds. Reveals enemy champions hit for 2 seconds. \u003Cspan class=\"colorFFF673\"\u003EIsolated\u003C\/span\u003E targets are slowed for {{ e7 }}% instead.","cost":[55,60,65,70,75],"costType":" Mana","cd":[9,9,9,9,9],"range":[1000,1000,1000,1000,1000],"key":"KhazixW"},{"name":"Leap","descr":"Kha'Zix leaps to an area, dealing physical damage upon landing. If he chooses to \u003Cfont color='#00DD33'\u003EEvolve Wings\u003C\/font\u003E, Leap's range increases by 200 and the cooldown resets on champion kill or assist.","tooltip":"Leaps to target area, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color00DD33\"\u003EEvolved Wings:\u003C\/span\u003E Increases Leap's range by 200, and the cooldown resets on champion kill or assist.","cost":[50,50,50,50,50],"costType":" Mana","cd":[20,18,16,14,12],"range":[700,700,700,700,700],"key":"KhazixE"},{"name":"Void Assault","descr":"Each rank allows Kha'Zix to evolve one of his abilities, giving it a unique additional effect. When activated, Kha'Zix becomes \u003Cfont color='#91d7ee'\u003EInvisible\u003C\/font\u003E, triggering Unseen Threat and increasing Movement Speed. If he chooses to \u003Cfont color='#00DD33'\u003EEvolve Adaptive Cloaking\u003C\/font\u003E, while out of combat Kha'Zix also passively gains Void Assault upon entering a new brush.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Ranking up Void Assault allows Kha'Zix to evolve one of his abilities.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Kha'Zix becomes \u003Cspan class=\"color91d7ee\"\u003EInvisible\u003C\/span\u003E for {{ e1 }} seconds and activates Unseen Threat. While \u003Cspan class=\"color91d7ee\"\u003EInvisible\u003C\/span\u003E, he gains {{ e3 }}% movement speed and ignores unit collision. Void Assault can be cast a second time within {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color00DD33\"\u003EEvolved Adaptive Cloaking:\u003C\/span\u003E While out of combat, Kha'Zix also passively gains Void Assault for {{ e5 }} seconds in brush. This persists for up to {{ e1 }} seconds after exiting the brush ({{ f1 }} second per brush cooldown).\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"size16 color91d7ee\"\u003E16","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[25000,25000,25000],"key":"KhazixR"}]}