{"id":427,"key":"Ivern","name":"Ivern","title":"the Green Father","lore":"Ivern Bramblefoot, known to many as the Green Father, is a peculiar half man, half tree who roams Runeterra's forests, cultivating life everywhere he goes. He knows the secrets of the natural world, and holds deep friendships with all things that grow, fly, and scuttle. Ivern wanders the wilderness, imparting strange wisdom to any he meets, enriching the forests, and occasionally entrusting loose-lipped butterflies with his secrets.","skins":[{"id":427000,"name":"default","num":0},{"id":427001,"name":"Candy King Ivern","num":1}],"allytips":["Try to help allies follow up a good Rootcaller hit with Triggerseed!","Use Brushmaker to set up future ambush spots!","Daisy can block skillshots and slow down enemies. Use her to peel for your teammates!"],"enemytips":["Ivern can be deceptively slippery. Be careful chasing him too far.","Ivern's brush has a long duration. Watch out for ambushes!","Be careful when fighting Ivern alone if he has Daisy ready to help!"],"tags":["Support","Mage"],"info":{"attack":3,"defense":5,"magic":7,"difficulty":7},"stats":{"arm":22,"ad":50,"aso":-0.03,"crit":0,"hp":580,"mp":450,"mp5":6,"hp5":6.9,"range":125,"ms":330,"mr":32.1,"lvl":{"arm":3.5,"ad":3,"aso":3.4,"crit":0,"hp":90,"mp":60,"mp5":0.75,"hp5":0.85,"mr":1.25}},"pass":{"name":"Friend of the Forest","descr":"Ivern cannot attack or be attacked by non-epic monsters. Ivern can create magical groves on jungle camps which grow over time. When the grove is fully grown, Ivern may free the monsters to recieve gold and experience. After level 5 Ivern can share jungle buffs with allies.","img":"IvernP.png"},"spells":[{"name":"Rootcaller","descr":"Ivern conjures a vine, dealing damage and rooting enemy targets hit. Ivern's allies can dash to the rooted target.","tooltip":"Ivern conjures a vine dealing {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E magic damage and rooting the first enemy hit for {{ e1 }} second(s). Allies can click on rooted enemies to dash into attack range.","cost":[60,60,60,60,60],"costType":" Mana","cd":[14,13,12,11,10],"range":[1075,1075,1075,1075,1075],"key":"IvernQ"},{"name":"Brushmaker","descr":"In brush, Ivern's attacks are ranged and deal bonus magic damage. Ivern can activate this ability to create a patch of brush.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E In brush, Ivern's attacks are ranged and deal {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E bonus magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Ivern grows a patch of brush for {{ e1 }} seconds. For 3 seconds the area in and around the brush is revealed.","cost":[30,30,30,30,30],"costType":" Mana","cd":[0.5,0.5,0.5,0.5,0.5],"range":[1650,1650,1650,1650,1650],"key":"IvernW"},{"name":"Triggerseed","descr":"Ivern places a shield on an ally which explodes after a short duration slowing and damaging enemies.","tooltip":"Ivern shields an ally, absorbing up to {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f3 }})\u003C\/span\u003E damage. After 2 seconds, the shield bursts dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f4 }})\u003C\/span\u003E magic damage and slowing enemies by {{ e3 }}% for {{ e4 }} seconds.","cost":[70,70,70,70,70],"costType":" Mana","cd":[12,11,10,9,8],"range":[750,750,750,750,750],"key":"IvernE"},{"name":"Daisy!","descr":"Ivern summons his Sentinel friend Daisy to fight with him. Daisy will send out a shockwave if she attacks the same champion three times in a row.","tooltip":"Ivern summons his sentinel friend Daisy. If Daisy attacks the same champion three times in a row, she will create a shockwave knocking enemies up for 1 second (3s cooldown). Daisy gains additional damage and defenses based on Ivern's Ability Power.\u003Cbr\u003E\u003Cbr\u003ERecasting this ability will direct Daisy to a new target or position.","cost":[100,100,100],"costType":" Mana","cd":[160,140,120],"range":[25000,25000,25000],"key":"IvernR"}]}