{"id":28,"key":"Evelynn","name":"Evelynn","title":"the Widowmaker","lore":"Swift and lethal, Evelynn is one of the most deadly - and expensive - assassins in all of Runeterra. Able to merge with the shadows at will, she patiently stalks her prey, waiting for the right moment to strike. While Evelynn is clearly not entirely human, and her heritage remains unclear, it is believed that she hails from the Shadow Isles - though her link with that tortured realm remains shrouded in mystery.","skins":[{"id":28000,"name":"default","num":0},{"id":28001,"name":"Shadow Evelynn","num":1},{"id":28002,"name":"Masquerade Evelynn","num":2},{"id":28003,"name":"Tango Evelynn","num":3},{"id":28004,"name":"Safecracker Evelynn","num":4}],"allytips":["While Camouflaged, pay attention to when you are (near) being detected by enemy champions. This is identified by the glowing yellow and red eyes over nearby enemy champions.","Try to use Dark Frenzy after your opponents have used up their slows.","Evelynn can be built focusing on either Attack Damage which provides more sustained damage or Ability Power which provides more burst damage. A balance of both may be ideal."],"enemytips":["Purchasing Control Wards can help you detect Evelynn's location in order to prepare for her ambushes.","Evelynn is vulnerable to slows once she uses her Movement Speed boost, Dark Frenzy.","If you suspect Evelynn is about to ambush one of your teammates, let them know by pinging the minimap and typing in chat."],"tags":["Assassin","Mage"],"info":{"attack":4,"defense":2,"magic":7,"difficulty":10},"stats":{"arm":26.5,"ad":53.88,"aso":0,"crit":0,"hp":531.2,"mp":315.6,"mp5":8.108,"hp5":9.824,"range":125,"ms":340,"mr":32.1,"lvl":{"arm":3.8,"ad":3.5,"aso":3.6,"crit":0,"hp":90,"mp":42,"mp5":0.6,"hp5":0.55,"mr":1.25}},"pass":{"name":"Shadow Walk","descr":"When out of combat, Evelynn enters Camouflage only being able to be seen by nearby enemy champions or Control Wards. While Camouflaged, she rapidly regenerates Mana.","img":"Evelynn_ShadowWalk.png"},"spells":[{"name":"Hate Spike","descr":"Evelynn fires a line of spikes through an enemy, dealing damage to all enemies in its path.","tooltip":"Evelynn fires a line of spikes through a nearby enemy dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E magic damage to all enemies in its path.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EHate Spike prioritizes the target Evelynn is attacking.\u003C\/span\u003E","cost":[12,18,24,30,36],"costType":" Mana","cd":[1.5,1.5,1.5,1.5,1.5],"range":[500,500,500,500,500],"key":"EvelynnQ"},{"name":"Dark Frenzy","descr":"Evelynn passively increases her Movement Speed when hitting enemy champions with her spells. Upon activation, Evelynn breaks free from slows affecting her and gains a massive Movement Speed boost for a short duration.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Evelynn removes all slows affecting her and gains {{ e3 }}% Movement Speed for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Evelynn's spell hits on enemy champions reduce Dark Frenzy's cooldown by 1 second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EChampion kills and assists refresh Dark Frenzy's cooldown.\u003C\/span\u003E","cost":[40,40,40,40,40],"costType":" Mana","cd":[15,15,15,15,15],"range":[10000,10000,10000,10000,10000],"key":"EvelynnW"},{"name":"Ravage","descr":"Evelynn slashes her target twice, dealing damage with each hit. She then gains increased Attack Speed for a short duration.","tooltip":"Evelynn swiftly attacks a target {{ e3 }} times (applies on-hit effects), dealing a total of {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage.\u003Cbr\u003E\u003Cbr\u003EEvelynn then gains {{ e4 }}% Attack Speed for {{ e2 }} seconds.","cost":[50,55,60,65,70],"costType":" Mana","cd":[9,9,9,9,9],"range":[225,225,225,225,225],"key":"EvelynnE"},{"name":"Agony's Embrace","descr":"Evelynn summons spikes from the ground to deal damage and slow enemies in the area. She then gains a shield based on how many enemy champions were hit.","tooltip":"Evelynn impales all enemies in the targeted area, dealing \u003Cspan class=\"color99FF99\"\u003E{{ f1 }}%\u003C\/span\u003E [{{ e1 }}% + {{ f2 }}% per 100 ability power] of each target's current health as magic damage and slowing their movement speed by {{ e2 }}% for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EEvelynn siphons their pain, gaining a {{ e4 }} health shield for each enemy champion hit which lasts up to {{ e6 }} seconds.","cost":[100,100,100],"costType":" Mana","cd":[120,100,80],"range":[650,650,650],"key":"EvelynnR"}]}