{"id":112,"key":"Viktor","name":"Viktor","title":"the Machine Herald","lore":"Early in life, Viktor discovered his passion for science and invention, particularly in the field of mechanical automation. He attended Zaun's prestigious College of Techmaturgy and led the team that constructed Blitzcrank - a scientific breakthrough that he expected to vault him to the top of his profession. Unfortunately his triumph was usurped by Professor Stanwick, who stole credit for developing Blitzcrank's sentience and later used Viktor's research to revive Urgot. Viktor's appeals for justice fell on deaf ears, and he sank into a deep depression. He withdrew from the College and barricaded himself in his private laboratory, cutting all human ties.  There, in secret, he conceived a project for which nobody else could claim credit. Desiring both to revolutionize his field and to eliminate the jealous human emotions which festered inside him, he engineered parts to replace and improve his own body.\u003Cbr\u003E\u003Cbr\u003EWhen Viktor re-emerged, almost no trace of the original man remained. Not only had he supplanted the majority of his anatomy, but his personality had changed. His previous hope to better society was replaced by an obsession with what he called ''the glorious evolution.'' He saw himself as the patron and pioneer of Valoran's future - a future in which man would renounce his flesh in favor of superior hextech augmentations. Though Viktor's initial appeals were met with heavy skepticism, scientists were confounded by the sophistication of his machinery. By integrating his mind with techmaturgical devices, he had been able to drastically accelerate the progress of his research.  His transformation had stripped him of what he perceived as his emotional weaknesses, but there was some lingering residue of resentment against the Professor. Viktor joined the League of Legends to pit his inventions against the greatest opponents Valoran could offer, and to correct any weaknesses or inefficiencies that remained.\u003Cbr\u003E\u003Cbr\u003E''In one's hand, techmaturgy is a tool. As one's hand, it is liberation.''\u003Cbr\u003E-- Viktor","skins":[{"id":112000,"name":"default","num":0},{"id":112001,"name":"Full Machine Viktor","num":1},{"id":112002,"name":"Prototype Viktor","num":2},{"id":112003,"name":"Creator Viktor","num":3}],"allytips":["Death Ray is a powerful poke and a strong area of denial tool. Use it in combination with Gravity Field to control your enemy's position.","Make sure you choose the right augment at the right time."],"enemytips":["Be careful about how close you let Viktor get to you. Viktor's control of the battlefield increases with his proximity to his opponent.","Be aware of how many augments Viktor has upgraded by looking at the color of the light on his staff (purple, yellow, blue, red)."],"tags":["Mage"],"info":{"attack":2,"defense":4,"magic":10,"difficulty":9},"stats":{"arm":22.72,"ad":52.04,"aso":-0.05,"crit":0,"hp":516.04,"mp":324,"mp5":6,"hp5":7.842,"range":525,"ms":335,"mr":30,"lvl":{"arm":4,"ad":3,"aso":2.11,"crit":0,"hp":78,"mp":50,"mp5":0.8,"hp5":0.65,"mr":0}},"pass":{"name":"Glorious Evolution","descr":"Viktor starts with the Prototype Hex Core that can be upgraded three times in the store to augment his abilities.","img":"Viktor_Passive.png"},"spells":[{"name":"Siphon Power","descr":"Viktor blasts an enemy unit dealing magic damage, gaining a shield and empowering his next basic attack.\u003Cbr\u003E\u003Cbr\u003EAugment: Viktor gains bonus Movement Speed after casting.","tooltip":"Viktor blasts an enemy unit, dealing {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E magic damage while granting Viktor a shield that absorbs up to \u003Cspan class=\"color44DDFF\"\u003E{{ f1 }}\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E damage over the next {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EViktor's next basic attack deals {{ e5 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a2 }})\u003C\/span\u003E bonus magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFCC00\"\u003EAugment - Turbocharge:\u003C\/span\u003E Viktor gains {{ e3 }}% Movement Speed for {{ e2 }} seconds.","cost":[45,50,55,60,65],"costType":" Mana","cd":[8,7,6,5,4],"range":[600,600,600,600,600],"key":"ViktorQ"},{"name":"Gravity Field","descr":"Viktor conjures a heavy gravitational field that slows enemies in its radius. Enemies who stay within the device for too long are stunned.\u003Cbr\u003E\u003Cbr\u003EAugment: Enemies stunned by Gravity Field are dragged to the center.","tooltip":"Viktor deploys a gravitational imprisonment device for {{ e3 }} seconds, slowing enemy units by {{ e1 }}% and adding a stack every {{ e4 }} seconds. At {{ e5 }} stacks the target is stunned for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFCC00\"\u003EAugment - Implosion:\u003C\/span\u003E Enemies stunned by Gravity Field are dragged to the center.","cost":[65,65,65,65,65],"costType":" Mana","cd":[17,16,15,14,13],"range":[700,700,700,700,700],"key":"ViktorW"},{"name":"Death Ray","descr":"Viktor uses his robotic arm to fire a chaos beam that cuts across the field in a line, dealing damage to all enemies in its path.\u003Cbr\u003E\u003Cbr\u003EAugment: An explosion follows the Death Ray's wake, dealing magic damage.","tooltip":"Viktor uses his robotic arm to fire a chaos beam that cuts across the field in a line, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to every enemy in its path.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFCC00\"\u003EAugment - Aftershock:\u003C\/span\u003E An explosion follows the Death Ray's wake, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage.","cost":[70,80,90,100,110],"costType":" Mana","cd":[13,12,11,10,9],"range":[525,525,525,525,525],"key":"ViktorE"},{"name":"Chaos Storm","descr":"Viktor conjures a singularity on the field which deals magic damage and interrupts enemy channels. The singularity then periodically does magic damage to all nearby enemies. Viktor can redirect the singularity.\u003Cbr\u003E\u003Cbr\u003EAugment: The Chaos Storm moves faster.","tooltip":"Viktor conjures a singularity at target location, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and interrupting enemy channels.\u003Cbr\u003E\u003Cbr\u003EViktor can redirect the singularity for {{ e3 }} seconds, which will discharge {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage every {{ e4 }} seconds to nearby enemies. The singularity will move slower as it attempts to move farther away from Viktor.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFCC00\"\u003EAugment - Velocity:\u003C\/span\u003E Chaos Storm moves {{ e0 }}% faster.","cost":[100,100,100],"costType":" Mana","cd":[120,110,100],"range":[700,700,700],"key":"ViktorR"}]}