{"id":119,"key":"Draven","name":"Draven","title":"the Glorious Executioner","lore":"Unlike his brother Darius, victory in battle was never enough for Draven. He craved recognition, acclaim, and glory. He first sought greatness in the Noxian military, but his flair for the dramatic went severely underappreciated. Thirsting for a method to share ''Draven'' with the world, he turned his attention to the prison system. There he carved out the celebrity he desired by turning the tedious affair of executions into a premiere spectacle.\u003Cbr\u003E\u003Cbr\u003EAt Draven's first execution, he shocked onlookers when he ordered the doomed prisoner to run for dear life. Just before the man managed to flee from sight, Draven brought him down with a flawless throw of his axe. Soon, all Draven's executions became a gauntlet through which Noxian prisoners raced for a final chance at life. He used this trial as his own personal stage, and turned executions into a leading form of entertainment. He rallied onlookers into a frenzy, while desperate prisoners scrambled to evade him. They never succeeded. Rejecting the solemn, black uniforms of Noxian executioners Draven donned bright outfits and developed flashy signature moves to distinguish himself. Crowds flocked to see Draven in action, and tales of his performances spread quickly. As his popularity grew, so did his already-inflated ego. He belonged at the center of attention. Before long, the scope of his ambitions outgrew the population of Noxus. He decided that the glorious exploits of Draven should be put on display for the entire world.\u003Cbr\u003E\u003Cbr\u003E'' 'The best' is wherever I decide to set the bar each day.''\u003Cbr\u003E-- Draven","skins":[{"id":119000,"name":"default","num":0},{"id":119001,"name":"Soul Reaver Draven","num":1},{"id":119002,"name":"Gladiator Draven","num":2},{"id":119003,"name":"Primetime Draven","num":3},{"id":119004,"name":"Pool Party Draven","num":4},{"id":119005,"name":"Beast Hunter Draven","num":5},{"id":119006,"name":"Draven Draven","num":6}],"allytips":["If Draven doesn't move, Spinning Axe will fall near his present location. It will fall directly on him, or just to the right or left.","If Draven does move after attacking, Spinning Axe will lead him in the direction of his movement. Use this to control where the Spinning Axe will go."],"enemytips":["Launch skillshots toward the landing position of Draven's Spinning Axes.","Disrupt Draven with the goal of making him drop his axes. If you do, his power drops dramatically."],"tags":["Marksman"],"info":{"attack":9,"defense":3,"magic":1,"difficulty":8},"stats":{"arm":25.544,"ad":55.8,"aso":-0.08,"crit":0,"hp":557.76,"mp":360.56,"mp5":8.042,"hp5":6.176,"range":550,"ms":330,"mr":30,"lvl":{"arm":3.3,"ad":2.91,"aso":2.7,"crit":0,"hp":82,"mp":39,"mp5":0.65,"hp5":0.7,"mr":0}},"pass":{"name":"League of Draven","descr":"Draven gains his fans' Adoration when he catches a Spinning Axe or kills a minion, monster, or tower. Killing enemy champions grants Draven bonus gold based on how much Adoration he has.","img":"Draven_passive.png"},"spells":[{"name":"Spinning Axe","descr":"Draven's next attack will deal bonus physical damage. This axe will ricochet off the target high up into the air. If Draven catches it, he automatically readies another Spinning Axe. Draven can have two Spinning Axes at once.","tooltip":"Draven's next attack will deal \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E bonus physical damage. The bonus is equal to {{ e5 }} plus {{ e2 }}% of his bonus Attack Damage.\u003Cbr\u003E\u003Cbr\u003EThis axe will ricochet off the target high up into the air. If Draven catches it, he automatically readies another Spinning Axe.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EDraven can have two Spinning Axes at once.\u003C\/span\u003E","cost":[45,45,45,45,45],"costType":" Mana","cd":[12,11,10,9,8],"range":[300,300,300,300,300],"key":"DravenQ"},{"name":"Blood Rush","descr":"Draven gains increased Movement Speed and Attack Speed. The Movement Speed bonus decreases rapidly over its duration. Catching a Spinning Axe will refresh the cooldown of Blood Rush.","tooltip":null,"cost":[40,35,30,25,20],"costType":" Mana","cd":[12,12,12,12,12],"range":[1000,1000,1000,1000,1000],"key":"DravenW"},{"name":"Stand Aside","descr":"Draven throws his axes, dealing physical damage to targets hit and knocking them aside. Targets hit are slowed.","tooltip":"Draven throws his axes, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage to targets hit and knocking them aside. Targets hit are slowed by {{ e2 }}% for {{ e3 }} seconds.","cost":[70,70,70,70,70],"costType":" Mana","cd":[18,17,16,15,14],"range":[1050,1050,1050,1050,1050],"key":"DravenE"},{"name":"Whirling Death","descr":"Draven hurls two massive axes to deal physical damage to each unit struck. Whirling Death slowly reverses direction and returns to Draven after striking an enemy champion. Draven may also activate this ability while the axes are in flight to cause it to return early. Deals less damage for each unit hit and resets when the axes reverse direction.","tooltip":"Draven hurls two massive axes to deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage to each unit struck.\u003Cbr\u003E\u003Cbr\u003EWhirling Death slowly reverses direction and returns to Draven after striking an enemy champion. Draven may also activate this ability while the axes are in flight to cause it to return early. Deals {{ e4 }}% less damage for each unit hit (Minimum {{ e2 }}%) and resets when the axes reverse direction.","cost":[100,100,100],"costType":" Mana","cd":[100,90,80],"range":[20000,20000,20000],"key":"DravenR"}]}