{"id":150,"key":"Gnar","name":"Gnar","title":"the Missing Link","lore":"The jungle does not forgive blindness. Every broken branch tells a story.\u003Cbr\u003E\u003Cbr\u003EI've hunted every creature this jungle has to offer. I was certain there were no challenges left here, but now there is something new. Each track is the size of a tusklord; its claws like scimitars. It could rend a man in half. Finally, worthy prey.\u003Cbr\u003E\u003Cbr\u003EAs I stalk my prize through the jungle, I begin to see the damage this thing has wrought. I step into a misshapen circle of splintered trees. These giant wooden sentinels have stood over this land for countless ages, their iron-like hides untouched by the flimsy axes of anyone foolish enough to attempt to cut them down. This thing brushed them aside like they were twigs.\u003Cbr\u003E\u003Cbr\u003EHow can a creature with this level of strength disappear so easily? And yet, even though it has left this unmistakable trail of destruction, I have been unable to lay my eye upon it. How can it appear like a hurricane then fade into the jungle like the morning mist?\u003Cbr\u003E\u003Cbr\u003EI thrill in anticipation of finally standing before this creature. It will make a tremendous trophy.\u003Cbr\u003E\u003Cbr\u003EPassing through the clearing, I follow the sound of a stream to get my bearings once more. There I see a small shock of orange fur, crouching, waiting. I spy on it from a distance. A tiny fish splashes out of the stream and the creature scrambles for it, diving gleefully into the rushing water. To my joy, I realize it's a yordle. And a hunter, at that!\u003Cbr\u003E\u003Cbr\u003EThis is a good omen. The beast will be found. Nothing will escape me.\u003Cbr\u003E\u003Cbr\u003EThe yordle's large ears perk up and face towards me. He runs on all fours with a bone boomerang in hand, quickly stopping in front of me. He babbles.\u003Cbr\u003E\u003Cbr\u003EI nod in appreciation at the young yordle and venture onwards. I traverse the difficult terrain with ease, trying to pick up any sign of my quarry. As I try to pick up his scent, a distraction. I'm startled by strange chittering. The yordle followed me. I cannot allow him to disrupt my hunt. I face him and point into the distance. He looks at me quizzically. I need to be more insistent, good omen or no.\u003Cbr\u003E\u003Cbr\u003EI rear back and let out a roar, the wind whipping the yordle's fur and the ground rumbling beneath us. After a few short seconds, he turns his head and, with what I think could be a smile, he holds up his small boomerang. There can be no further delay. I snatch the weapon out of his hand and expertly throw it into a tree, impaling it high amongst the branches. He turns and scrambles for it, jumping frantically.\u003Cbr\u003E\u003Cbr\u003EI barely get ten paces when a roar shakes me to my very spine. The deafening crack of stone and wood echoes all around. Ahead, a giant tree crashes across my path. The bone weapon of the yordle juts out from its trunk.\u003Cbr\u003E\u003Cbr\u003EAn unearthly growl rises behind me.\u003Cbr\u003E\u003Cbr\u003EI've made a terrible mistake.","skins":[{"id":150000,"name":"default","num":0},{"id":150001,"name":"Dino Gnar","num":1},{"id":150002,"name":"Gentleman Gnar","num":2},{"id":150003,"name":"Snow Day Gnar","num":3},{"id":150004,"name":"El León Gnar","num":4}],"allytips":["Managing your Rage is very important. Try to time out your transformations so you can get maximum benefit from both forms.","Position yourself next to walls to bait your enemies into getting stunned by your ultimate.","Know your strengths! Mini Gnar is fast, squishy, and has high sustained damage. Mega Gnar is slow, tough, and has high burst."],"enemytips":["Gnar can't gain Rage for 15 seconds after he turns from big to little. Use this chance to engage on his team.","Gnar's animations and resource bar change as he gets closer to transforming.  ","Gnar's ultimate stuns if he hits you into a wall. Be careful when fighting him near one."],"tags":["Fighter","Tank"],"info":{"attack":6,"defense":5,"magic":5,"difficulty":8},"stats":{"arm":23,"ad":51,"aso":0,"crit":0,"hp":540,"mp":100,"mp5":0,"hp5":2.5,"range":175,"ms":325,"mr":30,"lvl":{"arm":2.5,"ad":3,"aso":6,"crit":0,"hp":65,"mp":0,"mp5":0,"hp5":0.5,"mr":0}},"pass":{"name":"Rage Gene","descr":"While in combat Gnar generates Rage. At maximum Rage his next ability will transform him into Mega Gnar, granting increased survivability and access to new spells.","img":"Gnar_Passive.png"},"spells":[{"name":"Boomerang Throw \/ Boulder Toss","descr":"Gnar throws a boomerang that damages and slows enemies it hits before returning to him. If he catches the boomerang its cooldown is reduced.\u003Cbr\u003E\u003Cbr\u003EMega Gnar instead throws a boulder that stops on the first unit hit, damaging and slowing everything nearby. It can then be picked up to reduce the cooldown.","tooltip":"\u003Cspan class=\"color33FF33\"\u003EMini Gnar: \u003C\/span\u003EThrows a boomerang that deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and slows enemies by {{ e3 }}% for {{ e4 }} seconds. The boomerang returns towards Gnar after hitting an enemy, dealing {{ e7 }}% damage to subsequent targets. Each enemy can only be hit once. Catching the boomerang reduces its cooldown by {{ f1 }}%.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EMega Gnar: \u003C\/span\u003EThrows a boulder that stops when it hits an enemy, slowing all nearby enemies and dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E physical damage. Picking up the boulder reduces its cooldown by {{ e6 }}%.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[20,17.5,15,12.5,10],"range":[1100,1100,1100,1100,1100],"key":"GnarQ"},{"name":"Hyper \/ Wallop","descr":"Gnar's attacks and spells hype him up, dealing bonus damage and granting him Movement Speed.\u003Cbr\u003E\u003Cbr\u003EMega Gnar is too enraged to be hyper and instead can rear up on his hind legs and smash down on the area in front of him, stunning enemies in an area.","tooltip":"\u003Cspan class=\"color33FF33\"\u003EMini Gnar: \u003C\/span\u003E\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Every 3rd attack or spell on the same target deals an additional {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}) \u003C\/span\u003E+ {{ e2 }}% of the target's max Health as magic damage and grants Gnar {{ f1 }}% Movement Speed that decays over 3 seconds (max {{ e4 }} damage vs. monsters). \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EMega Gnar: \u003C\/span\u003EStuns enemies in an area for {{ e5 }} seconds, dealing {{ e3 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ a2 }})\u003C\/span\u003E physical damage.\u003Cbr\u003E\u003Cbr\u003EGnar gains Hyper's Movement Speed bonus when he leaves Mega form.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[15,13,11,9,7],"range":[0,0,0,0,0],"key":"GnarW"},{"name":"Hop \/ Crunch","descr":"Gnar leaps to a location and bounces off the head of any unit he lands on, traveling further.\u003Cbr\u003E\u003Cbr\u003EMega Gnar is too large to bounce and instead lands with earth-shattering force, dealing damage in an area around him.","tooltip":"\u003Cspan class=\"color33FF33\"\u003EMini Gnar: \u003C\/span\u003ELeaps to a location, gaining {{ e2 }}% Attack Speed for {{ e3 }} seconds. If Gnar lands on a unit he will bounce off it, traveling further. Deals {{ e1 }} \u003Cspan class=\"colorCC3300\"\u003E(+{{ f1 }}) [6% of Gnar's Max Health]\u003C\/span\u003E physical damage and slows briefly if the unit landed on was an enemy.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EMega Gnar: \u003C\/span\u003ELeaps to a location and deals {{ e1 }} \u003Cspan class=\"colorCC3300\"\u003E(+{{ f1 }}) [6% of Gnar's Max Health]\u003C\/span\u003E physical damage to nearby enemies on landing. Enemies Gnar lands directly on top of are slowed briefly.\u003Cbr\u003E\u003Cbr\u003EIf Crunch is used to transform, Gnar will still be able to bounce.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[22,19.5,17,14.5,12],"range":[475,475,475,475,475],"key":"GnarE"},{"name":"GNAR!","descr":"Mega Gnar throws everything around him in a chosen direction, dealing damage and slowing them.  Any enemy that hits a wall is stunned and takes bonus damage.","tooltip":"\u003Cspan class=\"color33FF33\"\u003EMini Gnar: \u003C\/span\u003E\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Increases Boomerang Throw's cooldown reduction on catch to {{ e4 }}% and Hyper's Movement Speed bonus to {{ e2 }}%.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EMega Gnar: \u003C\/span\u003EKnocks nearby enemies in the specified direction, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E physical damage and slowing them by {{ e8 }}% for {{ e3 }} seconds. Enemies that hit a wall take {{ e7 }}% damage and are stunned instead of slowed.","cost":[0,0,0],"costType":"No Cost","cd":[120,100,80],"range":[590,590,590],"key":"GnarR"}]}