{"id":39,"key":"Irelia","name":"Irelia","title":"the Will of the Blades","lore":"''The sword flourishes, as though painting with blood.''\u003Cbr\u003E\u003Cbr\u003EThe Ionians have developed some of the most breathtaking and deadly martial arts in all of Runeterra - just one manifestation of their pursuit of enlightenment. The most remarkable blade style to emerge, however, was the unusual byproduct of foreign intervention.\u003Cbr\u003E\u003Cbr\u003EMaster Lito was a swordsman whose teachings were sought by ruling classes from nearly every city-state. His art was a highly-guarded secret, but it was said that swords would breathe in his grasp. He withered unexpectedly from a mysterious disease which baffled the brightest of Runeterran physicians. When he died, he left behind Zelos and Irelia, his son and daughter, and a truly unique weapon. Zelos became a sergeant in the Ionian military and left to seek assistance from Demacia immediately prior to Noxus' invasion of Ionia. Irelia, charged with the protection of their home until Zelos returned, was alone when the Noxian forces struck.\u003Cbr\u003E\u003Cbr\u003EThe Ionians fought admirably, but soon Ionian blood stained the land beneath the prints of foreign boots. At the Great Stand of the Placidium, Ionians prepared for surrender, but were inspired to maintain their resistance when the young Irelia lifted her father's enormous blade and pledged to hold until her brother returned. In the chaos of the ensuing fight, Irelia was cursed with dark Noxian Necromancy.\u003Cbr\u003E\u003Cbr\u003EAs her life ebbed, Soraka, the Starchild, made a final attempt to anchor her fading soul. Unwilling to relinquish her home, Irelia rose at the brink of death, and her father's weapon lifted into the air alongside her. Irelia rushed back to the fore, unfazed by the blade's sudden animation. The weapon danced around her effortlessly, cutting down Noxians as they gaped in horror. The decimated invaders were forced to retreat from the Placidium, and Irelia was appointed Ionia's Captain of the Guard for her brave defense of her homeland.","skins":[{"id":39000,"name":"default","num":0},{"id":39001,"name":"Nightblade Irelia","num":1},{"id":39002,"name":"Aviator Irelia","num":2},{"id":39003,"name":"Infiltrator Irelia","num":3},{"id":39004,"name":"Frostblade Irelia","num":4},{"id":39005,"name":"Order of the Lotus Irelia","num":5}],"allytips":["Use Bladesurge to cover great distances by targeting low life minions on your way to champion targets.","Save your Transcendent Blades attacks for the right moment.","Reserving Equilibrium Strike for losing battles can often turn the tide."],"enemytips":["Be wary of Irelia's Equilibrium Strike, as it stuns if you have a higher Health % than her.","Irelia can quickly cover great distances by using Bladesurge on low life targets (its cooldown refreshes if it slays the target)."],"tags":["Fighter","Assassin"],"info":{"attack":7,"defense":4,"magic":5,"difficulty":5},"stats":{"arm":25.3,"ad":61.544,"aso":-0.06,"crit":0,"hp":607.2,"mp":338.8,"mp5":8.1,"hp5":8.592,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.75,"ad":3.3,"aso":3.2,"crit":0,"hp":90,"mp":32,"mp5":0.65,"hp5":0.65,"mr":1.25}},"pass":{"name":"Ionian Fervor","descr":"Irelia reduces the duration of disables on herself based on whether she is Outnumbered by nearby champions. If she's in an even fight, she'll reduce disables by a small amount, if she's outnumbered, she'll reduce disables by a larger amount.","img":"Irelia_IonianFervor.png"},"spells":[{"name":"Bladesurge","descr":"Irelia dashes forward to strike her target. If it kills the target, Bladesurge's cooldown refreshes and refunds a portion of the Mana Cost.","tooltip":"Irelia dashes forward to strike her target, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and applying on-hit effects.\u003Cbr\u003E\u003Cbr\u003EIf it kills the target, Bladesurge's cooldown is refreshed and Irelia gains {{ e2 }} Mana.","cost":[50,55,60,65,70],"costType":" Mana","cd":[14,12,10,8,6],"range":[650,650,650,650,650],"key":"IreliaQ"},{"name":"Hiten Style","descr":"Irelia is skilled in the art of Hiten, passively giving her physical attacks Health restoration. Activating Hiten Style doubles her Health restoration and gives her basic attacks true damage.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Basic attacks restore {{ e1 }} Health.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Irelia's basic attacks deal {{ e2 }} true damage and Hiten Style restores twice as much health for {{ e3 }} seconds.","cost":[40,40,40,40,40],"costType":" Mana","cd":[15,15,15,15,15],"range":[20,20,20,20,20],"key":"IreliaW"},{"name":"Equilibrium Strike","descr":"Irelia's attack balances the scales, dealing damage and slowing the target. However, if the target has a higher Health % than Irelia, then the blow stuns the target instead of slowing.","tooltip":"Irelia pierces her target, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slowing them by {{ e3 }}% for {{ e2 }} second(s).\u003Cbr\u003E\u003Cbr\u003EIf the target has a higher Health % than Irelia, she stuns them for the duration instead.","cost":[50,55,60,65,70],"costType":" Mana","cd":[8,8,8,8,8],"range":[325,325,325,325,325],"key":"IreliaE"},{"name":"Transcendent Blades","descr":"Irelia summons 4 spirit blades that she can fling to deal physical damage and siphon life from enemies they pass through.","tooltip":"Irelia summons 4 spirit blades that she can fling to deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to enemies they pass through. She heals for {{ e3 }}% of the damage dealt against champions. ({{ e4 }}% vs. minions and monsters)","cost":[100,100,100],"costType":" Mana","cd":[110,85,60],"range":[1000,1000,1000],"key":"IreliaR"}]}