{"id":84,"key":"Akali","name":"Akali","title":"the Fist of Shadow","lore":"There exists an ancient order originating in the Ionian Isles dedicated to the preservation of balance. Order, chaos, light, darkness -- all things must exist in perfect harmony for such is the way of the universe. This order is known as the Kinkou and it employs a triumvirate of shadow warriors to uphold its causes in the world. Akali is one of these shadow warriors, entrusted with the sacred duty of Pruning the Tree - eliminating those who threaten the equilibrium of Valoran. \u003Cbr\u003E\u003Cbr\u003EA prodigal martial artist, Akali began training with her mother as soon as she could make a fist. Her mother's discipline was relentless and unforgiving, but predicated on the fundamental principle: ''We do that which must be done.'' When the Kinkou inducted her into the order at the age of fourteen, she could slice a dangling chain with a chop of her hand. There was no question - she would succeed her mother as the Fist of Shadow. She has had to do much in this role which others might find morally questionable, but to her it is in service of her mother's inviolable doctrine. She now works with her fellows Shen and Kennen to enforce the balance of Valoran. This hallowed pursuit has unsurprisingly led the triumvirate to the Fields of Justice.\u003Cbr\u003E\u003Cbr\u003E''The Fist of Shadow strikes from the cover of death itself. Do not impede the balance.''","skins":[{"id":84000,"name":"default","num":0},{"id":84001,"name":"Stinger Akali","num":1},{"id":84002,"name":"Crimson Akali","num":2},{"id":84003,"name":"All-star Akali","num":3},{"id":84004,"name":"Nurse Akali","num":4},{"id":84005,"name":"Blood Moon Akali","num":5},{"id":84006,"name":"Silverfang Akali","num":6},{"id":84007,"name":"Headhunter Akali","num":7},{"id":84008,"name":"Sashimi Akali","num":8}],"allytips":["Akali excels at killing weaker characters. Let your team initiate and then strike at the people in the back.","Find the balance between storing Essence of Shadows, and using Shadow Dance before having max charges."],"enemytips":["Akali can still be hit by area effect spells while Invisible inside Twilight Shroud.","Akali can choose where she starts within her Twilight Shroud before casting it, even if part of the shroud would extend beyond a wall.","Return to base if your Health is low and Akali has multiple charges of her ultimate."],"tags":["Assassin"],"info":{"attack":5,"defense":3,"magic":8,"difficulty":7},"stats":{"arm":26.38,"ad":58.376,"aso":-0.1,"crit":0,"hp":587.8,"mp":200,"mp5":50,"hp5":8.342,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3.5,"ad":3.2,"aso":3.1,"crit":0,"hp":85,"mp":0,"mp5":0,"hp5":0.65,"mr":1.25}},"pass":{"name":"Twin Disciplines","descr":"Akali's first two attacks are empowered. The first strike heals her, and the second strike deals bonus magic damage. Twin Disciplines will recharge itself automatically a short while after being used.","img":"AkaliTwinDisciplines.png"},"spells":[{"name":"Mark of the Assassin","descr":"Akali spins her kama at a target enemy to deal Magic Damage and mark the target for 6 seconds. Akali's melee attacks against a marked target will trigger and consume the mark to cause additional damage and restore Energy.","tooltip":"Akali throws her kama at a target enemy to deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and mark the target for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAkali's melee attacks against a marked target will consume the mark to deal {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage and restore {{ e3 }} energy.","cost":[60,60,60,60,60],"costType":" Energy","cd":[6,5.5,5,4.5,4],"range":[600,600,600,600,600],"key":"AkaliQ"},{"name":"Twilight Shroud","descr":"Akali teleports to a nearby location, leaving a cover of smoke at her previous location. While inside the shroud, Akali becomes Invisible and gains Movement Speed. Attacking or using abilities will briefly reveal her. Enemies inside the smoke have their Movement Speed reduced.","tooltip":"Akali teleports to a nearby location, leaving a cover of smoke at her previous location that lasts for {{ e2 }} seconds and slows enemies within its area by {{ e3 }}%.\u003Cbr\u003E\u003Cbr\u003EWhile inside the shroud Akali gains \u003Cspan class=\"color91d7ee\"\u003EInvisibility\u003C\/span\u003E and {{ e6 }}% movement speed. Attacking or using abilities briefly removes \u003Cspan class=\"color91d7ee\"\u003EInvisibility\u003C\/span\u003E.\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"size16 color91d7ee\"\u003E16","cost":[60,55,50,45,40],"costType":" Energy","cd":[20,20,20,20,20],"range":[270,270,270,270,270],"key":"AkaliW"},{"name":"Crescent Slash","descr":"Akali flourishes her kamas, dealing damage based on her bonus Attack Damage and Ability Power. When Crescent Slash kills a unit, it has a shorter cooldown.","tooltip":"Akali flourishes her kamas, slicing enemies for {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage.\u003Cbr\u003E\u003Cbr\u003EIf Crescent Slash kills an enemy, its cooldown is refunded by {{ e3 }}%.","cost":[60,55,50,45,40],"costType":" Energy","cd":[5,4.5,4,3.5,3],"range":[300,300,300,300,300],"key":"AkaliE"},{"name":"Shadow Dance","descr":"Akali moves through shadows to quickly strike through her target, dealing damage and consuming an Essence of Shadow charge. Akali recharges Essence of Shadow charges periodically, max 3 stacks.","tooltip":"Akali quickly strikes through her target, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003EAkali stores an Essence of Shadow on kills and assists as well as every \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E seconds up to {{ e4 }} total.","cost":[0,0,0],"costType":" Essence of Shadow","cd":[2,2,2],"range":[700,700,700],"key":"AkaliR"}]}