{"id":62,"key":"MonkeyKing","name":"Wukong","title":"the Monkey King","lore":"During the chaos of the Rune Wars, an enormous runestone was lost deep within the Plague Jungles. It remained there, untouched for centuries, emanating a potent magic which infused nearby wildlife with sentience and vitality. A group of monkeys who were particularly empowered by it came to worship the stone, and their leader - a wise sage - became convinced that he could harness its power to make the monkeys immortal. He performed an elaborate ritual, but things didn't go as he expected. The runestone was destroyed, and instead of granting immortality, it produced Kong, a monkey who carried in his heart the strength and power it had contained. Kong was driven by an unquenchable desire for greatness. He sought out every beast and monster the Plague Jungles could offer, eager to find a worthy opponent, but none offered the challenge he craved. He asked the sage for advice, and learned about a legend of hairless monkeys to the north who, with wits and might, had bent the world to their will.\u003Cbr\u003E\u003Cbr\u003EKong left, journeying north, determined to discover if the legend was true. He crossed the Southern Wastes and then the Great Barrier. On his way, he happened upon Master Yi, who was deep in meditation. Kong asked him who the strongest warrior in the north was, and Yi told him about the League of Legends. The tale intoxicated Kong, a place where he could battle the strongest fighters in the world was, to him, paradise. Kong asked Yi to introduce him to this League, and to teach him the ways of humans, so that he could be a fitting champion. In return, he would honor Yi by using Yi's Wuju style to become the greatest warrior Runeterra had ever seen. Admiring his passion, Yi agreed, but under the condition that Kong would one day teach the lessons of Wuju to a pupil of his own. In the spirit of this agreement, he renamed Kong ''Wukong,'' and gave him a weapon suited to his unusual nature - an enchanted staff that the young Doran had crafted. The weapon was an unrivalled masterpiece. Guided by Yi, Wukong joined the League of Legends to prove himself as the best, and to show the world the true power of Wuju.\u003Cbr\u003E\u003Cbr\u003E''Only in combat do you learn who you truly are.''\u003Cbr\u003E-- Wukong","skins":[{"id":62000,"name":"default","num":0},{"id":62001,"name":"Volcanic Wukong","num":1},{"id":62002,"name":"General Wukong","num":2},{"id":62003,"name":"Jade Dragon Wukong","num":3},{"id":62004,"name":"Underworld Wukong","num":4},{"id":62005,"name":"Radiant Wukong","num":5}],"allytips":["Decoy and Nimbus Strike work well together to quickly strike your enemy and get out before they can retaliate.","Try using Decoy near brush to make an enemy overreact to your movement."],"enemytips":["Wukong will often use Decoy after Nimbus Strike. Try delaying your abilities by a short amount of time to ensure that you're hitting the real Wukong.","Wukong becomes tougher to kill when surrounded by his enemies. Try to isolate him to gain an advantage."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":5,"magic":2,"difficulty":3},"stats":{"arm":24.88,"ad":59.876,"aso":-0.05,"crit":0,"hp":577.8,"mp":265.84,"mp5":8.042,"hp5":6.192,"range":175,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.2,"aso":3,"crit":0,"hp":85,"mp":38,"mp5":0.65,"hp5":0.65,"mr":1.25}},"pass":{"name":"Stone Skin","descr":"Increases Wukong's Armor and Magic Resist for each nearby enemy champion.","img":"MonkeyKingStoneSkin.png"},"spells":[{"name":"Crushing Blow","descr":"Wukong's next attack deals additional physical damage, gains range, and reduces the enemy's Armor for a short duration.","tooltip":"Wukong's next attack gains {{ e4 }} range, deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus physical damage and reduces the enemy's Armor by {{ e2 }}% for {{ e3 }} seconds.","cost":[40,40,40,40,40],"costType":" Mana","cd":[9,8,7,6,5],"range":[650,650,650,650,650],"key":"MonkeyKingQ"},{"name":"Decoy","descr":"Wukong becomes Invisible for a short duration, leaving behind a decoy that will deal Magic Damage to enemies near it when Wukong's stealth expires.","tooltip":"Wukong becomes \u003Cspan class=\"color91d7ee\"\u003EInvisible\u003C\/span\u003E for {{ e2 }} seconds, leaving behind a decoy that will deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage to enemies near it after {{ e2 }} seconds. \u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cspan class=\"size16 color91d7ee\"\u003E16","cost":[50,55,60,65,70],"costType":" Mana","cd":[18,16,14,12,10],"range":[325,325,325,325,325],"key":"MonkeyKingW"},{"name":"Nimbus Strike","descr":"Wukong dashes to target enemy and sends out images to attack up to 2 additional enemies near his target, dealing physical damage to each enemy struck.","tooltip":"Wukong dashes to target enemy and sends out images to attack up to 2 additional enemies nearby. Each enemy struck takes {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage. Wukong then gains {{ e2 }}% Attack Speed for {{ e3 }} seconds.","cost":[45,50,55,60,65],"costType":" Mana","cd":[8,8,8,8,8],"range":[650,650,650,650,650],"key":"MonkeyKingE"},{"name":"Cyclone","descr":"Wukong's staff grows outward and he spins it around, dealing damage and knocking up enemies. Wukong gains Movement Speed over the duration of the spell.","tooltip":"Wukong's staff grows outward and he spins it around for 4 seconds, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage per second to nearby enemies, knocking them up for {{ e4 }} second the first time they get hit.\u003Cbr\u003E\u003Cbr\u003EAt the start, Wukong gains {{ e2 }}% Movement Speed, and he gains an additional {{ e3 }}% per second over the duration.","cost":[100,100,100],"costType":" Mana","cd":[120,105,90],"range":[315,315,315],"key":"MonkeyKingR"}]}