{"id":38,"key":"Kassadin","name":"Kassadin","title":"the Void Walker","lore":"There is a place between dimensions and between worlds. To some it is known as the Outside, to others it is the Unknown. To most, however, it is called the Void. Despite its name, the Void is not an empty place, but rather the home of unspeakable things, horrors not meant for minds of men. Though such knowledge is lost in modern times, there are those who have unwittingly discovered what lies beyond, and they have been unable to turn away. Kassadin is such a creature. He was once a man forced to look upon the face of the Void and forever changed by what he saw. Once a seeker of forbidden knowledge, he discovered that what he sought was something else entirely. He is one of the few that has found his way to forgotten Icathia and lived to tell the tale, following the scant breadcrumbs hidden in ancient texts.\u003Cbr\u003E\u003Cbr\u003EWithin a decaying cyclopean city, Kassadin found secrets of the kind that he will never share - secrets that made him quake with fear at the visions of things to come that were thrust upon him. The power of the place threatened to consume him forever, but Kassadin took the only route available to him in order to survive - he let the Void inside him. Miraculously, he was able to overcome the alien urges that went with it, and he emerged as something more than human. Though a part of him died that day, he knows that he must protect Valoran from the things scratching at the door, waiting to get in and visit their torments upon the world. They are only one step away... something to which the appearance of the abomination known as Cho'Gath attests.\u003Cbr\u003E\u003Cbr\u003EIf you look upon the Void, you can't put it behind you. If you look upon Kassadin, he is probably already there.","skins":[{"id":38000,"name":"default","num":0},{"id":38001,"name":"Festival Kassadin","num":1},{"id":38002,"name":"Deep One Kassadin","num":2},{"id":38003,"name":"Pre-Void Kassadin","num":3},{"id":38004,"name":"Harbinger Kassadin","num":4},{"id":38005,"name":"Cosmic Reaver Kassadin","num":5}],"allytips":["Kassadin has multiple item paths; he can go caster via Mana and Ability Power or anti-caster with Cooldown Reduction and Magic Resist.","Kassadin's ultimate has many uses and is on a shorter cooldown than most, use it often.","Try to get the Ancient Golem buff to counteract Riftwalk's increasing Mana cost."],"enemytips":["Kassadin deals mostly magic damage. If he's doing well consider buying magic resist items like Mercury's Treads and Banshee's Veil.","Each time Kassadin consecutively uses Riftwalk, he pays more and more mana. Keep this in mind as you chase him.","It takes 6 spell casts for Kassadin's slow, Force Pulse, to become castable. If he levels up that ability, judiciously use your own skills while laning against him."],"tags":["Assassin","Mage"],"info":{"attack":3,"defense":5,"magic":8,"difficulty":8},"stats":{"arm":23.376,"ad":58.852,"aso":-0.023,"crit":0,"hp":564.04,"mp":397.6,"mp5":6,"hp5":7.79,"range":150,"ms":340,"mr":30,"lvl":{"arm":3.2,"ad":3.9,"aso":3.7,"crit":0,"hp":78,"mp":67,"mp5":0.8,"hp5":0.5,"mr":0}},"pass":{"name":"Void Stone","descr":"Kassadin takes 15% reduced magic damage and ignores unit collision.","img":"Kassadin_Passive.png"},"spells":[{"name":"Null Sphere","descr":"Kassadin fires an orb of void energy at a target, dealing damage and interrupting channels. The excess energy forms around himself, granting a temporary shield that absorbs magic damage.","tooltip":"Kassadin fires an orb of void energy that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and interrupts channels.\u003Cbr\u003E\u003Cbr\u003EThe excess energy forms around himself, granting a shield that absorbs {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage for {{ e4 }} seconds.","cost":[70,75,80,85,90],"costType":" Mana","cd":[9,9,9,9,9],"range":[650,650,650,650,650],"key":"KassadinQ"},{"name":"Nether Blade","descr":"Passive: Kassadin's basic attacks deal bonus magic damage. Active: Kassadin's next basic attack deals significant bonus magic damage and restores Mana.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EKassadin's basic attacks draw energy from the void, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EKassadin charges his Nether Blade, causing his next basic attack to deal {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E bonus magic damage and restore \u003Cspan class=\"color44DDFF\"\u003E{{ e1 }}% of his missing Mana\u003C\/span\u003E (increases to \u003Cspan class=\"color44DDFF\"\u003E{{ e4 }}%\u003C\/span\u003E against champions).","cost":[0,0,0,0,0],"costType":"No Cost","cd":[7,7,7,7,7],"range":[1,1,1,1,1],"key":"KassadinW"},{"name":"Force Pulse","descr":"Kassadin draws energy from spells cast in his vicinity. Upon charging up, Kassadin can use Force Pulse to damage and slow enemies in a cone in front of him.","tooltip":"Kassadin draws energy from spells cast in his vicinity, gaining a charge whenever a spell is cast near him.\u003Cbr\u003E\u003Cbr\u003EUpon reaching 6 charges, Kassadin can use Force Pulse to deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slow enemies by {{ e2 }}% for {{ e3 }} second in a cone in front of him.","cost":[60,65,70,75,80],"costType":" Mana","cd":[6,6,6,6,6],"range":[400,400,400,400,400],"key":"KassadinE"},{"name":"Riftwalk","descr":"Kassadin teleports to a nearby location dealing damage to nearby enemy units. Multiple Riftwalks in a short period of time cost additional Mana but also deal additional damage.","tooltip":"Kassadin teleports to a nearby location dealing {{ e1 }} \u003Cspan class=\"color44DDFF\"\u003E(+{{ f2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to surrounding enemy units.\u003Cbr\u003E\u003Cbr\u003EEach subsequent Riftwalk within the next {{ e2 }} seconds doubles the Mana cost and deals an additional {{ e3 }} \u003Cspan class=\"color44DDFF\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ f3 }})\u003C\/span\u003E magic damage per stack, stacking up to {{ e6 }} times.","cost":[50,50,50],"costType":" Mana","cd":[6,4,2],"range":[500,500,500],"key":"KassadinR"}]}