{"id":3,"key":"Galio","name":"Galio","title":"the Sentinel's Sorrow","lore":"''There is no such thing as redemption. Only penance.''\u003Cbr\u003E\u003Cbr\u003ELong before the regulation of magic, mages experimented with the creation of artificial life. Now forbidden, instilling golems with reason was once not so uncommon a practice amongst the more expert of craftsmen. One such visionary was the Demacian artificer, Durand. Peerless at crafting sentient beings, Durand's constructs served as tireless guardians for the border towns of his beloved city-state, affording them protection from their Noxian neighbors. For his own defense, however, Durand kept his magnum opus: Galio. This mighty construct - forged in the image of a gargoyle - kept him safe on his journeys, allowing him to perform his important work without fear of reprisal from those hostile to his homeland. That is, until dealing with his taxing sentinels finally roused the ire of the Noxian High Command.\u003Cbr\u003E\u003Cbr\u003EAs Durand crossed the Howling Marsh with his masterwork in tow, he was set upon by Noxian assassins in force. Outnumbered and overwhelmed, Galio looked on in horror as the murderers cut down his charge, executing him swiftly before vanishing back into the mists. Stripped of his reason for being, Galio despaired. For years he remained in solitude, standing vigil over the bones of the master he had failed to protect... a literal monument to his own everlasting shame.\u003Cbr\u003E\u003Cbr\u003EThen, one nondescript day, a sad but determined yordle girl carrying a mighty Demacian crown stopped in the shadow of the great statue to rest. Hidden in plain sight from his unsuspecting visitor, Galio studied the forlorn yordle. She looked as though she too shouldered a tremendous burden. As quietly and as stoically as she had arrived, she departed in the direction of Demacia. This encounter lit a spark in Galio's eye. Remembering the cause that his master had died defending, Galio arose from his silent purgatory and followed in the wake of this brave creature. He had a new reason to live: to fight for the will of Demacia.","skins":[{"id":3000,"name":"default","num":0},{"id":3001,"name":"Enchanted Galio","num":1},{"id":3002,"name":"Hextech Galio","num":2},{"id":3003,"name":"Commando Galio","num":3},{"id":3004,"name":"Gatekeeper Galio","num":4},{"id":3005,"name":"Debonair Galio","num":5}],"allytips":["Placing Bulwark on an ally under attack is a good way to regain Health.","Righteous Gust can be useful for charging opponents or escaping pursuers.","You can significantly increase the damage potential of Idol of Durand by using it when multiple enemies are close."],"enemytips":["Avoid attacking Galio's allies while they are Bulwarked, since your attacks will be less effective and will heal Galio.","Avoid bunching up with allies when Galio is nearby.","Interrupting Galio while he channels Idol of Durand will free any allies he's taunting."],"tags":["Tank","Mage"],"info":{"attack":3,"defense":7,"magic":6,"difficulty":3},"stats":{"arm":26.88,"ad":61.97,"aso":-0.02,"crit":0,"hp":577.8,"mp":369,"mp5":6,"hp5":8.71,"range":125,"ms":335,"mr":32.1,"lvl":{"arm":3.5,"ad":3.375,"aso":1.2,"crit":0,"hp":85,"mp":47,"mp5":0.8,"hp5":0.75,"mr":1.25}},"pass":{"name":"Runic Skin","descr":"Galio gains Ability Power equal to 50% of his total Magic Resist.","img":"Galio_RunicSkin.png"},"spells":[{"name":"Resolute Smite","descr":"Galio fires a concussive blast from his eyes, slowing and dealing damage to enemies caught near the impact point.","tooltip":"Galio fires a concussive blast from his eyes. Enemies hit take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are slowed by {{ e2 }}% for {{ e3 }} seconds.","cost":[60,65,70,75,80],"costType":" Mana","cd":[7,7,7,7,7],"range":[940,940,940,940,940],"key":"GalioQ"},{"name":"Bulwark","descr":"Galio shields an ally Champion, increasing their Armor and Magic Resist, and restoring Galio's Health each time that Champion suffers damage.","tooltip":"Galio protects a friendly champion for {{ e3 }} seconds, increasing their Armor and Magic Resist by {{ e1 }}.\u003Cbr\u003E\u003Cbr\u003EEach time the ally takes damage, Galio is healed for {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E. Bulwark heals for {{ e4 }}% less for each consecutive hit.","cost":[60,60,60,60,60],"costType":" Mana","cd":[13,13,13,13,13],"range":[800,800,800,800,800],"key":"GalioW"},{"name":"Righteous Gust","descr":"Galio claps his wings, unleashing a gust of concussive wind that damages enemies and leaves a directional draft in its wake that increases ally Movement Speed.","tooltip":"Galio unleashes a gust of concussive wind that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in its path. A directional draft then remains for {{ e3 }} seconds, increasing the Movement Speed of allies following it by {{ e2 }}%.","cost":[60,65,70,75,80],"costType":" Mana","cd":[13,12,11,10,9],"range":[1180,1180,1180,1180,1180],"key":"GalioE"},{"name":"Idol of Durand","descr":"Galio assumes the form of a statue, taunting nearby enemies and storing concussive energy as they attack him. Galio then bursts from his statue shell, releasing the stored energy to damage surrounding foes.","tooltip":"Galio channels for {{ e6 }} seconds, taunting nearby foes and blocking {{ e4 }}% of incoming damage.\u003Cbr\u003E\u003Cbr\u003EAfter channeling, Galio deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to surrounding enemies, plus an additional {{ e2 }}% damage for each attack he suffered while channeling, up to a max of {{ e5 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E damage ({{ e3 }}% bonus damage).","cost":[100,100,100],"costType":" Mana","cd":[150,135,120],"range":[560,560,560],"key":"GalioR"}]}