{"id":11,"key":"MasterYi","name":"Master Yi","title":"the Wuju Bladesman","lore":"Through the ancient martial art of Wuju, Master Yi has tempered his body and sharpened his mind until thought and action have become one. Though he chooses to enter into violence as a last resort, the grace and speed with which he wields his blade ensures resolution is always swift. As the last living practitioner of Wuju, Master Yi has devoted his life to finding able pupils to carry on the legacy of his lost people. \u003Cbr\u003E\u003Cbr\u003EEven before Yi mastered Wuju, he was considered one of the most skilled practitioners of the mystical martial art. He would soon prove his mastery when word of a massive Noxian invasion reached his remote village. Yi swept across the battlefields of Ionia, turning back the tide of Noxus's vast infantry with swift and deadly strikes, much to the embarrassment of Noxian High Command. Recognizing the threat the Wuju disciples posed to their invasion, the Noxians chose to unleash a nightmarish chemical attack on the home of the deadly art. Those who somehow survived the poisonous concoction had their minds twisted beyond repair. Yi's home was left in ruin.\u003Cbr\u003E\u003Cbr\u003EAt the war's conclusion, Yi returned to the grotesque remains of his village. There he became the attack's final casualty. Slain in spirit, if not in body, Yi clung to the only feeling left within his heart: vengeance. Driven only by his desire to punish those who'd destroyed his home, Yi spent years training in seclusion. He became a deadlier swordsman than he had ever been, but true mastery of Wuju still eluded him.\u003Cbr\u003E\u003Cbr\u003EAt the height of Yi's frustration, a monkey of unusually noble bearing interrupted his training. Standing as straight and tall as a man, the monkey watched and mimicked Yi's movements. Yi shooed the monkey away, but the agile creature took great amusement in turning Yi's own techniques against him. Gradually, Yi felt his anger subside as he sparred with the playful animal, and when the burden of his hatred had fully lifted, he found he had caught the monkey by his tail. Yi then understood that he would never master Wuju so long as he pursued it for vengeance, and as he let go of the monkey, he also released his desire to shed his enemy's blood.\u003Cbr\u003E\u003Cbr\u003E Yi thanked the monkey for showing him what he'd been blind to, and was surprised when the creature actually replied. He wished to learn Yi's art of fighting. It was an odd request, but through it Yi saw his new path: the way to honor the memory of his lost people was to pass their teachings on to a new generation.\u003Cbr\u003E\u003Cbr\u003E''The edge of the sharpest blade is no match for the calm of the peaceful mind.'' \u003Cbr\u003E-- Master Yi","skins":[{"id":11000,"name":"default","num":0},{"id":11001,"name":"Assassin Master Yi","num":1},{"id":11002,"name":"Chosen Master Yi","num":2},{"id":11003,"name":"Ionia Master Yi","num":3},{"id":11004,"name":"Samurai Yi","num":4},{"id":11005,"name":"Headhunter Master Yi","num":5},{"id":11009,"name":"PROJECT: Yi","num":9}],"allytips":["If you're in a lane against ranged players, leveling up Meditate can allow you to stay in the lane longer and gain levels faster than they will.","Wuju Style is very strong early for last hitting minions.","Try using Alpha Strike on a minion in front of an enemy champion so you are placed at a safe distance at the end of the spell."],"enemytips":["Meditate is an effective method of healing damage over time, but Master Yi is susceptible to coordinated team ganks early in the game.","If Master Yi tries to farm with Alpha Strike, hit him a few times so he has to use mana with Meditate to heal.","Although Master Yi cannot be slowed while using Highlander, other disables can stop him in his tracks."],"tags":["Assassin","Fighter"],"info":{"attack":10,"defense":4,"magic":2,"difficulty":4},"stats":{"arm":24.04,"ad":60.04,"aso":-0.08,"crit":0,"hp":598.56,"mp":250.56,"mp5":7.256,"hp5":7.592,"range":125,"ms":355,"mr":32.1,"lvl":{"arm":3,"ad":3,"aso":2,"crit":0,"hp":92,"mp":42,"mp5":0.45,"hp5":0.65,"mr":1.25}},"pass":{"name":"Double Strike","descr":"Every few strikes, Master Yi strikes twice.","img":"MasterYi_Passive1.png"},"spells":[{"name":"Alpha Strike","descr":"Master Yi teleports across the battlefield with blinding speed, dealing physical damage to multiple units in his path, while simultaneously becoming untargetable. Alpha Strike can critically strike and deals bonus physical damage to minions and monsters. Basic attacks reduce Alpha Strike's cooldown.","tooltip":"Master Yi teleports to strike up to {{ e8 }} enemies, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage, with an additional {{ e3 }} damage to minions and monsters. During Alpha Strike Master Yi is untargetable.\u003Cbr\u003E\u003Cbr\u003EAlpha Strike can critically strike, dealing an additional \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E physical damage. Basic attacks lower the cooldown of Alpha Strike by {{ e7 }} second.","cost":[70,80,90,100,110],"costType":" Mana","cd":[18,17,16,15,14],"range":[600,600,600,600,600],"key":"MasterYiQ"},{"name":"Meditate","descr":"Master Yi rejuvenates his body by focus of mind, restoring Health and taking reduced damage for a short time. In addition, Master Yi will gain stacks of Double Strike and pause the remaining duration on Wuju Style and Highlander for each second he channels.","tooltip":"Master Yi channels, restoring {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Health per second for 4 seconds. This healing is increased by {{ e4 }}% for every {{ e5 }}% of Master Yi's missing Health.\u003Cbr\u003E\u003Cbr\u003EWhile channeling, Master Yi reduces incoming damage by {{ e3 }}%. This damage reduction is halved against turrets. \u003Cbr\u003E\u003Cbr\u003EIn addition, Master Yi will gain stacks of Double Strike and pause the remaining duration on Wuju Style and Highlander for each second he channels.","cost":[50,50,50,50,50],"costType":" Mana","cd":[35,35,35,35,35],"range":[20,20,20,20,20],"key":"MasterYiW"},{"name":"Wuju Style","descr":"Master Yi becomes skilled in the art of Wuju, passively increasing his Attack Damage. Activating Wuju Style grants bonus true damage on basic attacks, but the passive bonus is then lost while on cooldown.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Grants {{ e1 }}% \u003Cspan class=\"colorFF8C00\"\u003E({{ f1 }})\u003C\/span\u003E Attack Damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Basic attacks deal {{ e3 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E bonus true damage for {{ e5 }} seconds. Afterwards the passive bonus is lost while Wuju Style is on cooldown.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[18,17,16,15,14],"range":[20,20,20,20,20],"key":"MasterYiE"},{"name":"Highlander","descr":"Master Yi moves with unparalleled agility, temporarily increasing his Movement and Attack Speeds as well as making him immune to all slowing effects. While active, Champion kills or assists extend Highlander's duration. Passively reduces cooldown for his other abilities on a kill or assist.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Champion kills and assists reduce the remaining cooldown of Master Yi's basic abilities by {{ e5 }}%.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Increases Movement Speed by {{ e3 }}%, Attack Speed by {{ e2 }}%, and grants immunity to slows for {{ e1 }} seconds. While active, champion kills and assists extend the duration of Highlander by {{ e4 }} seconds.","cost":[100,100,100],"costType":" Mana","cd":[85,85,85],"range":[1,1,1],"key":"MasterYiR"}]}