{"id":107,"key":"Rengar","name":"Rengar","title":"the Pridestalker","lore":"On every wall of his den, the trophy hunter Rengar mounts the heads, horns, claws, and fangs of the most lethal creatures in Valoran. Though his collection is extensive, he remains unsatisfied, tirelessly seeking greater game. He takes time with every kill, studying his prey, learning, and preparing himself for the next encounter with the one monster he never managed to defeat.\u003Cbr\u003E\u003Cbr\u003ERengar never knew his real parents, but was raised by a human who was revered as a legendary hunter. He was an ideal pupil, intently absorbing the lessons of his father, and improving them with his uncanny feral instincts. Before his mane had fully grown, Rengar set off on his own and claimed a wide territory for himself. Along its perimeter, he mounted the skulls of his slain prey - a warning to would-be aggressors. He thought undisputed reign of a region would fulfill him, but instead, he grew restless. No beasts in his domain proved challenging prey, and without formidable adversaries to push his limits, Rengar's spirit waned. He feared that no worthwhile game remained, that he would never again feel the thrill of the hunt. Just when things seemed their bleakest, he encountered the monster. It was a disturbing, alien thing, distinctly out of place in his world. It bore huge scything claws and devoured any animal that strayed across its path. Overzealous at the prospect of a challenge, Rengar ambushed the monster in haste. It far outclassed anything he'd hunted before. Their fight was savage, and each suffered crippling wounds. Rengar lost an eye, but the most grievous blow was to his pride. He had never before failed to make the kill. Worse yet, the severity of his injuries forced him to retreat. Over the following days, he hovered on the threshold between life and death. He was wracked with pain, but beneath it, he felt a glimmer of joy. The hunt was on. If such powerful beings existed in the world, he would find them, and stack their heads high. The monster, however, was a kill he wanted to savor. On his den's largest wall, he reserves a space for the beast's head, a trophy he swears will one day be the centerpiece of his collection.\u003Cbr\u003E\u003Cbr\u003E''Prey on the weak and you will survive, prey on the strong and you will live.''\u003Cbr\u003E-- Rengar","skins":[{"id":107000,"name":"default","num":0},{"id":107001,"name":"Headhunter Rengar","num":1},{"id":107002,"name":"Night Hunter Rengar","num":2},{"id":107003,"name":"SSW Rengar","num":3}],"allytips":["Use Rengar's ultimate to find and assassinate high priority targets in team fights and skirmishes.","A lot of Rengar's power comes from empowered abilities he uses at the right moment - choose wisely!","Make sure to take paths through brush when chasing opponents to take advantage of Rengar's passive."],"enemytips":["Rengar gains an empowered ability when his resource bar is full. Try to confront him when it's low.","Rengar's passive enables him to leap out of brush, so avoid fighting him when near bushes.","Rengar puts an indicator over the nearest enemy champion when he is camouflaged during his ultimate."],"tags":["Assassin","Fighter"],"info":{"attack":7,"defense":4,"magic":2,"difficulty":8},"stats":{"arm":25.88,"ad":60,"aso":0,"crit":0,"hp":586.2,"mp":4,"mp5":0,"hp5":7,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3,"ad":1.5,"aso":3.5,"crit":0,"hp":90,"mp":0,"mp5":0,"hp5":0.5,"mr":1.25}},"pass":{"name":"Unseen Predator","descr":"While in brush, Rengar leaps at his target with his basic attack.\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#EDDA74'\u003ERengar's abilities build Ferocity. Upon reaching full Ferocity, his next ability becomes empowered and grants him Movement Speed on cast, but he instantly loses all Ferocity if he leaves combat.\u003Cbr\u003E\u003Cbr\u003EKilling enemy champions awards trophies on Rengar's Bonetooth Necklace, permanently increasing his Attack Damage.\u003C\/font\u003E","img":"Rengar_P.png"},"spells":[{"name":"Savagery","descr":"Rengar slashes all enemies in an arc before piercing all enemies in a line. Casting this outside the max range moves Rengar a short distance in that direction.\u003Cbr\u003E\u003Cbr\u003EFerocity effect: deals increased damage.","tooltip":"Slash all enemies in an arc before piercing all enemies in a line for {{ e1 }} \u003Cspan class=\"colorF88017\"\u003E(+{{ f2 }})\u003C\/span\u003E physical damage per strike.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorEDDA74\"\u003EFerocity effect:\u003C\/span\u003E\u003Cbr\u003EEach hit deals \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E damage.\u003Cbr\u003E\u003Cbr\u003E\u003Crules\u003E\u003Cspan class=\"color8c8c8c\"\u003EIf cast outside max range, Rengar lunges forward to extend the range of the piercing attack.\u003Cbr\u003EIf used during leap, Savagery is cast immediately following the leap.\u003C\/span\u003E\u003C\/rules\u003E","cost":[0,0,0,0,0],"costType":"Generates 1 Ferocity","cd":[0.25,0.25,0.25,0.25,0.25],"range":[450,450,450,450,450],"key":"RengarQ"},{"name":"Battle Roar","descr":"Rengar lets out a battle roar, damaging enemies and healing for some of the recent damage he has taken.\u003Cbr\u003E\u003Cbr\u003EFerocity effect: additionally breaks crowd control effects.","tooltip":"Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies and heals Rengar for {{ e2 }}% of the damage he took in the last {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorEDDA74\"\u003EFerocity effect: \u003C\/span\u003E\u003Cbr\u003EDeals \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and removes existing crowd control effects, in addition to its normal effect.\u003Cbr\u003E\u003Cbr\u003E\u003Crules\u003E\u003Cspan class=\"color8c8c8c\"\u003EDamage healed from monster attacks is increased by {{ e5 }}%.\u003C\/span\u003E\u003C\/rules\u003E","cost":[0,0,0,0,0],"costType":"Generates 1 Ferocity","cd":[0.25,0.25,0.25,0.25,0.25],"range":[450,450,450,450,450],"key":"RengarW"},{"name":"Bola Strike","descr":"Rengar throws a bola, slowing the first target hit for a short duration.\u003Cbr\u003E\u003Cbr\u003EFerocity effect: roots the target.","tooltip":"Throw a bola, dealing {{ e1 }}\u003Cspan class=\"colorF88017\"\u003E (+{{ a1 }})\u003C\/span\u003E physical damage and slowing the first enemy hit by {{ e2 }}% for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorEDDA74\"\u003EFerocity effect:\u003C\/span\u003E\u003Cbr\u003EDeals \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E \u003Cspan class=\"colorF88017\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and roots the target for {{ e4 }} seconds.","cost":[0,0,0,0,0],"costType":"Generates 1 Ferocity","cd":[0.25,0.25,0.25,0.25,0.25],"range":[1000,1000,1000,1000,1000],"key":"RengarE"},{"name":"Thrill of the Hunt","descr":"Rengar's predatory instincts take over, \u003Cfont color='#cd90ee'\u003ECamouflaging\u003C\/font\u003E him and revealing the nearest enemy champion in a large radius around him. During Thrill of the Hunt, Rengar gains Movement Speed and he can leap to the tracked enemy for a guaranteed critical strike, even without being in brush.","tooltip":"Rengar gains {{ e1 }}% Movement Speed and \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E of the nearest enemy champion (within {{ e3 }} range) for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAfter the first {{ e6 }} seconds, Rengar becomes \u003Cspan class=\"colorcd90ee\"\u003ECamouflaged\u003C\/span\u003E and can leap to an enemy without being in brush. Leaping to the nearest champion results in a critical strike.\u003Cbr\u003E\u003Cbr\u003E\u003Crules\u003E\u003Cspan class=\"color8c8c8c\"\u003EAttacking or casting most spells ends Thrill of the Hunt.\u003C\/span\u003E\u003Cbr\u003E\u003Cspan class=\"colorcd90ee\"\u003E\u003Cu\u003EStealth - Camouflaged:\u003C\/u\u003E\u003C\/span\u003E\u003Cspan class=\"color8c8c8c\"\u003E This character is hidden from view. It is revealed by nearby enemy champions and turrets.\u003C\/span\u003E\u003C\/rules\u003E","cost":[0,0,0],"costType":"No Cost","cd":[130,100,70],"range":[2000,3000,4000],"key":"RengarR"}]}