{"id":42,"key":"Corki","name":"Corki","title":"the Daring Bombardier","lore":"When Heimerdinger and his yordle colleagues migrated to Piltover, they embraced science as a way of life, and they immediately made several groundbreaking contributions to the techmaturgical community. What yordles lack in stature, they make up for with industriousness. Corki, the Daring Bombardier, gained his title by test-piloting one of these contributions - the original design for the Reconnaissance Operations Front-Line Copter, an aerial assault vehicle which has become the backbone of the Bandle City Expeditionary Force (BCEF). Together with his squadron - the Screaming Yipsnakes - Corki soars over Valoran, surveying the landscape and conducting aerial acrobatics for the benefit of onlookers below.\u003Cbr\u003E\u003Cbr\u003ECorki is the most renowned of the Screaming Yipsnakes for remaining cool under fire and exhibiting bravery to the point of madness. Before the League, he served several tours of duty, often volunteering for missions that would take him behind enemy lines, either gathering intelligence or delivering messages through hot zones. He thrived on danger, and enjoyed nothing more than a good dogfight in the morning. More than just an ace pilot, Corki also made several modifications to his copter, outfitting it with an arsenal of weapons which some speculate were more for show than functionality. When open hostilities ceased as part of the agreement surrounding the formation of the League, Corki was forced into a retirement, which he felt ''cut the engines and clipped the wings''. He tried to make do with stunt flying and canyon running, but it was never the same without the refreshing smell of gunpowder streaking through the air around him. When Heimerdinger joined the League of Legends, it was no surprise to see Corki follow soon after, eager to test his mettle against the best the world has to offer.\u003Cbr\u003E\u003Cbr\u003EHe is Corki - death from above!","skins":[{"id":42000,"name":"default","num":0},{"id":42001,"name":"UFO Corki","num":1},{"id":42002,"name":"Ice Toboggan Corki","num":2},{"id":42003,"name":"Red Baron Corki","num":3},{"id":42004,"name":"Hot Rod Corki","num":4},{"id":42005,"name":"Urfrider Corki","num":5},{"id":42006,"name":"Dragonwing Corki","num":6},{"id":42007,"name":"Fnatic Corki","num":7},{"id":42008,"name":"Arcade Corki","num":8}],"allytips":["Phosphorus Bomb can be used to reveal enemy units that might be hiding in a nearby patch of brush.","Valkyrie can be used defensively as well, so try using it for a quick escape.","Corki can continue to attack while using Gatling Gun. Maximizing Gatling Gun is key to mastering Corki."],"enemytips":["Watch out for Corki's Missile Barrage. They deal splash damage, so you can get hit even when hiding behind minions.","Corki is vulnerable after he uses his Valkyrie or Special Delivery, so try switching focus to him if he uses them to enter a fight."],"tags":["Marksman"],"info":{"attack":8,"defense":3,"magic":6,"difficulty":6},"stats":{"arm":23.38,"ad":56,"aso":0,"crit":0,"hp":512.76,"mp":350.16,"mp5":7.424,"hp5":5.424,"range":550,"ms":325,"mr":30,"lvl":{"arm":3.5,"ad":3.5,"aso":2.3,"crit":0,"hp":82,"mp":34,"mp5":0.55,"hp5":0.55,"mr":0}},"pass":{"name":"Hextech Munitions","descr":"Corki's basic attack deals bonus damage and half of its damage is converted into magic damage. Every once in a while, The Package arrives in Corki's base to be picked up, temporarily granting him out of combat Movement Speed and upgrading Valkyrie into Special Delivery.","img":"Corki_RapidReload.png"},"spells":[{"name":"Phosphorus Bomb","descr":"Corki fires a flash bomb at a target location, dealing magic damage to enemies in the area. This attack additionally reveals units in the area for a duration.","tooltip":"Corki lobs a bomb, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies in the target area. In addition, the blast reveals the area and champions hit by the blast for {{ e2 }} seconds (does not reveal stealth).","cost":[60,70,80,90,100],"costType":" Mana","cd":[8,8,8,8,8],"range":[825,825,825,825,825],"key":"CorkiQ"},{"name":"Valkyrie","descr":"Corki flies a short distance, dropping bombs that create a trail of fire that damages opponents who remain in it.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Corki flies a short distance, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage per second to enemies in the fire left along his path.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ESpecial Delivery:\u003C\/span\u003E Corki flies a great distance, dropping bombs that knock aside enemies and leave a burning trail for 5 seconds. The trail slows enemies by {{ e2 }}% and burns them for {{ f1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage per second.","cost":[100,100,100,100,100],"costType":" Mana","cd":[20,19,18,17,16],"range":[600,600,600,600,600],"key":"CorkiW"},{"name":"Gatling Gun","descr":"Corki's gatling gun rapidly fires in a cone in front of him, dealing damage and reducing enemy Armor and Magic Resist.","tooltip":"Corki's gatling gun fires continuously at targets in front of him for {{ e2 }} seconds, dealing up to {{ e1 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ f1 }})\u003C\/span\u003E damage and reducing up to {{ e4 }} armor and magic resist.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003EGatling Gun's damage is {{ e7 }}% physical, {{ e8 }}% magic.\u003Cbr\u003EDefense reductions last for {{ e6 }} seconds after last being damaged by Gatling Gun.\u003C\/i\u003E\u003C\/span\u003E","cost":[50,50,50,50,50],"costType":" Mana","cd":[16,16,16,16,16],"range":[600,600,600,600,600],"key":"CorkiE"},{"name":"Missile Barrage","descr":"Corki fires a missile toward his target location that explodes on impact, dealing damage to enemies in an area. Corki stores missiles over time, up to a maximum. Every 3rd missile fired will be a Big One, dealing extra damage.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Corki fires a missile that explodes at the first enemy it hits, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f3 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all nearby enemies.\u003Cbr\u003E\u003Cbr\u003ECorki can store up to 7 missiles, and every 3rd missile will be a Big One, dealing {{ e8 }}% increased damage.","cost":[20,20,20],"costType":" Mana","cd":[2,2,2],"range":[1225,1225,1225],"key":"CorkiR"}]}