{"id":421,"key":"RekSai","name":"Rek'Sai","title":"the Void Burrower","lore":"The largest and fiercest of her species, Rek'Sai is a merciless predator that tunnels through the earth to ambush and devour her prey. Her insatiable hunger has laid waste to entire regions of the once-great Shuriman empire. Merchants, traders and armed caravans will go hundreds of miles out of their way to avoid these vast areas, though cunning bandits have been known to lure the unwary into her killing grounds. Once Rek'Sai detects you, your fate is sealed. There is no hope of escape; she is death from below the sand.","skins":[{"id":421000,"name":"default","num":0},{"id":421001,"name":"Eternum Rek'Sai","num":1},{"id":421002,"name":"Pool Party Rek'Sai","num":2}],"allytips":["Keeping tunnels spread out across the map will ensure you have choices when you want to cast Void Rush.","Cast Burrow before travelling around the map to take advantage of the increased Movement Speed and the safety provided by Tremor Sense.","Tremor Sense can warn you of enemies closing in, and is particularly useful when entering enemy territory."],"enemytips":["If you see one of Rek'Sai's tunnels, briefly stand on one of the entrances to destroy it.","Rek'Sai's Furious Bite gains damage as she builds Fury. Be very careful around her when her Fury is full.","When Rek'Sai is near, she can see the position of you and your allies, but only if you're moving."],"tags":["Fighter"],"info":{"attack":8,"defense":5,"magic":2,"difficulty":3},"stats":{"arm":24,"ad":55.628,"aso":0,"crit":0,"hp":570,"mp":100,"mp5":0,"hp5":7.342,"range":175,"ms":335,"mr":32.1,"lvl":{"arm":3.4,"ad":3.35,"aso":2,"crit":0,"hp":90,"mp":0,"mp5":0,"hp5":0.65,"mr":1.25}},"pass":{"name":"Fury of the Xer'Sai","descr":"While unburrowed Rek'Sai generates Fury with her basic attacks and spells. When burrowed Rek'Sai consumes Fury to heal herself.","img":"RekSai_Passive.png"},"spells":[{"name":"Queen's Wrath \/ Prey Seeker","descr":"Rek'Sai's next 3 basic attacks deal bonus Physical Damage to nearby enemies.\u003Cbr\u003E\u003Cbr\u003EWhile Burrowed, Rek'Sai launches a burst of void-charged earth that deals Magic Damage and reveals enemies hit.","tooltip":"\u003Cspan class=\"colorFFFFFF\"\u003EUn-Burrowed:\u003C\/span\u003E Rek'Sai's next 3 basic attacks within 5 seconds deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus Physical Damage to nearby enemies.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFFFF\"\u003EBurrowed:\u003C\/span\u003E Rek'Sai launches a burst of void-charged earth that explodes on first enemy hit, dealing {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage and revealing non-stealthed enemies for {{ e6 }} seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[4,4,4,4,4],"range":[325,325,325,325,325],"key":"RekSaiQ"},{"name":"Burrow \/ Un-burrow","descr":"Rek'Sai burrows into the ground, gaining new abilities and increased Movement Speed. Her vision range is reduced and she cannot use basic attacks.\u003Cbr\u003E\u003Cbr\u003EWhile Burrowed, Rek'Sai may cast Un-burrow to knock up and damage nearby enemies.","tooltip":"\u003Cspan class=\"colorFFFFFF\"\u003EUn-Burrowed:\u003C\/span\u003E Burrow into the ground. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFFFF\"\u003EBurrowed:\u003C\/span\u003E Un-burrow, dealing {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E Physical Damage and knocking up nearby enemies for up to 1 second based on their proximity to Rek'Sai. A unit cannot be hit by Un-burrow more than once every {{ e6 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF8C00\"\u003EBurrowed Effects:\u003C\/span\u003E New abilities, \u003Cspan class=\"colorFFFFFF\"\u003E+{{ f1 }}\u003C\/span\u003E Movement Speed, reduced vision range, disabled basic attacks, and gains \u003Cspan class=\"colorF0F2B1\"\u003ETremor Sense:\u003C\/span\u003E Nearby enemies that move in Fog of War have their position revealed to Rek'Sai and her allies.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[4,4,4,4,4],"range":[1650,1650,1650,1650,1650],"key":"RekSaiW"},{"name":"Furious Bite \/ Tunnel","descr":"Rek'Sai bites her target, dealing increased damage based on her Fury. Deals True Damage at max Fury.\u003Cbr\u003E\u003Cbr\u003EWhile Burrowed, Rek'Sai creates a re-usable, long lasting tunnel. Enemies can destroy it by standing on top of either entrance.","tooltip":"\u003Cspan class=\"colorFFFFFF\"\u003EUn-Burrowed:\u003C\/span\u003E Rek'Sai bites a target dealing \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E Physical Damage, increasing by up to 100% at maximum Fury. Deals True Damage if Rek'Sai has 100 Fury.\u003Cbr\u003E\u003Cbr\u003EMaximum Damage: \u003Cspan class=\"colorFFFFFF\"\u003E{{ f2 }}\u003C\/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFFFF\"\u003EBurrowed:\u003C\/span\u003E Rek'Sai tunnels forward leaving two connected \u003Cspan class=\"colorF0F2B1\"\u003ETunnel Entrances\u003C\/span\u003E. Clicking a \u003Cspan class=\"colorF0F2B1\"\u003ETunnel Entrance\u003C\/span\u003E will make Rek'Sai dive to the other entrance.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorF0F2B1\"\u003ETunnel Entrances\u003C\/span\u003E last for {{ e5 }} minutes and can be destroyed by enemies. Rek'Sai may have {{ e6 }} tunnels at one time. Tunnels have a {{ e8 }} second cooldown on use.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[12,12,12,12,12],"range":[250,250,250,250,250],"key":"RekSaiE"},{"name":"Void Rush","descr":"Rek'Sai travels at incredible speed to a targeted Tunnel Entrance.","tooltip":"\u003Cspan class=\"colorFF8C00\"\u003EPassive:\u003C\/span\u003E Grants {{ e1 }}% Attack Speed.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF8C00\"\u003EActive:\u003C\/span\u003E After channeling for 1.5 seconds, Rek'Sai becomes untargetable and travels to target \u003Cspan class=\"colorF0F2B1\"\u003ETunnel Entrance\u003C\/span\u003E. Taking damage from a champion or tower will interrupt the channel.","cost":[0,0,0],"costType":"No Cost","cd":[180,140,100],"range":[25000,25000,25000],"key":"RekSaiR"}]}