{"id":26,"key":"Zilean","name":"Zilean","title":"the Chronokeeper","lore":"In the wastelands of Urtistan, there was once a great city. It perished long ago in a terrible Rune War, like most of the lands below the Great Barrier. Nevertheless, one man survived: a sorcerer named Zilean. Being obsessed with time, it was only fitting that he dwelled in the city's Clock Tower. As the havoc of the war neared his home, Zilean experimented with powerful temporal magic to divine all possible futures, hoping to discover a peaceful solution. But Zilean's enchantments affected his perception of the passage of time, and he was in a contemplative stasis when Urtistan was set upon by an entire phalanx of dark summoner-knights of unknown affiliation. By the time he realized his error, Urtistan was nothing more than smoldering debris. The summoners who were responsible for its destruction had wisely left the Clock Tower unharmed, both to avoid drawing Zilean's attention and to torment him for his oversight.\u003Cbr\u003E\u003Cbr\u003EZilean barely had time to grieve the momentous loss before he learned that his dangerous research had a cruel side effect: chrono-displasia. This mystical disease granted him immortality, but detached his consciousness from its anchor in the present time. He now mentally drifts through time, from any point he has already lived to the present, unable to impact the events which unfold. The most torturous aspect of this curse is that Zilean sometimes experiences Urtistan as it once was and the rest of the time resides in its lonely ruins. Only the powerful summoning magic employed by members of the League of Legends has been able to treat this condition, and Zilean has joined in hopes of finding a cure, and thereafter a way to save his people.\u003Cbr\u003E\u003Cbr\u003E''There is no greater grief than for a loss that is yet to come.''\u003Cbr\u003E-- Zilean","skins":[{"id":26000,"name":"default","num":0},{"id":26001,"name":"Old Saint Zilean","num":1},{"id":26002,"name":"Groovy Zilean","num":2},{"id":26003,"name":"Shurima Desert Zilean","num":3},{"id":26004,"name":"Time Machine Zilean","num":4},{"id":26005,"name":"Blood Moon Zilean","num":5}],"allytips":["You can combine the use of Time Bomb and Rewind to place two Time Bombs on a target quickly. Placing the second bomb will detonate the first and stun all nearby enemies.","Time Warp is an effective way to enable allies to finish off enemies, or escape from a losing battle.","Chronoshift is a powerful deterrent to attacking your carries, but casting Chronoshift too early in a fight can cause the enemy to switch targets too soon, making it less effective."],"enemytips":["If you're able to match Zilean's speed, it can sometimes be beneficial to wait until his ultimate has faded before landing the killing blow.","Zilean is fragile if a team focuses on him, but otherwise he's very difficult to kill. Commit to killing him as a team."],"tags":["Support","Mage"],"info":{"attack":2,"defense":5,"magic":8,"difficulty":6},"stats":{"arm":19.134,"ad":51.64,"aso":0,"crit":0,"hp":499.28,"mp":360.8,"mp5":8.5,"hp5":5.44,"range":550,"ms":335,"mr":30,"lvl":{"arm":3.8,"ad":3,"aso":2.13,"crit":0,"hp":77,"mp":60,"mp5":0.8,"hp5":0.5,"mr":0}},"pass":{"name":"Time in a Bottle","descr":"Zilean stores time as \u003Cfont color='#BB55EE'\u003EExperience\u003C\/font\u003E. \u003Cbr\u003E\u003Cbr\u003EWhen he has enough \u003Cfont color='#BB55EE'\u003EExperience\u003C\/font\u003E to finish an ally's level, he can right-click them to impart it. Zilean receives as much \u003Cfont color='#BB55EE'\u003EExperience\u003C\/font\u003E as he gives. Cannot be used in combat.","img":"Zilean_Passive.png"},"spells":[{"name":"Time Bomb","descr":"Tosses a bomb to target area that sticks to units that come near it (prioritizes Champions). It detonates after 3 seconds, dealing area of effect damage. If a Time Bomb is detonated early by another Time Bomb, it also stuns enemies.","tooltip":"Zilean tosses a time-delayed bomb to a location. The bomb sticks to the first unit which comes within a small area around it (prioritizes Champions). After {{ e2 }} seconds it detonates, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to all surrounding enemies. \u003Cbr\u003E\u003Cbr\u003EPlacing two bombs on a unit detonates the first bomb early, stunning all enemies in the blast for {{ e4 }} seconds.","cost":[60,65,70,75,80],"costType":" Mana","cd":[10,9.5,9,8.5,8],"range":[900,900,900,900,900],"key":"ZileanQ"},{"name":"Rewind","descr":"Zilean can prepare himself for future confrontations, reducing the cooldowns of his other basic abilities. ","tooltip":"Reduces Zilean's other basic spell cooldowns by {{ e2 }} seconds.","cost":[0,0,0,0,0],"costType":" Mana","cd":[14,12,10,8,6],"range":[600,600,600,600,600],"key":"ZileanW"},{"name":"Time Warp","descr":"Zilean bends time around any unit, decreasing an enemy's Movement Speed or increasing an ally's Movement Speed for a short time.","tooltip":"Zilean increases an allied champion's Movement Speed, or slows an enemy champion, by {{ e2 }}% for {{ e1 }} seconds.","cost":[50,50,50,50,50],"costType":" Mana","cd":[15,15,15,15,15],"range":[700,700,700,700,700],"key":"ZileanE"},{"name":"Chronoshift","descr":"Zilean places a protective time rune on an allied champion, teleporting the champion back in time if they take lethal damage.","tooltip":"Zilean marks himself or an allied champion with a protective time rune for {{ e2 }} seconds. If the target would take lethal damage, they are instead transported back in time, arriving with {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Health.","cost":[125,150,175],"costType":" Mana","cd":[120,90,60],"range":[900,900,900],"key":"ZileanR"}]}