{"id":75,"key":"Nasus","name":"Nasus","title":"the Curator of the Sands","lore":"''What was fallen will be great again.''\u003Cbr\u003E\u003Cbr\u003ENasus is an imposing, jackal-headed Ascended being from ancient Shurima, a heroic figure regarded as a demigod by the people of the desert. Fiercely intelligent, he was a guardian of knowledge and peerless strategist whose wisdom guided the ancient empire of Shurima to greatness for many centuries. After the fall of the empire, he went into self-imposed exile, becoming little more than a legend. Now that the ancient city of Shurima has risen once more, he has returned, determined to ensure it never falls again.","skins":[{"id":75000,"name":"default","num":0},{"id":75001,"name":"Galactic Nasus","num":1},{"id":75002,"name":"Pharaoh Nasus","num":2},{"id":75003,"name":"Dreadknight Nasus","num":3},{"id":75004,"name":"Riot K-9 Nasus","num":4},{"id":75005,"name":"Infernal Nasus","num":5},{"id":75006,"name":"Archduke Nasus","num":6},{"id":75010,"name":"Worldbreaker Nasus","num":10}],"allytips":["Paying attention to last hitting with Siphoning Strike will have a large impact at the end of a game.","If you're solo, Spirit Fire is a great way to farm a lane. It can be bad if you're in a lane with 2 and you push too far. Find the right balance between Siphoning Strike last hits and AoE farming.","If you have low defenses, people will focus you down even during your ultimate. Try buying some survivability items even in your DPS builds."],"enemytips":["While transformed by his ultimate, Nasus is stronger than most champions in the League. Engage him only if you have a clear advantage.","Max rank Wither is a very effective counter to Attack Damage characters, so try to avoid getting caught alone by it.","Nasus is prone to being kited. Try not to engage him at full Health."],"tags":["Fighter","Tank"],"info":{"attack":7,"defense":5,"magic":6,"difficulty":6},"stats":{"arm":24.88,"ad":59.18,"aso":-0.02,"crit":0,"hp":561.2,"mp":325.6,"mp5":7.44,"hp5":9.012,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3.5,"ad":3.5,"aso":3.48,"crit":0,"hp":90,"mp":42,"mp5":0.5,"hp5":0.9,"mr":1.25}},"pass":{"name":"Soul Eater","descr":"Nasus drains his foe's spiritual energy, giving him bonus Life Steal.","img":"Nasus_Passive.png"},"spells":[{"name":"Siphoning Strike","descr":"Nasus strikes his foe, dealing damage and increasing the power of his future Siphoning Strikes if he slays his target.","tooltip":"Nasus's next basic attack will deal {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E \u003Cspan class=\"color5555FF\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage.\u003Cbr\u003E\u003Cbr\u003ESiphoning Strike permanently gains \u003Cspan class=\"color5555FF\"\u003E{{ e2 }}\u003C\/span\u003E damage if it kills an enemy. This bonus is doubled against Champions, large minions and large monsters.","cost":[20,20,20,20,20],"costType":" Mana","cd":[8,7,6,5,4],"range":[300,300,300,300,300],"key":"NasusQ"},{"name":"Wither","descr":"Nasus ages an enemy champion, decelerating their Movement and Attack Speeds over time.","tooltip":"Nasus ages target champion over {{ e3 }} seconds, slowing their Movement Speed by {{ e2 }}%, increasing to {{ e1 }}% over the duration. The target's Attack Speed is reduced by half the amount.","cost":[80,80,80,80,80],"costType":" Mana","cd":[15,14,13,12,11],"range":[600,600,600,600,600],"key":"NasusW"},{"name":"Spirit Fire","descr":"Nasus unleashes a spirit flame at a location, dealing damage and reducing the Armor of enemies who stand on it.","tooltip":"Nasus unleashes a spirit flame at target location, dealing {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003EFor the next {{ e3 }} seconds, enemies in the area have their Armor reduced by {{ e2 }} and are dealt an additional {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage each second.","cost":[70,85,100,115,130],"costType":" Mana","cd":[12,12,12,12,12],"range":[650,650,650,650,650],"key":"NasusE"},{"name":"Fury of the Sands","descr":"Nasus unleashes a mighty sandstorm that batters nearby enemies. While the storm rages, he gains increased Health, Attack Range, damages nearby enemies and gains bonus Armor and Magic Resistance for the duration.","tooltip":"Nasus becomes empowered in the sandstorm for 15 seconds, increasing his maximum Health by {{ e1 }} and Armor and Magic Resistance by {{ e4 }}.\u003Cbr\u003E\u003Cbr\u003EWhile the storm rages, he deals {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E% of nearby enemies' maximum Health each second as magic damage ({{ e5 }} damage max per second) and gains an additional {{ e8 }} Armor and Magic Resistance.","cost":[100,100,100],"costType":" Mana","cd":[120,120,120],"range":[20,20,20],"key":"NasusR"}]}