{"id":102,"key":"Shyvana","name":"Shyvana","title":"the Half-Dragon","lore":"A half-breed born from the union between dragon and human, Shyvana searched all her life for belonging. Persecution forged her into a brutal warrior, and those who dare stand against Shyvana face the fiery beast lurking just beneath her skin.\u003Cbr\u003E\u003Cbr\u003EDragonkind considered Shyvana's impure blood an abomination, and she spent her youth pursued relentlessly by one cruel drake. Constantly on the run, she and her father, an outcast dragon, never knew a lasting home. A brutal reflection of countless battles, Shyvana grew hateful and savage. After years of strife, her father finally fell to the other dragon, but not before gravely wounding his foe. Furious with grief, Shyvana pursued her father's murderer as he fled north to recover. There she encountered a group of humans on the trail of the same drake. Though the men looked upon her in fear, their leader approached Shyvana peacefully. He introduced himself as Jarvan IV, the Prince of Demacia, and offered to aid Shyvana in her quest for vengeance. Together they hunted down and confronted the vicious dragon that had slain her father. Shyvana did not expect the men to survive, but in the clash of fire and steel, Jarvan and his men fought with strength she had never believed humans to possess. The ironclad warriors drove their foe into submission, and Shyvana struck the final blow, tearing the beast's heart from its body. Inspired by her ferocity, Jarvan offered her a place in the ranks of his elite guard. Shyvana could still see fear in the eyes of his men, but she longed for a true home. Trusting Jarvan's word, she accepted his offer and now serves as a Demacian warrior. Though her human allies admire her power, they keep their distance. Shyvana strives to repay the prince's kindness with the power of the dragon within, but she cannot help but wonder if the humans are right to fear her.\u003Cbr\u003E\u003Cbr\u003E''I have proven my might to dragonkind - what challenge shall humans pose?''\u003Cbr\u003E-- Shyvana","skins":[{"id":102000,"name":"default","num":0},{"id":102001,"name":"Ironscale Shyvana","num":1},{"id":102002,"name":"Boneclaw Shyvana","num":2},{"id":102003,"name":"Darkflame Shyvana","num":3},{"id":102004,"name":"Ice Drake Shyvana","num":4},{"id":102005,"name":"Championship Shyvana","num":5},{"id":102006,"name":"Super Galaxy Shyvana","num":6}],"allytips":["Shyvana's abilities all benefit from attacking units. As a result, Attack Speed items are more valuable on her than most champions.","Flame Breath is great to level-up against difficult lane opponents.","Burnout is an ideal choice for jungling. Monsters will be hit by the full duration, and the speed boost improves her ganking potential.","It can be valuable to purchase one of the items that can slow enemies: Frozen Mallet, Dead Man's Plate, or Entropy."],"enemytips":["A significant portion of Shyvana's power is generated through aggression, making her weak against opponents who are able to keep their distance.","All of Shyvana's basic abilities hit multiple enemies in dragon form. It's important for opposing champions to not cluster while fighting her.","Shyvana's Fury Bar indicate her ultimate can be activated. Harassing her when she's low on Fury can be very effective."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":6,"magic":3,"difficulty":4},"stats":{"arm":27.628,"ad":60.712,"aso":-0.05,"crit":0,"hp":595,"mp":100,"mp5":0,"hp5":8.6,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3.35,"ad":3.4,"aso":2.5,"crit":0,"hp":95,"mp":0,"mp5":0,"hp5":0.8,"mr":1.25}},"pass":{"name":"Fury of the Dragonborn","descr":"\u003CmainText\u003EShyvana deals bonus damage to dragons and gains Armor and Magic Resistance. As Shyvana and her allies slay more dragons, she gains more bonus Armor and Magic Resistance.\u003C\/mainText\u003E","img":"ShyvanaReinforcedScales.png"},"spells":[{"name":"Twin Bite","descr":"Shyvana strikes twice on her next attack. Basic attacks reduce the cooldown of Twin Bite by 0.5 seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#FF3300'\u003EDragon Form: \u003C\/font\u003ETwin Bite cleaves all units in front Shyvana. ","tooltip":"Shyvana strikes twice on her next attack, dealing \u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E and \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E physical damage on the first and second hits respectively.\u003Cbr\u003E\u003Cbr\u003EWhile Twin Bite is on cooldown, basic attacks reduce the remaining cooldown duration by {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EDragon Form: \u003C\/span\u003ETwin Bite cleaves all units in front Shyvana.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003ETwin Bite's second hit damage is equal to {{ e1 }}% of Shyvana's attack damage.\u003C\/i\u003E\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":"No Cost","cd":[9,8,7,6,5],"range":[650,650,650,650,650],"key":"ShyvanaQ"},{"name":"Burnout","descr":"Shyvana surrounds herself in fire, dealing magic damage per second to nearby enemies and moving faster for 3 seconds, part of this damage is applied again when Shyvana basic attacks an enemy with Burnout active. The Movement Speed reduces over the duration of the spell. Basic attacks extend the duration of Burnout. \u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#FF3300'\u003EDragon Form: \u003C\/font\u003EBurnout grows in size.","tooltip":"Shyvana deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage per second to nearby enemies and gains a bonus {{ e2 }}% movement speed that decays over {{ e7 }} seconds.\u003Cbr\u003E\u003Cbr\u003EWhile Burnout is active, basic attacks deal {{ effect1amount*0.25 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ charbonusphysical*0.25 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ charabilitypower2*.25 }})\u003C\/span\u003E magic damage to nearby enemies and extend its duration by {{ e8 }} second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EDragon Form: \u003C\/span\u003EBurnout grows in size.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003EBurnout has a maximum duration of {{ e9 }} seconds.\u003C\/i\u003E\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":"No Cost","cd":[12,12,12,12,12],"range":[325,325,325,325,325],"key":"ShyvanaW"},{"name":"Flame Breath","descr":"Shyvana unleashes a fireball that deals damage to all enemies it encounters and leaves cinders on the target, marking them for 5 seconds. Shyvana's basic attacks on marked targets deal a percentage of their maximum Health as damage on-hit.\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color='#FF3300'\u003EDragon Form: \u003C\/font\u003EFlame Breath explodes on impact or at target location, dealing bonus damage and scorching the earth for a short duration.","tooltip":"Shyvana unleashes a fireball that stops after hitting a champion. All enemies hit take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are marked for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EShyvana's basic attacks against marked targets deal {{ e4 }}% of their maximum health as magic damage on hit.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF3300\"\u003EDragon Form: \u003C\/span\u003EFlame Breath explodes on impact or at target location, dealing \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage and scorching the earth for 4 seconds. Enemies on scorched earth take \u003Cspan class=\"colorFFFFFF\"\u003E{{ f3 }}\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E magic damage per second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003EFlame Breath's on-hit damage against monsters is capped at {{ e3 }} damage per hit.\u003C\/i\u003E\u003C\/span\u003E","cost":[0,0,0,0,0],"costType":"No Cost","cd":[12,11,10,9,8],"range":[925,925,925,925,925],"key":"ShyvanaE"},{"name":"Dragon's Descent","descr":"Shyvana transforms into a dragon and takes flight to a target location. Enemies along her path take damage and are knocked toward her target location.\u003Cbr\u003E\u003Cbr\u003EShyvana passively gains Fury per second and gains 2 Fury on basic attack.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EShyvana transforms into a dragon, gaining {{ e0 }} Health and flying to target location. Enemies along her path take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are knocked toward her target location.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EShyvana generates {{ e3 }} Fury every second. Basic Attacks generate {{ e2 }} Fury.","cost":[0,0,0],"costType":" Fury a Second","cd":[0,0,0],"range":[850,850,850],"key":"ShyvanaR"}]}