{"id":48,"key":"Trundle","name":"Trundle","title":"the Troll King","lore":"Trundle is a hulking and devious troll with a mischievous streak. There is nothing he can't beat into submission and bend to his will, not even the ice itself. With his massive, frozen club, he chills his enemies to the core and runs them through with jagged shards of ice. Fiercely territorial, Trundle chases down anyone foolish enough to enter his domain and laughs as they bleed onto the tundra.\u003Cbr\u003E\u003Cbr\u003ETrundle's warband once followed a foolish and cowardly chieftain. Under such a weak leader, Trundle feared he and his kin would fall prey to the other troll hordes scattered across the tundra. When his challenge to the chieftain ended in humiliation, Trundle did something that wasn't very troll-like: instead of his fists, he turned to his wits. Thinking on his hairy feet, he spun a tall tale about the troll leaders of old, claiming they wielded weapons of great power as symbols of their right to rule. Though he'd made up the story on the spot, Trundle wagered that if he could find or steal such a weapon, he would become the rightful leader of the warband. The trolls believed him, but none thought him capable of undertaking such a challenge. Knowing the boastful troll would die trying, the foolish chieftain agreed and Trundle departed to the familiar sound of laughter.\u003Cbr\u003E\u003Cbr\u003EAlone but undaunted, Trundle ventured into the foreboding realm of the dreaded Ice Witch. There, hidden among the many ancient and dangerous secrets, he hoped to find a weapon to prove his elaborate tale. He out-muscled the Ice Witch's guards and outsmarted her dark magic traps, but nothing he scavenged matched the power he'd described to his kin. Finally, he found an unexpected prize: a huge and magical club of never-melting True Ice. Grasping the weapon, he marveled at the cold power that ran through him. But then the wrathful Ice Witch herself appeared. As she summoned her dark magic, Trundle believed he had met his end, but another clever idea struck him. With a knowing grin, he offered the Ice Witch a devious proposition: a troll army, he told her, would be of much more use to her than one troll corpse....\u003Cbr\u003E\u003Cbr\u003EWhen Trundle returned to the warband, his fellow trolls bowed to his conquest. Calling his weapon ''Boneshiver,'' he took a moment to enjoy the look of numb shock on his chieftain's face before he caved it in. Seizing command, Trundle announced that there would no longer be chieftains - only a Troll King before whom all of his kind would kneel. The trolls rallied behind their brash, new leader and prepared for the coming war. With Trundle leading the charge, the time of the trolls had finally come.\u003Cbr\u003E\u003Cbr\u003E''Outsmart anyone you can't beat, and beat anyone you can't outsmart.'' \u003Cbr\u003E-- Trundle","skins":[{"id":48000,"name":"default","num":0},{"id":48001,"name":"Lil' Slugger Trundle","num":1},{"id":48002,"name":"Junkyard Trundle","num":2},{"id":48003,"name":"Traditional Trundle","num":3},{"id":48004,"name":"Constable Trundle","num":4},{"id":48005,"name":"Worldbreaker Trundle","num":5}],"allytips":["Trundle excels at fighting within his Frozen Domain. Try to draw enemies onto it.","Use Subjugate to soften a powerful enemy tank or to create a target for your team to focus fire.","Chomp is good for lowering the physical damage of enemies; try to focus it on enemy physical damage dealers."],"enemytips":["Trundle is very powerful at location-based combat. Try to draw him off of his Frozen Domain.","Make sure to get out of his Pillar of Ice as quickly as possible, as it significantly slows you down."],"tags":["Fighter","Tank"],"info":{"attack":7,"defense":6,"magic":2,"difficulty":5},"stats":{"arm":27.536,"ad":60.04,"aso":-0.0672,"crit":0,"hp":616.28,"mp":281.6,"mp5":7.508,"hp5":6,"range":175,"ms":350,"mr":32.1,"lvl":{"arm":2.7,"ad":3,"aso":2.9,"crit":0,"hp":96,"mp":45,"mp5":0.6,"hp5":0.75,"mr":1.25}},"pass":{"name":"King's Tribute","descr":"When an enemy unit dies near Trundle, he heals for a percent of its maximum Health.","img":"Trundle_Passive.png"},"spells":[{"name":"Chomp","descr":"Trundle bites his opponent, dealing damage, briefly slowing and sapping some of their Attack Damage.","tooltip":"Trundle lunges at his opponent with his next basic attack, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and briefly slowing his target.\u003Cbr\u003E\u003Cbr\u003EThis attack increases Trundle's Attack Damage by {{ e3 }} for {{ e6 }} seconds, with his opponent losing half of this amount.","cost":[30,30,30,30,30],"costType":" Mana","cd":[4,4,4,4,4],"range":[300,300,300,300,300],"key":"TrundleQ"},{"name":"Frozen Domain","descr":"Trundle turns target location into his domain, gaining Attack Speed, Movement Speed, and increased healing from all sources while on it.","tooltip":"Trundle coats target location with ice for {{ e4 }} seconds, gaining {{ e1 }}% Movement Speed, {{ e2 }}% Attack Speed and {{ e3 }}% increased healing and regeneration from all sources.","cost":[60,60,60,60,60],"costType":" Mana","cd":[15,15,15,15,15],"range":[750,750,750,750,750],"key":"TrundleW"},{"name":"Pillar of Ice","descr":"Trundle creates an ice pillar at target location, becoming impassable terrain and slowing all nearby enemy units.","tooltip":"Trundle creates an icy pillar at target location for {{ e1 }} seconds, becoming impassable terrain and slowing all nearby enemy units by {{ e2 }}%.","cost":[75,75,75,75,75],"costType":" Mana","cd":[22,20,18,16,14],"range":[1000,1000,1000,1000,1000],"key":"TrundleE"},{"name":"Subjugate","descr":"Trundle immediately steals a percent of his target's Health, Armor and Magic Resistance. Over the next 4 seconds the amount of Health, Armor, and Magic Resistance stolen is doubled.","tooltip":"Trundle drains {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E% of an enemy champion's maximum Health as Magic Damage and {{ e2 }}% of their Armor and Magic Resist, half immediately and half over {{ e3 }} seconds. The Armor and Magic Resist is returned {{ e3 }} seconds after the drain ends.","cost":[100,100,100],"costType":" Mana","cd":[110,90,70],"range":[650,650,650],"key":"TrundleR"}]}