{"id":161,"key":"Velkoz","name":"Vel'Koz","title":"the Eye of the Void","lore":"I pass into the sudden glare. Blink. Blink, blink, blink. My eyes adjust and evaluate the landscape before me.\u003Cbr\u003E\u003Cbr\u003EThere's a scurrying. I look down to find a small, white creature standing on its hind legs, sniffing at my body. It intrigues me.\u003Cbr\u003E\u003Cbr\u003EWhat use are you?\u003Cbr\u003E\u003Cbr\u003EI analyze the creature. A flash of hot magenta light, a dust pile where it was quivering.\u003Cbr\u003E\u003Cbr\u003EMammalian... Nocturnal... Impeccable hearing. Incredibly weak. Yet they breed so prodigiously.\u003Cbr\u003E\u003Cbr\u003E''Hm,'' I mutter to myself. Hopefully there will be more complex things to be found; those fascinate me.\u003Cbr\u003E\u003Cbr\u003EConsume and learn: this is my purpose. The others who travel with me are primitive: kill and eat, kill and eat. I need to gather all available information - harvest any valuable resources.\u003Cbr\u003E\u003Cbr\u003EEventually, we come upon a destroyed city, save for one pristine tower. It appears to be protected - or intentionally left standing. I deconstruct the composition of the ruins. My analysis suggests this habitat was a place of great magic; I'm not surprised it was a target of such destruction. There is something compelling about the tower. While the others are off scavenging, I enter the citadel.\u003Cbr\u003E\u003Cbr\u003ECryptic instruments are strewn about. I examine one. Another flash of hot magenta light, another dust pile.\u003Cbr\u003E\u003Cbr\u003EFascinating: a tool to alter their concept of time.\u003Cbr\u003E\u003Cbr\u003EStrange.\u003Cbr\u003E\u003Cbr\u003EUnprecedented.\u003Cbr\u003E\u003Cbr\u003EFrom the state of the tower, it seems the owner departed only recently. The artifacts left behind have existed in more than one time and place. Some are more complex than others; all are more impressive than anything I have seen on this plane. Clearly, the owner knows things I have not encountered in any of my travels.\u003Cbr\u003E\u003Cbr\u003EI require such knowledge.\u003Cbr\u003E\u003Cbr\u003ELeaving the tower, I find the others closing in on the entrance, ready to destroy it as they have destroyed everything else we have met. They will only get in the way of my goal. There are some things the Void should not consume indiscriminately.\u003Cbr\u003E\u003Cbr\u003EWithout warning, I lash out a tentacle, its tip glowing white hot. Lightning arcs through the first creature, knocking it back. Its screams fade as I extend all three limbs, energy crackling between them, scorching the air where the streams meet. The other two run; they know what's coming.\u003Cbr\u003E\u003Cbr\u003EMust they always flee?\u003Cbr\u003E\u003Cbr\u003EI open my eye wide and unleash a beam of energy, following the escaping creatures. They are instantly reduced to ash. ''Hmm. Void-native melting point is inconsistent,'' I note.\u003Cbr\u003E\u003Cbr\u003EBut that is of no consequence. The hunger inside me grows. I am ravenous. Insatiable, as never before.\u003Cbr\u003E\u003Cbr\u003EI have glimpsed the ultimate knowledge.\u003Cbr\u003E\u003Cbr\u003EAnd I will have it.","skins":[{"id":161000,"name":"default","num":0},{"id":161001,"name":"Battlecast Vel'Koz","num":1},{"id":161002,"name":"Arclight Vel'Koz","num":2},{"id":161003,"name":"Definitely Not Vel'Koz","num":3}],"allytips":["When laning, use Void Rift to kill minions while building stacks of Organic Deconstruction on your opponent. You can then follow up with your other abilities.","Shooting Plasma Fission diagonally and splitting at maximum range allows you to hit opponents that are out of the range of the initial missile, but is more challenging to pull off.","Be very careful about when to use Life Form Disintegration Ray. Many champions have abilities that can interrupt the spell."],"enemytips":["Vel'Koz is very dangerous if left alone in a fight. Try to focus him down early.","Vel'Koz has fairly low mobility and is vulnerable to ganks.","Life Form Disintegration Ray can be interrupted by stuns, silences and knockups."],"tags":["Mage"],"info":{"attack":2,"defense":2,"magic":10,"difficulty":8},"stats":{"arm":21.88,"ad":54.9379,"aso":0,"crit":0,"hp":507.68,"mp":375.6,"mp5":6,"hp5":5.424,"range":525,"ms":340,"mr":30,"lvl":{"arm":3.5,"ad":3.1416,"aso":1.36,"crit":0,"hp":76,"mp":42,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Organic Deconstruction","descr":"Vel'Koz's abilities apply \u003Cfont color='#FFFFFF'\u003EOrganic Deconstruction\u003C\/font\u003E to enemies on hit. If 3 stacks are accumulated, the enemy will take a burst of true damage.","img":"Velkoz_Passive.png"},"spells":[{"name":"Plasma Fission","descr":"Vel'Koz shoots a bolt of plasma that splits in two on reactivation or upon hitting an enemy. The bolt slows and damages on hit.","tooltip":"Vel'Koz shoots a plasma bolt that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and applies a slow of {{ e5 }}% that decays over {{ e4 }} second(s).\u003Cbr\u003E\u003Cbr\u003EUpon reactivation or upon hitting an enemy, the bolt splits at a 90 degree angle.\u003Cbr\u003E\u003Cbr\u003EKilling a unit with this refunds {{ e2 }}% of the \u003Cspan class=\"color44DDFF\"\u003EMana Cost\u003C\/span\u003E.","cost":[40,45,50,55,60],"costType":" Mana","cd":[7,7,7,7,7],"range":[1050,1050,1050,1050,1050],"key":"VelkozQ"},{"name":"Void Rift","descr":"Vel'Koz opens a rift to the void that deals an initial burst of damage, then explodes for a second burst of damage after a delay.","tooltip":"Vel'Koz opens a rift to the void that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage. After a delay, it deals an additional {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage.\u003Cbr\u003E\u003Cbr\u003EVoid Rift has a 2 second cooldown between casts.","cost":[50,55,60,65,70],"costType":" Mana","cd":[1.5,1.5,1.5,1.5,1.5],"range":[1050,1050,1050,1050,1050],"key":"VelkozW"},{"name":"Tectonic Disruption","descr":"Vel'Koz causes an area to explode, knocking up enemies, and knocking close enemies slightly away.","tooltip":"Vel'Koz disrupts a nearby area which, after a delay, deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and knocks up enemies hit for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAny enemies hit that are close to Vel'Koz will be pushed slightly in the direction the ability was cast.","cost":[50,55,60,65,70],"costType":" Mana","cd":[16,15,14,13,12],"range":[810,810,810,810,810],"key":"VelkozE"},{"name":"Life Form Disintegration Ray","descr":"Vel'Koz unleashes a channelled beam that follows the cursor for 2.5 seconds that deals magic damage. Organic Deconstruction Researches enemy champions causing them to take true damage instead.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EDeconstructing enemy Champions \u003Cspan class=\"colorFFFFFF\"\u003EResearches\u003C\/span\u003E them for {{ e2 }} seconds. Basic attacks and all abilities refresh Research.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EVel'Koz channels a ray of energy that follows the cursor for 2.5 seconds, dealing Magic Damage up to a total of {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E and slowing units hit by {{ e3 }}%.\u003Cbr\u003E\u003Cbr\u003EEnemies that stay in the beam will periodically gain \u003Cspan class=\"colorFFFFFF\"\u003EOrganic Deconstruction\u003C\/span\u003E stacks. Deals True Damage instead of Magic against \u003Cspan class=\"colorFFFFFF\"\u003EResearched\u003C\/span\u003E units.","cost":[100,100,100],"costType":"Mana","cd":[120,100,80],"range":[1575,1575,1575],"key":"VelkozR"}]}