{"id":24,"key":"Jax","name":"Jax","title":"Grandmaster at Arms","lore":"It is seldom the case where a champion is defined by his actions after joining the League of Legends rather than before. Such is the case with Jax, for whom the argument could be made that he is the most prolific tournament fighter currently at the Institute of War. Before joining the League, Jax was an unremarkable soldier-for-hire. For reasons known only to the former leader of the League, High Councilor Reginald Ashram, Jax was put on the top of the list of candidates to receive a League Judgment - the interview process that either accepts or rejects a prospective champion. His Judgment was the quickest in League history, where the Doors of Acceptance glowed and slowly swung open as soon as it began. Jax faced no recorded Observation or Reflection during his Judgment.\u003Cbr\u003E\u003Cbr\u003EJax proved himself to be an immediate terror in the Fields of Justice. The self-proclaimed ''Armsmaster of the League'' rattled off a streak of consecutive wins that to this day has not been matched. A number of summoners in the League grew concerned that the perceived objectivity of the League of Legends would be questioned by the presence of an unknown fighter who was unbeatable. For this reason, the new leader of the League (following Reginald Ashram's disappearance), High Councilor Heyward Relivash, created special restrictions for Jax to fight under. This was something the League had never done before, and something that has never been done since. The burly fighter responded by imposing his own special conditions; as a means of protest, he permitted himself to fight using only a brass lamppost. Neither the League's sanctions nor his own has affected his winning ways. The League has since rescinded its sanctions, but Jax has not; he fights and fights well with his trusty brass lamppost.\u003Cbr\u003E\u003Cbr\u003E''Be advised - there has been an outbreak of lamppost-shaped bruises in the League of Legends.''\u003Cbr\u003E-- Gragas","skins":[{"id":24000,"name":"default","num":0},{"id":24001,"name":"The Mighty Jax","num":1},{"id":24002,"name":"Vandal Jax","num":2},{"id":24003,"name":"Angler Jax","num":3},{"id":24004,"name":"PAX Jax","num":4},{"id":24005,"name":"Jaximus","num":5},{"id":24006,"name":"Temple Jax","num":6},{"id":24007,"name":"Nemesis Jax","num":7},{"id":24008,"name":"SKT T1 Jax","num":8},{"id":24012,"name":"Warden Jax","num":12}],"allytips":["Jax can Leap Strike to friendly units, including wards. You can use them to plan your escape.","Jax benefits greatly from items that have both Ability Power and Attack Damage such as Guinsoo's Rageblade and Hextech Gunblade."],"enemytips":["Try to engage him in short bursts instead of going toe-to-toe with him. Preventing him from attacking consecutively drastically lowers his damage output.","Jax can dodge all incoming attacks for a very short amount of time and stuns enemies in melee range when it ends. Wait to strike him until after his dodge is finished."],"tags":["Fighter","Assassin"],"info":{"attack":7,"defense":5,"magic":7,"difficulty":5},"stats":{"arm":27.04,"ad":61.97,"aso":-0.02,"crit":0,"hp":592.8,"mp":338.8,"mp5":7.576,"hp5":8.374,"range":125,"ms":350,"mr":32.1,"lvl":{"arm":3,"ad":3.375,"aso":3.4,"crit":0,"hp":85,"mp":32,"mp5":0.7,"hp5":0.55,"mr":1.25}},"pass":{"name":"Relentless Assault","descr":"Jax's consecutive basic attacks continuously increase his Attack Speed.","img":"Armsmaster_MasterOfArms.png"},"spells":[{"name":"Leap Strike","descr":"Jax leaps toward a unit. If they are an enemy, he strikes them with his weapon.","tooltip":"Jax leaps to target unit, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage if it is an enemy.","cost":[65,65,65,65,65],"costType":" Mana","cd":[10,9,8,7,6],"range":[700,700,700,700,700],"key":"JaxQ"},{"name":"Empower","descr":"Jax charges his weapon with energy, causing his next attack to deal additional damage.","tooltip":"Jax charges his weapon with energy, causing his next basic attack or Leap Strike to deal an additional {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}) \u003C\/span\u003EMagic Damage.","cost":[30,30,30,30,30],"costType":" Mana","cd":[7,6,5,4,3],"range":[300,300,300,300,300],"key":"JaxW"},{"name":"Counter Strike","descr":"Jax's combat prowess allows him to dodge all incoming attacks for a short duration and then quickly counterattack, stunning all surrounding enemies.","tooltip":"Jax enters a defensive stance for up to {{ e6 }} seconds, dodging all incoming basic attacks and taking {{ e3 }}% less damage from area of effect abilities.\u003Cbr\u003E\u003Cbr\u003EAfter 2 seconds or if activated again, Jax stuns surrounding enemies for {{ e2 }} second and deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E physical damage to them.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003ECounter Strike deals {{ e5 }}% more damage for each attack Jax dodged (max: {{ e4 }}% increased damage).\u003C\/span\u003E","cost":[50,60,70,80,90],"costType":" Mana","cd":[16,14,12,10,8],"range":[300,300,300,300,300],"key":"JaxE"},{"name":"Grandmaster's Might","descr":"Every third consecutive attack deals additional Magic Damage. Additionally, Jax can activate this ability to strengthen his resolve, increasing his Armor and Magic Resist for a short duration.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Every third consecutive strike Jax deals {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }}) \u003C\/span\u003Eadditional Magic Damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Jax strengthens his resolve, granting him \u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E Armor and \u003Cspan class=\"color99FF99\"\u003E{{ f1 }}\u003C\/span\u003E Magic Resist for {{ e5 }} seconds.\u003Cspan class=\"colorFF8C00\"\u003E\u003Cbr\u003E\u003Cbr\u003EArmor bonus is equal to {{ e3 }} + {{ e6 }}% bonus Attack Damage.\u003C\/span\u003E\u003Cspan class=\"color99FF99\"\u003E\u003Cbr\u003EMagic Resist bonus is equal to {{ e3 }} + {{ e7 }}% Ability Power.\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[80,80,80],"range":[100,100,100],"key":"JaxR"}]}