{"id":56,"key":"Nocturne","name":"Nocturne","title":"the Eternal Nightmare","lore":"Before Nocturne, people believed that dreams were figments of their imagination, meaningless images that flashed through the mind when one slept. This belief was put to the test when a rash of sleep-related incidents started afflicting summoners of the League. Some would wake up screaming, terrified and beyond consolation. Some could not fall asleep, slowly going mad as the nights ticked by. Some simply never woke up. Physicians were baffled until a Field Architect happened to pass out next to a nexus on Twisted Treeline. Witnesses said he cried out once and then stopped breathing. Immediately after, magical energy arced out from the nexus, and Nocturne appeared.\u003Cbr\u003E\u003Cbr\u003ENocturne did not take his introduction to this world kindly. He slaughtered everything he could find before summoners were able to magically confine him. After a period of intense study, League experts divined that Nocturne hunted summoners in their sleep, attacking them in a place where their magic was useless. This seemed to be his only purpose. The families of the victims demanded justice, but League officials were concerned that death might only return Nocturne to the place from which he came. They bound him to a nexus fragment, trapping him in the physical world. As punishment for his crimes, they allowed summoners to call upon Nocturne in the League matches, bending his will to the summoners he hates and creating his own personal nightmare. League scholars don't know whether he truly came from the plane of dreams, or whether there are any more like him. Some theorize that the summoning act affected summoners' subconscious minds, luring Nocturne to them in their sleep. Perhaps the most disturbing theory is that Nocturne is a person's nightmare come to life. If this is true, they wonder, who is the dreamer?\u003Cbr\u003E\u003Cbr\u003E''The darkness is closing in...it's pitch black now...but I can still see him...''\u003Cbr\u003E- Kelvin Ma, patient #4236","skins":[{"id":56000,"name":"default","num":0},{"id":56001,"name":"Frozen Terror Nocturne","num":1},{"id":56002,"name":"Void Nocturne","num":2},{"id":56003,"name":"Ravager Nocturne","num":3},{"id":56004,"name":"Haunting Nocturne","num":4},{"id":56005,"name":"Eternum Nocturne","num":5},{"id":56006,"name":"Cursed Revenant Nocturne","num":6}],"allytips":["Using Paranoia at a critical moment is well worth it even if you cannot use the dash.","Duskbringer isn't only an offensive ability. It can be used to close distance out of combat or escape from certain death.","Use Shroud of Darkness in tandem with Paranoia's dash. Your opponents may panic and waste a critical disable on your spell shield."],"enemytips":["Stay close to your allies when Paranoia is cast - there is strength in numbers!","Nocturne's Unspeakable Horror is broken with range, so try to save your movement abilities for when he casts it."],"tags":["Assassin","Fighter"],"info":{"attack":9,"defense":5,"magic":2,"difficulty":4},"stats":{"arm":26.88,"ad":59.208,"aso":-0.065,"crit":0,"hp":582.8,"mp":273.8,"mp5":6.756,"hp5":8.26,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.1,"aso":2.7,"crit":0,"hp":85,"mp":35,"mp5":0.45,"hp5":0.75,"mr":1.25}},"pass":{"name":"Umbra Blades","descr":"Every 10 seconds, Nocturne's next attack strikes surrounding enemies for 120% physical damage and heals himself. \u003Cbr\u003E\u003Cbr\u003ENocturne's basic attacks reduce this cooldown by 1 second.","img":"Nocturne_UmbraBlades.png"},"spells":[{"name":"Duskbringer","descr":"Nocturne throws a shadow blade that deals damage, leaves a Dusk Trail, and causes champions to leave a Dusk Trail. While on the trail, Nocturne can move through units and has increased Movement Speed and Attack Damage.","tooltip":"Nocturne throws a shadow blade that deals {{ e2 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage and leaves a Dusk Trail for {{ e3 }} seconds. Enemy champions hit also leave a Dusk Trail.\u003Cbr\u003E\u003Cbr\u003EWhile on the trail, Nocturne can move through units and gains {{ e1 }}% Movement Speed and {{ e4 }} Attack Damage.","cost":[60,65,70,75,80],"costType":" Mana","cd":[10,10,10,10,10],"range":[1125,1125,1125,1125,1125],"key":"NocturneQ"},{"name":"Shroud of Darkness","descr":"Nocturne empowers his blades, passively gaining Attack Speed. Activating Shroud of Darkness allows Nocturne to fade into the shadows, creating a magical barrier which blocks a single enemy ability and doubles his passive Attack Speed if successful.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Nocturne gains {{ e1 }}% Attack Speed.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Nocturne creates a magical barrier for 1.5 seconds, which blocks the next enemy ability.\u003Cbr\u003E\u003Cbr\u003EIf an ability is blocked by the shield, Nocturne's passive Attack Speed bonus doubles for 5 seconds.","cost":[50,50,50,50,50],"costType":" Mana","cd":[20,18,16,14,12],"range":[20,20,20,20,20],"key":"NocturneW"},{"name":"Unspeakable Horror","descr":"Nocturne plants a nightmare into his target's mind, dealing damage each second and terrifying the target if they do not get out of range by the end of the duration.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Nocturne gains massively increased Movement Speed toward terrified enemies.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Nocturne plants a nightmare into his target's mind, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage over {{ e3 }} seconds. If Nocturne stays within range of the target for the full duration, the target becomes terrified for {{ e2 }} second(s).","cost":[60,65,70,75,80],"costType":" Mana","cd":[15,14,13,12,11],"range":[425,425,425,425,425],"key":"NocturneE"},{"name":"Paranoia","descr":"Nocturne reduces the sight radius of all enemy champions and removes their ally vision in the process. He can then launch himself at a nearby enemy champion.","tooltip":"Nocturne reduces the sight radius of all enemy champions and removes their ally vision for 4 seconds.\u003Cbr\u003E\u003Cbr\u003EWhile Paranoia is active, Nocturne can launch himself at an enemy champion, dealing {{ e3 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage.","cost":[100,100,100],"costType":" Mana","cd":[150,125,100],"range":[2500,3250,4000],"key":"NocturneR"}]}