{"id":83,"key":"Yorick","name":"Yorick","title":"Shepherd of Souls","lore":"''These isles… How they scream.''\u003Cbr\u003EThe last survivor of a long-forgotten religious order, Yorick is both blessed and cursed with power over the dead. Trapped on the Shadow Isles, his only companions are the rotting corpses and shrieking spirits that he gathers to him. Yorick's monstrous actions belie his noble purpose: to free his home from the curse of the Ruination.","skins":[{"id":83000,"name":"default","num":0},{"id":83001,"name":"Undertaker Yorick","num":1},{"id":83002,"name":"Pentakill Yorick","num":2}],"allytips":["You do not need to cast Awakening to regain the ability to cast Last Rites.","The Maiden will attempt to assist you in a fight, so choose your targets well.","You can send the Maiden down a lane alone, be careful though, as she represents a large portion of your combat power."],"enemytips":["You can cast Smite on Mist Walkers and the Maiden of the Mist to damage or kill them.","Try to thin out Yorick's minions before you engage him, Mist Walkers will die from a basic attack or a single target spell.","You can attack Dark Procession to break the wall down."],"tags":["Fighter","Tank"],"info":{"attack":6,"defense":6,"magic":4,"difficulty":6},"stats":{"arm":30,"ad":57,"aso":0,"crit":0,"hp":580,"mp":300,"mp5":7.5,"hp5":8,"range":175,"ms":340,"mr":32,"lvl":{"arm":4,"ad":5,"aso":2,"crit":0,"hp":100,"mp":40,"mp5":0.75,"hp5":0.8,"mr":1.25}},"pass":{"name":"Shepherd of Souls","descr":"\u003CmainText\u003EYorick can raise Mist Walkers with his abilities. Enemies that die near Yorick will sometimes leave a grave.\u003C\/mainText\u003E","img":"Yorick_P.png"},"spells":[{"name":"Last Rites","descr":"Yorick deals bonus damage on his next attack and heals himself. If the target dies a grave will be dug.","tooltip":"Yorick's next basic attack deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and restores {{ f1 }} Health (doubled when below half Health). Last Rites will leave a grave if it kills the target.\u003Cbr\u003E\u003Cbr\u003EWhen there are three or more graves nearby and Last Rites has been used, Yorick can cast Awakening to raise Mist Walkers from graves.\u003C\/span\u003E","cost":[25,25,25,25,25],"costType":" Mana","cd":[7,6.5,6,5.5,5],"range":[0,0,0,0,0],"key":"YorickQ"},{"name":"Dark Procession","descr":"Yorick summons a destructible wall at target location that will block enemy movement.","tooltip":"Yorick summons a destructible wall of spirits with {{ e5 }} Health around target area for {{ e1 }} seconds. Allies can walk through the wall freely.","cost":[70,70,70,70,70],"costType":" Mana","cd":[20,18,16,14,12],"range":[600,600,600,600,600],"key":"YorickW"},{"name":"Mourning Mist","descr":"Yorick throws a globule of Black Mist that damages, slows and marks enemies.","tooltip":"Yorick throws a globule of Black Mist that deals {{ e7 }}% of enemy's current Health as magic damage (minimum {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E), slows by {{ e3 }}% for {{ e6 }} seconds, and marks champions and monsters for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EYorick and his minions are hasted by {{ e5 }}% while moving toward the mark.","cost":[50,55,60,65,70],"costType":" Mana","cd":[12,11,10,9,8],"range":[700,700,700,700,700],"key":"YorickE"},{"name":"Eulogy of the Isles","descr":"Yorick summons the Maiden of the Mist that causes Yorick's attacks against the Maiden's target to deal bonus damage. The Maiden will also automatically raise Walkers from dead enemies.","tooltip":"Yorick summons The Maiden of the Mist and {{ e1 }} Mist Walkers. The Maiden has {{ e3 }} \u003Cspan class=\"colorFF3300\"\u003E(+{{ f1 }})\u003C\/span\u003E Health, deals {{ e4 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E magic damage, and raises Mist Walkers from nearby enemy deaths.\u003Cbr\u003E\u003Cbr\u003EWhen Yorick damages the Maiden's target he will deal {{ e5 }}% of their max Health as bonus magic damage ({{ e7 }} second cooldown).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorDDDD77\"\u003EIf the Maiden is summoned inside a lane, she will start pushing the lane.\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[160,150,140],"range":[600,600,600],"key":"YorickR"}]}