{"id":18,"key":"Tristana","name":"Tristana","title":"the Yordle Gunner","lore":"Greatness comes in all shapes and sizes, as proven by this diminutive, cannon-wielding yordle. In a world fraught with turmoil, Tristana refuses to back down from any challenge. She represents the pinnacle of martial proficiency, unwavering courage, and boundless optimism. For Trist and her gun, Boomer, every mission is a chance to prove that heroes do exist.","skins":[{"id":18000,"name":"default","num":0},{"id":18001,"name":"Riot Girl Tristana","num":1},{"id":18002,"name":"Earnest Elf Tristana","num":2},{"id":18003,"name":"Firefighter Tristana","num":3},{"id":18004,"name":"Guerilla Tristana","num":4},{"id":18005,"name":"Buccaneer Tristana","num":5},{"id":18006,"name":"Rocket Girl Tristana","num":6},{"id":18010,"name":"Dragon Trainer Tristana","num":10},{"id":18011,"name":"Bewitching Tristana","num":11}],"allytips":["Her massive gun allows Tristana to fire on targets at a great distance. Utilize this to prevent your enemies from ever laying a hand on you.","Use Rocket Jump after you have stacked up your Explosive Charge on an enemy to finish them off with a burst of damage.","Use Rapid Fire to help stack up your Explosive Charge on enemy champions."],"enemytips":["If you see Tristana activate Rapid Fire in a fight, stun her and try to back off until the spell dissipates.","Stand away from your creeps in a lane to take less collateral damage from Explosive Charge."],"tags":["Marksman","Assassin"],"info":{"attack":9,"defense":3,"magic":5,"difficulty":4},"stats":{"arm":22,"ad":56.96,"aso":-0.0473,"crit":0,"hp":542.76,"mp":246.76,"mp5":7.206,"hp5":6.192,"range":550,"ms":325,"mr":30,"lvl":{"arm":3,"ad":2.41,"aso":1.5,"crit":0,"hp":82,"mp":32,"mp5":0.45,"hp5":0.65,"mr":0}},"pass":{"name":"Draw a Bead","descr":"Increases Tristana's Attack Range as she levels.","img":"Tristana_Passive.png"},"spells":[{"name":"Rapid Fire","descr":"Tristana fires her weapon rapidly, increasing her Attack Speed for a short time.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EIncreases Tristana's Attack Speed by {{ e1 }}% for {{ e2 }} seconds.","cost":[0,0,0,0,0],"costType":"No Cost","cd":[20,19,18,17,16],"range":[20,20,20,20,20],"key":"TristanaQ"},{"name":"Rocket Jump","descr":"Tristana fires at the ground to propel her to a distant location, dealing damage and slowing surrounding units for a brief period where she lands.","tooltip":"Tristana launches herself to target location, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and slowing surrounding enemies by {{ e3 }}% for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EKills, Assists, and max stack Explosive Charge detonations on Champions reset Rocket Jump's cooldown.","cost":[60,60,60,60,60],"costType":" Mana","cd":[22,20,18,16,14],"range":[900,900,900,900,900],"key":"TristanaW"},{"name":"Explosive Charge","descr":"When Tristana kills a unit, her cannonballs burst into shrapnel, dealing damage to surrounding enemies. Can be activated to place a bomb on a target enemy that explodes after a short duration dealing damage to surrounding units.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EEnemies explode when slain by Tristana's basic attacks, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E Magic Damage to nearby enemies.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EPlaces a bomb on an enemy or turret that explodes after 4 seconds, dealing {{ e4 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Physical Damage. Each attack and ability charges the bomb's damage by +{{ e6 }}%.\u003Cbr\u003E\u003Cbr\u003EAt 4 charges, the bomb explodes immediately. The detonation radius is twice as large if used on a turret.","cost":[70,75,80,85,90],"costType":" Mana","cd":[16,15.5,15,14.5,14],"range":[550,550,550,550,550],"key":"TristanaE"},{"name":"Buster Shot","descr":"Tristana loads a massive cannonball into her weapon and fires it at an enemy unit. This deals Magic Damage and knocks the target back. If the target is carrying the Explosive Charge bomb, the bomb detonation radius is doubled.","tooltip":"Tristana fires a massive cannonball at an enemy unit. This deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Magic Damage and knocks surrounding units back {{ e2 }} distance.","cost":[100,100,100],"costType":" Mana","cd":[100,85,70],"range":[550,550,550],"key":"TristanaR"}]}