{"id":223,"key":"TahmKench","name":"Tahm Kench","title":"the River King","lore":"''The whole world's a river, and I'm its king.''\u003Cbr\u003ETahm Kench travels Runeterra's waterways, feeding his insatiable appetite with the misery of the unsuspecting. The singularly charming gourmand savors every moment of his victims' suffering.  A deal with Two-Coats may carry you to wherever you wish, but your journey will most assuredly end in the depths of despair.","skins":[{"id":223000,"name":"default","num":0},{"id":223001,"name":"Master Chef Tahm Kench","num":1},{"id":223002,"name":"Urf Kench","num":2}],"allytips":["Your most important function as a support is to keep fragile allies safe. Keep Devour's range and cooldown in mind and position accordingly!","Consider carefully when to use Thick Skin's active. Sometimes shielding early to avoid further damage is good, but sometimes the healing is more beneficial."],"enemytips":["When you see Tahm Kench use the shield from Thick Skin, remember that he just opted out of a good deal of healing. He will also not accumulate new gray health until Thick Skin comes off cooldown. Use this to your advantage!","If Tahm Kench harasses you by spitting minions at you, try going in for a trade right after he spits. His Devour will be on cooldown and you should be able to trade favourably if he can't eat you."],"tags":["Support","Tank"],"info":{"attack":3,"defense":9,"magic":6,"difficulty":5},"stats":{"arm":27,"ad":56,"aso":0,"crit":0,"hp":610,"mp":325,"mp5":8,"hp5":6.5,"range":175,"ms":335,"mr":32.1,"lvl":{"arm":3.5,"ad":3.2,"aso":2.5,"crit":0,"hp":95,"mp":40,"mp5":1,"hp5":0.55,"mr":1.25}},"pass":{"name":"An Acquired Taste","descr":"Tahm Kench puts the heft of his immense body behind his attacks and abilities, gaining extra damage based on his total health. Damaging enemy champions builds stacks of An Acquired Taste. At three stacks, he can use Devour on an enemy champion.","img":"TahmKench_P.png"},"spells":[{"name":"Tongue Lash","descr":"Tahm Kench lashes out with his tongue, damaging and slowing the first unit hit. This ability gains a stun after three stacks of An Acquired Taste.","tooltip":"Damage the first enemy hit for {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slow them by {{ e4 }}% for {{ e5 }}s. Champions with 3 stacks of An Acquired Taste will additionally be stunned for {{ e6 }}s.\u003Cbr\u003E\u003Cbr\u003EActivate \u003Cspan class=\"color0bf7de\"\u003EDevour\u003C\/span\u003E while your tongue is in midair to devour monsters\/minions from a distance.","cost":[50,50,50,50,50],"costType":" Mana","cd":[6,6,6,6,6],"range":[800,800,800,800,800],"key":"TahmKenchQ"},{"name":"Devour","descr":"Tahm Kench devours a target, dealing a percentage of their maximum health as magic damage. He can spit devoured minions and monsters out as a skillshot that deals magic damage in an area upon impact.","tooltip":"Devour a target for {{ e1 }}s (half that for enemy champions.) Enemies are dealt {{ e3 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}%)\u003C\/span\u003E of their maximum health as magic damage (maximum of {{ e2 }} against neutral monsters).\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EEnemy Champions:\u003C\/span\u003E Requires 3 stacks of An Acquired Taste to be devoured. While holding an enemy champion, Tahm Kench is slowed by 95%. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EAllied Champions:\u003C\/span\u003E While holding an allied champion, Tahm Kench gains {{ e4 }}% movement speed toward enemy champions.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EMinions and Monsters:\u003C\/span\u003E Reactivate to spit them, dealing {{ e7 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage to targets hit.","cost":[90,90,90,90,90],"costType":" Mana","cd":[14,13,12,11,10],"range":[250,250,250,250,250],"key":"TahmKenchW"},{"name":"Thick Skin","descr":"Tahm Kench turns incoming damage into gray health. As gray health decays, Tahm Kench is healed for a percentage of the gray health amount. When activated, this ability turns all gray health into a shield.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E {{ e3 }}% of the Damage taken while this ability is not cooling down is converted to gray health. If allowed to decay, {{ e2 }}% of gray health will turn back into health.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E Convert all of your gray health into a shield that lasts {{ e1 }} seconds.","cost":[50,50,50,50,50],"costType":" Mana","cd":[6,6,6,6,6],"range":[1,1,1,1,1],"key":"TahmKenchE"},{"name":"Abyssal Voyage","descr":"Tahm Kench teleports across the map, and he may bring one ally champion with him.","tooltip":"Begin to channel for up to 6 seconds. During this time, one ally champion can right click Tahm Kench to join in. Alternatively, reactivate this ability to travel alone. On reactivation or once an ally has opted in, Tahm travels to the target location. Incoming champion damage breaks the channel.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorcccccc\"\u003E\u003Ci\u003E'Boy, the world's one river, and I'm its king. Ain't no place I ain't been; ain't no place I can't go again.'\u003C\/i\u003E\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[120,110,100],"range":[4500,5500,6500],"key":"TahmKenchR"}]}