{"id":16,"key":"Soraka","name":"Soraka","title":"the Starchild","lore":"A healer gifted with the magic of the stars, Soraka holds all living creatures close to her heart. She was once a celestial being, but she sacrificed her immortality and entered the world of mortals. So long as evil threatens life in Valoran, Soraka will not allow herself peace.\u003Cbr\u003E\u003Cbr\u003ESoraka lived for centuries in an enchanted grove. A being of the stars, she healed the wounded and sick that sought her out. One man called Warwick came to her grove and begged her to heal his wife, who lay lifeless in his arms. His despair touched Soraka's heart. Though it was too late to save his wife, she offered to help heal the pain of his loss. Unwilling to let go of his grief Warwick ran from the grove, but returned over the following days to hear Soraka's guidance. She began to grow attached to the grieving man. One day Warwick told her he had found the men who killed his wife. He believed revenge would heal his pain - and if he died fighting, he would at least find peace. Though she pleaded with him, Warwick ignored her and left the grove. The voices of the stars warned her not to follow him, but Soraka had to intervene.\u003Cbr\u003E\u003Cbr\u003EShe stepped into the mortal world for the first time, and soon found Warwick desperately fighting a group of men. She tried to heal him, but for every wound she closed, the men inflicted two more. Soraka realized that she would have to fight to save her friend. The stars screamed in her mind, telling her not to use her powers for harm. Ignoring their warning, she struck the attackers with a flash of brilliant light. Crying out in terror and shielding their eyes from her divine radiance, they fled. Soraka's celestial form faded and the stars fell silent - for her transgression, she became mortal. She still felt the power of the stars within her, but they no longer offered her guidance. She took comfort in Warwick's safety, gently healing his wounds, but the man she had called her friend slipped a dagger between her ribs. As her blood spilled, Soraka realized he had fooled her, and everything he had done was a complicated ruse. Feeling humiliated and betrayed she called once more on the power of the stars, searing his flesh and cursing his cruelty. He retreated with an agonized howl, leaving Soraka to reflect upon her fate. Though her life had changed, she felt empowered and renewed with a singular purpose. No longer bound to the grove, Soraka set out into the mortal world, vowing to heal the wounded and protect the helpless.\u003Cbr\u003E\u003Cbr\u003E''The cruelty of one will not blind me to the suffering of many.''\u003Cbr\u003E-- Soraka","skins":[{"id":16000,"name":"default","num":0},{"id":16001,"name":"Dryad Soraka","num":1},{"id":16002,"name":"Divine Soraka","num":2},{"id":16003,"name":"Celestine Soraka","num":3},{"id":16004,"name":"Reaper Soraka","num":4},{"id":16005,"name":"Order of the Banana Soraka","num":5},{"id":16006,"name":"Program Soraka","num":6}],"allytips":["Soraka is a powerful ally in battle, using her strong healing to keep the party moving forward.","You can use Wish on your allies from across the map to save them from otherwise fatal events.","Equinox can be used as a powerful zoning tool to keep enemies at bay."],"enemytips":["Focus on attacking Soraka when she ever ventures to the frontline to heal her allies.","Take advantage of Soraka's long cooldown on Equinox if she uses it to harass.","It's easier to focus Soraka than the ally she is healing."],"tags":["Support","Mage"],"info":{"attack":2,"defense":5,"magic":7,"difficulty":3},"stats":{"arm":23.384,"ad":50.04,"aso":0,"crit":0,"hp":529.04,"mp":350.8,"mp5":11.5,"hp5":2.5,"range":550,"ms":325,"mr":30,"lvl":{"arm":3.8,"ad":3,"aso":2.14,"crit":0,"hp":78,"mp":60,"mp5":0.4,"hp5":0.5,"mr":0}},"pass":{"name":"Salvation","descr":"Soraka runs faster towards nearby low health allies.","img":"Soraka_Passive.png"},"spells":[{"name":"Starcall","descr":"A star falls from the sky at the target location dealing magic damage and slowing enemies. If an enemy champion is hit by Starcall, Soraka recovers health and gains movement speed when moving away from enemy champions.","tooltip":"Calls down a star from Soraka to a target location. Enemies standing in the explosion radius take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and are slowed by {{ e2 }}% for 2 seconds.\u003Cbr\u003E\u003Cbr\u003EIf Starcall hits a champion Soraka gains \u003Cspan class=\"colorDDDDDD\"\u003ERejuvenation\u003C\/span\u003E for {{ e5 }} seconds, which restores {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f1 }})\u003C\/span\u003E health per second and grants {{ e9 }}% movement speed when not moving toward enemy champions.","cost":[40,45,50,55,60],"costType":" Mana","cd":[5,5,5,5,5],"range":[810,810,810,810,810],"key":"SorakaQ"},{"name":"Astral Infusion","descr":"Soraka sacrifices a portion of her own health to heal another friendly champion.","tooltip":"Restores {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E health to another champion ally.\u003Cbr\u003E\u003Cbr\u003EIf cast while affected by \u003Cspan class=\"colorDDDDDD\"\u003ERejuvenation\u003C\/span\u003E, Soraka will grant her target its benefits for {{ f1 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color919191\"\u003E\u003Ci\u003ECannot be cast if Soraka is below 5% Health.\u003C\/i\u003E\u003C\/span\u003E","cost":[50,55,60,65,70],"costType":" Mana","cd":[8,6.5,5,3.5,2],"range":[550,550,550,550,550],"key":"SorakaW"},{"name":"Equinox","descr":"Creates a zone at a location that silences all enemies inside. When the zone expires, all enemies still inside are rooted.","tooltip":"Creates a zone at target location for 1.5 seconds, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemy Champions in the cast radius. Enemy Champions standing in the zone are silenced until they leave. \u003Cbr\u003E\u003Cbr\u003EWhen the zone disappears, all enemy Champions still standing in the zone are rooted for {{ e1 }} second(s) and are dealt {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }}) \u003C\/span\u003Emagic damage.","cost":[70,70,70,70,70],"costType":" Mana","cd":[24,22,20,18,16],"range":[925,925,925,925,925],"key":"SorakaE"},{"name":"Wish","descr":"Soraka fills her allies with hope, instantly restoring health to herself and all friendly champions.","tooltip":"Calls upon divine powers to restore {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E Health to all allied Champions. Wish's power is increased by 50% on each Champion below 40% Health.","cost":[100,100,100],"costType":" Mana","cd":[160,145,130],"range":[25000,25000,25000],"key":"SorakaR"}]}