{"id":89,"key":"Leona","name":"Leona","title":"the Radiant Dawn","lore":"''If you would shine like a sun, first you must burn like one.''\u003Cbr\u003E\u003Cbr\u003EImbued with the fire of the sun, Leona is a warrior templar of the Solari who defends Mount Targon with her Zenith Blade and Shield of Daybreak. Her skin shimmers with starfire while her eyes burn with the power of the celestial Aspect within her. Armored in gold and bearing a terrible burden of ancient knowledge, Leona brings enlightenment to some, death to others.","skins":[{"id":89000,"name":"default","num":0},{"id":89001,"name":"Valkyrie Leona","num":1},{"id":89002,"name":"Defender Leona","num":2},{"id":89003,"name":"Iron Solari Leona","num":3},{"id":89004,"name":"Pool Party Leona","num":4},{"id":89008,"name":"PROJECT: Leona","num":8},{"id":89009,"name":"Barbecue Leona","num":9}],"allytips":["Lead the charge and mark your foes with Sunlight before your allies deal damage.","Shield of Daybreak and Zenith Blade form a powerful offensive combo.","You can absorb a huge amount of damage using Eclipse, but you must stay near enemies to gain the bonus duration."],"enemytips":["When Leona activates Eclipse, you have three seconds to get away from her before she deals damage.","Only foes in the center of Solar Flare get stunned, so you can often avoid this if you're quick."],"tags":["Tank","Support"],"info":{"attack":4,"defense":8,"magic":3,"difficulty":4},"stats":{"arm":27.208,"ad":60.04,"aso":0,"crit":0,"hp":576.16,"mp":302.2,"mp5":6,"hp5":8.428,"range":125,"ms":335,"mr":32.1,"lvl":{"arm":3.6,"ad":3,"aso":2.9,"crit":0,"hp":87,"mp":40,"mp5":0.8,"hp5":0.85,"mr":1.25}},"pass":{"name":"Sunlight","descr":"Damaging spells afflict enemies with Sunlight for 3.5 seconds. When allied Champions deal damage to those targets, they consume the Sunlight to deal additional magic damage.","img":"LeonaSunlight.png"},"spells":[{"name":"Shield of Daybreak","descr":"Leona uses her shield to perform her next basic attack, dealing bonus magic damage and stunning the target.","tooltip":"Next basic attack deals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage and stuns for {{ e1 }} second.","cost":[45,50,55,60,65],"costType":" Mana","cd":[9,8,7,6,5],"range":[100,100,100,100,100],"key":"LeonaQ"},{"name":"Eclipse","descr":"Leona raises her shield to gain Armor and Magic Resist. When the duration first ends, if there are nearby enemies, she will deal magic damage to them and prolong the duration of the effect.","tooltip":"Grants {{ e2 }} \u003Cspan class=\"colorFFFF00\"\u003E(+{{ f1 }})\u003C\/span\u003E bonus Armor and {{ e2 }} \u003Cspan class=\"colorFF00FF\"\u003E(+{{ f2 }})\u003C\/span\u003E Magic Resist for {{ e3 }} seconds. When the effect ends, nearby enemies struck take {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and Leona retains her bonus Armor and Magic Resist for {{ e3 }} seconds.","cost":[60,60,60,60,60],"costType":" Mana","cd":[14,14,14,14,14],"range":[450,450,450,450,450],"key":"LeonaW"},{"name":"Zenith Blade","descr":"Leona projects a solar image of her sword, dealing magic damage to all enemies in a line. When the image fades, the last enemy champion struck will be briefly immobilized and Leona will dash to them.","tooltip":"Strikes all enemies in a line dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage. The last enemy Champion struck will be rooted for {{ e2 }} seconds and Leona will dash to them.","cost":[60,60,60,60,60],"costType":" Mana","cd":[13,12,11,10,9],"range":[875,875,875,875,875],"key":"LeonaE"},{"name":"Solar Flare","descr":"Leona calls down a beam of solar energy, dealing damage to enemies in an area. Enemies in the center of the area are stunned, while enemies on the outside are slowed. Afterward, Leona's sword is charged with the power of the sun and deals bonus magic damage for a few attacks.","tooltip":"Calls down a radiant beam of solar energy dealing {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and slowing enemies by {{ e1 }}% for {{ e2 }} seconds. Enemies in the center of the flare are stunned instead of slowed.\u003Cbr\u003E\u003Cbr\u003ELeona's sword remains charged with \u003Cspan class=\"colorFFBB00\"\u003EIncandescence\u003C\/span\u003E, causing her next {{ e5 }} basic attacks to gain 100 range and deal {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E bonus magic damage on hit.","cost":[100,100,100],"costType":" Mana","cd":[90,75,60],"range":[1200,1200,1200],"key":"LeonaR"}]}