{"id":238,"key":"Zed","name":"Zed","title":"the Master of Shadows","lore":"Zed is the first ninja in 200 years to unlock the ancient, forbidden ways. He defied his clan and master, casting off the balance and discipline that had shackled him all his life. Zed now offers power to those who embrace knowledge of the shadows, and slays those who cling to ignorance.\u003Cbr\u003E\u003Cbr\u003EAn orphan, Zed was taken in and trained by a great ninja master. Only one other student appeared to be Zed's equal - the master's son, Shen. It seemed Zed could never win the favor of the master, as every match between the rivals ended in a draw. Frustrated and jealous, he sought an advantage. The young ninja ventured into a sealed part of the clan's temple, where he found an ornate, foreboding box. Sensing the dark knowledge within, Zed knew he should not open it, but he peered inside nonetheless. In an instant, shadows touched his mind, revealing techniques that had long been hidden. Now armed with a secret edge, he challenged Shen, and this time he defeated the master's son. He expected praise and recognition in his moment of victory, but somehow the master knew Zed had used forbidden ways, and banished him.\u003Cbr\u003E\u003Cbr\u003EHumiliated, the young ninja wandered for years. His bitterness turned to ambition, and he began to train others in the style of the shadows. As his power grew, so did his circle of followers, but he knew that without the box, his technique would never be perfect. One day, Zed looked at his followers and saw that his students were now an army. He led them back to the temple to claim his prize. At the gates, he was surprised to find the old master waiting, receiving Zed and his disciples as if they were welcome guests. The old man laid his sword at Zed's feet, declaring that he had failed Zed as his master. By banishing his former student, the master had doomed Zed to the shadows, instead of leading him to the balanced path. The old man implored Zed to enter the temple, destroy the box, and lead his followers to balance. The dark ninja followed the master inside. Moments later, the assembled ninjas heard Zed cry out in pain. Mysteriously, he emerged unscathed, and threw the severed head of the master at Shen's feet. Screaming in rage, Zed commanded his followers to slaughter the master's students and seize the box.\u003Cbr\u003E\u003Cbr\u003EThat day, the old ninja order fell. Though many students died, some escaped thanks to Shen's heroic efforts. Now the temple is a dark training ground for the Order of the Shadow. Zed rules as the Order's master, and his edict is simple: perfect one's technique, and kill all ninjas who refuse to embrace the shadows.\u003Cbr\u003E\u003Cbr\u003E''Balance is a lie - we are the true ninjas.''\u003Cbr\u003E\u003Cbr\u003E-- Zed","skins":[{"id":238000,"name":"default","num":0},{"id":238001,"name":"Shockblade Zed","num":1},{"id":238002,"name":"SKT T1 Zed","num":2},{"id":238003,"name":"PROJECT: Zed","num":3},{"id":238010,"name":"Championship Zed","num":10}],"allytips":["Saving energy and spell cooldowns until you use your ultimate will maximize Death Mark's damage.","Quickly double tapping Living Shadow will teleport Zed to his shadow immediately for rapid escapes.","Placing a Living Shadow before using Death Mark can give Zed a safe escape from combat."],"enemytips":["Zed receives bonus effect from Attack Damage items he purchases, so Armor is super effective against him.","After Zed uses his Living Shadow, he is at his most vulnerable as his damage, slow, and mobility are both dependent upon it.","Zed's Shadow Slash can only slow you if his shadow hits you with it. "],"tags":["Assassin","Fighter"],"info":{"attack":9,"defense":2,"magic":1,"difficulty":7},"stats":{"arm":26.88,"ad":54.712,"aso":-0.03,"crit":0,"hp":579.4,"mp":200,"mp5":50,"hp5":7.092,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":3.5,"ad":3.4,"aso":2.1,"crit":0,"hp":80,"mp":0,"mp5":0,"hp5":0.65,"mr":1.25}},"pass":{"name":"Contempt for the Weak","descr":"Zed's basic attacks against targets below 50% Health deal 6-10% of the target's maximum Health as bonus Magic Damage. This effect can only occur once every 10 seconds on the same target.","img":"shadowninja_P.png"},"spells":[{"name":"Razor Shuriken","descr":"Zed and his shadow both throw their spinning blades forward, dealing damage to any targets they pass through.","tooltip":"Zed and his shadows throw their shurikens, each dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to the first enemy they pass through, and {{ e3 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a2 }})\u003C\/span\u003E physical damage to each additional enemy.\u003Cbr\u003E\u003Cbr\u003EAdditional shurikens that hit the same enemy deal 25% less damage than previous shurikens.","cost":[75,70,65,60,55],"costType":" Energy","cd":[6,6,6,6,6],"range":[900,900,900,900,900],"key":"ZedQ"},{"name":"Living Shadow","descr":"Zed's shadow dashes forward, remaining in place for 4 seconds, and mimicking his spell casts. Zed can reactivate to swap places with the shadow.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EWhenever Zed and his shadows strike an enemy with the same ability, Zed gains {{ e3 }} energy. Energy can only be gained once per cast ability.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EZed's shadow dashes forward, remaining in place for {{ e1 }} seconds. \u003Cbr\u003EReactivating Living Shadow will cause Zed to switch positions with this shadow.","cost":[40,35,30,25,20],"costType":" Energy","cd":[22,20,18,16,14],"range":[650,650,650,650,650],"key":"ZedW"},{"name":"Shadow Slash","descr":"Zed and his shadow spin their blades, creating a burst of shadow energy.  The shadow's spin slows.","tooltip":"Zed and his shadows slash, dealing {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage to nearby enemies.\u003Cbr\u003E\u003Cbr\u003EEach enemy champion hit by Zed's slash reduces Living Shadow's cooldown by {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003EEnemies hit by a Shadow's slash are slowed by {{ e2 }}% for 1.5 seconds. Enemies hit by multiple slashes take no additional damage but are slowed by {{ e3 }}% instead.","cost":[50,50,50,50,50],"costType":" Energy","cd":[5,4.5,4,3.5,3],"range":[290,290,290,290,290],"key":"ZedE"},{"name":"Death Mark","descr":"Zed leaves a shadow behind and dashes to target Champion, marking them for death. After 3 seconds, the mark will trigger, dealing a percentage of the damage Zed has dealt while the mark was active. If the Champion dies under Death Mark, Zed can gain a portion of their attack damage.","tooltip":"Zed becomes untargetable and dashes to an enemy champion, marking them. After 3 seconds, the mark triggers, dealing physical damage equal to \u003Cspan class=\"colorFF8C00\"\u003E{{ a1 }}\u003C\/span\u003E + {{ e2 }}% of all damage dealt to the target by Zed while the mark was active.\u003Cbr\u003E\u003Cbr\u003EThe dash leaves a shadow behind for {{ e4 }} seconds. Reactivating Death Mark causes Zed to switch positions with this shadow.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFFFFFF\"\u003EReaper of Shadows: \u003C\/span\u003EZed reaps the shadow of the strongest foe slain under Death Mark, gaining \u003Cspan class=\"colorFF8C00\"\u003E{{ f2 }}\u003C\/span\u003E attack damage. ({{ e0 }} + {{ e9 }}% of the victim's attack damage.)","cost":[0,0,0],"costType":"No Cost","cd":[120,100,80],"range":[625,625,625],"key":"ZedR"}]}