{"id":6,"key":"Urgot","name":"Urgot","title":"the Headsman's Pride","lore":"There are warriors who become great for their strength, cunning, or skill with arms. Others simply refuse to die. Urgot, once a great soldier of Noxus, may constitute a case in support of the latter. Prone to diving headlong into enemy battle lines, Urgot sowed chaos throughout the enemy ranks, often sustaining grievous injuries in the process.\u003Cbr\u003E\u003Cbr\u003EWhen his body was unable to weather further abuse, the crippled Urgot was delegated to the position of High Executioner of Noxus. By this time, his hands had been ruined and he could barely walk. Scythe-like grafts affixed to his maimed limbs served to carry out his bloody work.\u003Cbr\u003E\u003Cbr\u003EUrgot finally met his end at what should have been his finest hour. Because of his military background, he often accompanied detachments into foreign territory to carry out judgment. After ambushing an enemy force, Jarvan IV, Crown Prince of Demacia, fell into the clutches of Urgot's division. Too far from Noxus to risk transporting their prize for ransom, Urgot prepared to dispose of their captive. At the final moment, however, Garen led the Dauntless Vanguard to intervene, and Urgot was cut in two by the zealous warrior as he scrambled to free his Prince.\u003Cbr\u003E\u003Cbr\u003EIn recognition of his service, the executioner's remains were remanded to the Bleak Academy for reanimation. However, a lifetime of abuse had left his body in a catastrophic state, proving problematic to the necromancers' craft. Professor Stanwick Pididly, the prevailing scholar of Zaun, offered a solution. Within Pididly's laboratories, a nightmarish new body was forged for Urgot.\u003Cbr\u003E\u003Cbr\u003ENow, as much machine as man, with necromantic energies coursing through his metal veins, Urgot searches for the man who ended his life.","skins":[{"id":6000,"name":"default","num":0},{"id":6001,"name":"Giant Enemy Crabgot","num":1},{"id":6002,"name":"Butcher Urgot","num":2},{"id":6003,"name":"Battlecast Urgot","num":3}],"allytips":["Prior to firing Acid Hunter, try hovering over an enemy afflicted by Noxian Corrosive Charge. Upon launching, the Acid Hunter will ignore all other enemies and fly directly to the corroding target.","Urgot is a great skirmisher. Try hitting his enemies with Noxian Corrosive Charge followed by multiple missile-locked Acid Hunters."],"enemytips":["Keep moving to avoid being hit by Urgot's Noxian Corrosive Charge. If you are afflicted by his corrosive charge, quickly move out of range to avoid his Acid Hunter Missiles.","Urgot gains slowing attacks while his Terror Capacitor shield is operational. Damage him enough to remove his shield so he loses this effect."],"tags":["Marksman","Fighter"],"info":{"attack":8,"defense":5,"magic":3,"difficulty":8},"stats":{"arm":24.544,"ad":54.05,"aso":-0.03,"crit":0,"hp":586.52,"mp":312.4,"mp5":8.592,"hp5":6.508,"range":425,"ms":335,"mr":30,"lvl":{"arm":3.3,"ad":3.6,"aso":2.9,"crit":0,"hp":89,"mp":55,"mp5":0.65,"hp5":0.6,"mr":0}},"pass":{"name":"Zaun-Touched Bolt Augmenter","descr":"Urgot's basic attacks and Acid Hunters reduce his targets' damage by 15% for 2.5 seconds.","img":"Urgot_Passive.png"},"spells":[{"name":"Acid Hunter","descr":"Urgot fires an Acid Hunter missile that collides with the first enemy it hits, slowing the target if he has his Terror Capacitor up. Acid Hunter missile-locks on enemies affected by Noxian Corrosive Charge.","tooltip":"Urgot fires a missile toward the cursor that deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage. If Acid Hunter kills a unit half its mana cost is refunded.\u003Cbr\u003E\u003Cbr\u003EMissile-lock can be achieved by holding the cursor over a target afflicted by Noxian Corrosive Charge.","cost":[40,40,40,40,40],"costType":" Mana","cd":[2,2,2,2,2],"range":[1000,1000,1000,1000,1000],"key":"UrgotQ"},{"name":"Terror Capacitor","descr":"Urgot charges up his capacitor to gain a shield. While the shield is active, Urgot gains slowing attacks.","tooltip":"Urgot charges up his terror capacitor to gain a shield that absorbs {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E plus {{ e4 }}% of his maximum mana \u003Cspan class=\"color44DDFF\"\u003E(+{{ f1 }})\u003C\/span\u003E damage for 5 seconds. While the shield is active, Urgot's attacks and missiles slow targets by {{ e2 }}%. ","cost":[55,60,65,70,75],"costType":" Mana","cd":[16,15,14,13,12],"range":[600,600,600,600,600],"key":"UrgotW"},{"name":"Noxian Corrosive Charge","descr":"Urgot launches a corrosive charge that damages enemies in an area and reduces their Armor.","tooltip":"Urgot launches a Corrosive Charge at a target location. Enemies afflicted by the charge have their Armor reduced by {{ e2 }}% and take {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage over {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EAcid Hunter is able to missile-lock onto targets affected by Noxian Corrosive Charge.","cost":[50,55,60,65,70],"costType":" Mana","cd":[15,14,13,12,11],"range":[900,900,900,900,900],"key":"UrgotE"},{"name":"Hyper-Kinetic Position Reverser","descr":"Urgot charges up his Hyper-Kinetic Position Reverser, swapping positions with the target and terrifying nearby enemies for 1.5 seconds. His target is suppressed for the duration of the channel. He gains Damage Reduction during and after the swap.","tooltip":"Urgot targets an enemy champion and channels his Hyper-Kinetic Position Reverser for 1 second, swapping locations with his target afterward and terrifying nearby enemies for 1.5 seconds. His target is suppressed for the duration of the channel.\u003Cbr\u003E\u003Cbr\u003EUrgot takes {{ e2 }}% reduced damage for {{ e4 }} seconds beginning at the start of the channel, and his target is slowed by 40% for 3 seconds after being swapped.","cost":[100,100,100],"costType":" Mana","cd":[120,100,80],"range":[550,700,850],"key":"UrgotR"}]}