{"id":245,"key":"Ekko","name":"Ekko","title":"the Boy Who Shattered Time","lore":"A prodigy from the rough streets of Zaun, Ekko manipulates time to spin any situation to his advantage. Using his own invention, the Zero-Drive, he explores the branching possibilities of reality. As well as experimenting with multi-dimensional probability, Ekko spends his days running wild with the other lost children of Zaun. Though he revels in this freedom, when there's a threat to his friends, he'll endure anything to defend them. To the unknowing observer, Ekko accomplishes the impossible with ease, time and time again.","skins":[{"id":245000,"name":"default","num":0},{"id":245001,"name":"Sandstorm Ekko","num":1},{"id":245002,"name":"Academy Ekko","num":2},{"id":245003,"name":"PROJECT: Ekko","num":3}],"allytips":["Chronobreak is a potent escape tool, but it can also be quite powerful when used offensively. Don't underestimate its damage potential.","If you can proc Z-Drive Resonance on an enemy champion, it's worth taking risks to do so. The bonus movement speed makes it easy to escape.","Phase Dive's dash is a great tool for setting up Ekko's other abilities. Use it to get double hits with Timewinder or get into position to detonate Parallel Convergence."],"enemytips":["Ekko is significantly weaker when his ultimate is down. Watch for the trail he leaves behind to determine if Chronobreak is available.","Ekko's stun zone takes 3 seconds to arm. Watch for the image he creates on cast and try to guess where the zone was placed.","The second hit of Timewinder does more damage than the first; try to avoid it."],"tags":["Assassin","Fighter"],"info":{"attack":5,"defense":3,"magic":7,"difficulty":8},"stats":{"arm":27,"ad":55,"aso":0,"crit":0,"hp":580,"mp":280,"mp5":7,"hp5":9,"range":125,"ms":340,"mr":32,"lvl":{"arm":3,"ad":3,"aso":3.3,"crit":0,"hp":80,"mp":50,"mp5":0.8,"hp5":0.9,"mr":1.25}},"pass":{"name":"Z-Drive Resonance","descr":"Ekko's Zero-Drive charges his spells and attacks with temporal energy. The third hit deals bonus damage and, if the target is a champion, Ekko gains accelerated movement speed.","img":"Ekko_P.png"},"spells":[{"name":"Timewinder","descr":"Ekko throws a temporal grenade that expands into a time-distortion field upon hitting an enemy champion, slowing and damaging anyone caught inside. After a delay, the grenade rewinds back to Ekko, dealing damage on its return.","tooltip":"Ekko throws a device that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies it passes through. It expands into a slowing field on the first champion hit, slowing everything inside by {{ e2 }}%. It then returns to him after a delay, dealing {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage to all targets hit upon return.","cost":[50,60,70,80,90],"costType":" Mana","cd":[9,8.5,8,7.5,7],"range":[1075,1075,1075,1075,1075],"key":"EkkoQ"},{"name":"Parallel Convergence","descr":"Ekko splits the timeline, creating an anomaly after a few seconds that slows enemies caught inside. If Ekko enters the anomaly, he gains shielding and triggers a detonation, stunning enemies by suspending them in time.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive:\u003C\/span\u003E Ekko's basic attacks deal bonus magic damage to enemies under 30% health equal to {{ e3 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }}%)\u003C\/span\u003E of their missing health. Deals a minimum of {{ e6 }} damage, and a maximum of {{ e5 }} damage vs. minions and monsters.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive:\u003C\/span\u003E After a 3 second delay, Ekko creates a short-lived chronosphere at the target location that slows enemies who enter by {{ e0 }}%. If Ekko enters the sphere, he will detonate it, gaining a shield that absorbs up to {{ e4 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage for 2 seconds. Enemies caught inside are stunned for {{ e2 }} seconds.","cost":[50,55,60,65,70],"costType":" Mana","cd":[22,20,18,16,14],"range":[1600,1600,1600,1600,1600],"key":"EkkoW"},{"name":"Phase Dive","descr":"Ekko rolls evasively while charging up his Z-Drive. His next attack deals bonus damage and warps reality, teleporting him to his target.","tooltip":" Ekko dashes a short distance in the targeted direction. His next attack will deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage and teleport him to his target.","cost":[40,50,60,70,80],"costType":" Mana","cd":[11,10,9,8,7],"range":[325,325,325,325,325],"key":"EkkoE"},{"name":"Chronobreak","descr":"Ekko shatters his timeline, becoming untargetable and rewinding to a more favorable point in time. He returns to whenever he was a few seconds ago, and heals for a percentage of the damage received in that duration. Enemies near his arrival zone take massive damage.","tooltip":"Ekko turns back time, going briefly untargetable and invulnerable. He teleports to where he was 4 seconds ago and deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to nearby enemies on arrival. Additionally, Ekko heals for {{ e3 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E, increased by {{ e5 }}% for each 1% of his health lost over the last 4 seconds.","cost":[100,100,100],"costType":" Mana","cd":[110,90,70],"range":[850,850,850],"key":"EkkoR"}]}