{"id":110,"key":"Varus","name":"Varus","title":"the Arrow of Retribution","lore":"''The life of an arrow is fleeting, built of nothing but direction and intent.''\u003Cbr\u003E\u003Cbr\u003EFor his incomparable skill with the bow and his unquestioned sense of honor, Varus was chosen to be the warden of a sacred Ionian temple. The temple was built to contain an ancient pit of corruption so vile that Ionian Elders feared it could envelop the island in darkness. Varus prided himself on his position, as only the most exceptional Ionian warriors were selected for the role. He lived with his family in a nearby village and led a quiet life of disciplined routine until the day the forces of Noxus invaded Ionia. Their shock troops left nothing but death and desolation in their wake, and the temple lay in their path. Varus was forced to make a decision. He was bound by honor to stay and defend the temple, but without him the village's few inhabitants could offer little resistance against the oncoming war machine. Gravely, he chose to fulfill his duty as a warden. The corruption could not be allowed to escape.\u003Cbr\u003E\u003Cbr\u003EHis arrows sundered the troops who tried to wrest the temple from him that day. However, when he returned to the village, he found that it had been reduced to a smoldering graveyard. Remorse at the sight of his slain family gave way to overwhelming regret, and then to seething hatred. He swore to slaughter every Noxian invader, but first he needed to become stronger. He turned to that which he had sacrificed everything to protect. The pit of corruption would consume him wholly, as a flame devours a wick, but its abominable power would burn within him until he was lost. This was a path from which there could be no return. With grim resolve, he condemned himself to the black flames, feeling malevolent energy bond to his skin...and with it, the promise of ruin. He left, seeking the blood of all Noxians involved with the invasion, a grisly task that eventually led him to the invasion's most infamous perpetrators.","skins":[{"id":110000,"name":"default","num":0},{"id":110001,"name":"Blight Crystal Varus","num":1},{"id":110002,"name":"Arclight Varus","num":2},{"id":110003,"name":"Arctic Ops Varus","num":3},{"id":110004,"name":"Heartseeker Varus","num":4},{"id":110005,"name":"Varus Swiftbolt","num":5},{"id":110006,"name":"Dark Star Varus","num":6}],"allytips":["An early point in Blighted Quiver helps harass enemy champions and get killing blows on minions.","During short range fights it's sometimes best to fire Piercing Arrow quickly, rather than charging it to full power.","Try to take advantage of Piercing Arrow's very long range to snipe at enemy champions before a fight or as they're trying to flee."],"enemytips":["If you are affected by Blight, Varus' abilities will deal extra damage to you.","When he gets a kill or assist, Varus temporarily gains Attack Speed and is much more dangerous.","You'll get bound in place if a tendril from Varus' ultimate, Chain of Corruption, reaches you. You can cause the tendril to die however by running far enough away from it."],"tags":["Marksman","Mage"],"info":{"attack":7,"defense":3,"magic":4,"difficulty":2},"stats":{"arm":23.212,"ad":54.66,"aso":-0.05,"crit":0,"hp":537.76,"mp":360.48,"mp5":7.34,"hp5":5.424,"range":575,"ms":330,"mr":30,"lvl":{"arm":3.4,"ad":2.41,"aso":3,"crit":0,"hp":82,"mp":33,"mp5":0.8,"hp5":0.55,"mr":0}},"pass":{"name":"Living Vengeance","descr":"On kill or assist, Varus temporarily gains Attack Speed. This bonus is larger if the enemy is a champion.","img":"VarusPassive.png"},"spells":[{"name":"Piercing Arrow","descr":"Varus readies and then fires a powerful shot that gains extra range and damage the longer he spends preparing to fire.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EFirst Cast:\u003C\/span\u003E Varus starts drawing back his next shot, gradually increasing its range and damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003ESecond Cast:\u003C\/span\u003E Varus fires, dealing {{ e8 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ a1 }})\u003C\/span\u003E to {{ e2 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ a2 }})\u003C\/span\u003E physical damage, reduced by {{ e3 }}% per enemy hit (minimum {{ e9 }}%).\u003Cbr\u003E\u003Cbr\u003EWhile preparing to shoot Varus' Movement Speed is slowed by {{ e7 }}%. After {{ e5 }} seconds, Piercing Arrow fails but refunds {{ e4 }}% of its Mana cost.","cost":[70,75,80,85,90],"costType":" Mana","cd":[16,14,12,10,8],"range":[925,925,925,925,925],"key":"VarusQ"},{"name":"Blighted Quiver","descr":"Varus' basic attacks deal bonus magic damage and apply Blight. Varus' other abilities detonate Blight, dealing magic damage based on the target's maximum Health.","tooltip":" \u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003EVarus' basic attacks deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E bonus magic damage and apply Blight for {{ e3 }} seconds (stacks {{ e4 }} times). \u003Cbr\u003E\u003Cbr\u003EVarus' other abilities detonate Blight, dealing magic damage equal to {{ e2 }}% \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }}%)\u003C\/span\u003E of the target's maximum Health per stack (Max: {{ e5 }} total damage vs Monsters).","cost":[0,0,0,0,0],"costType":null,"cd":[6,6,6,6,6],"range":[750,750,750,750,750],"key":"VarusW"},{"name":"Hail of Arrows","descr":"Varus fires a hail of arrows that deal physical damage and desecrate the ground. Desecrated ground slows enemies' Movement Speed and reduces their self healing and regeneration. ","tooltip":" Varus fires a hail of arrows that deals {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E physical damage and desecrates the ground for {{ e3 }} seconds.\u003Cbr\u003E\u003Cbr\u003EDesecrated Ground slows enemy Movement Speed by {{ e2 }}% and reduces healing effects by {{ e4 }}%.","cost":[80,80,80,80,80],"costType":" Mana","cd":[18,16,14,12,10],"range":[925,925,925,925,925],"key":"VarusE"},{"name":"Chain of Corruption","descr":"Varus flings out a damaging tendril of corruption that immobilizes the first enemy champion hit and then spreads towards nearby uninfected champions, immobilizing them too on contact. ","tooltip":" Varus flings out a tendril of corruption that deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and immobilizes the first enemy champion hit for {{ e2 }} seconds.\u003Cbr\u003E\u003Cbr\u003EThe corruption then spreads towards nearby uninfected enemy champions. If it reaches them, they take the same damage and are also immobilized. Immobilized units gain {{ e4 }} Blight stacks over the duration.","cost":[100,100,100],"costType":" Mana","cd":[110,90,70],"range":[1200,1200,1200],"key":"VarusR"}]}