{"id":117,"key":"Lulu","name":"Lulu","title":"the Fae Sorceress","lore":"Perhaps more than any other champion in the League, Lulu marches to the beat of her own drum. During her youth in Bandle City, she spent most of her time wandering alone in the forest or lost in a daydream. It wasn't that she was antisocial; the day-to-day bustle of Bandle City just couldn't compete with the vibrant world of her imagination. She saw wonder in places most people overlooked. This was how she found Pix, a fae spirit, pretending to be stuck in a birdhouse. Lulu's imagination distinguished her to Pix and he seized the opportunity to lure her into his world. He brought her to the Glade, the enchanted home of the fae, which lay nestled in a clearing in the woods. There the rigid properties of the outside world - things like size and color - changed as frequently and whimsically as the direction of the wind. Lulu felt at home in the Glade and she lingered there with Pix, fascinated by this secret place.\u003Cbr\u003E\u003Cbr\u003EShe quickly lost track of time. Her life in the Glade was comfortable and natural. She and Pix played fae games together, the sorts of games that she had been told were ''make believe''... and she got exceedingly good at them. It caught her by surprise when she suddenly remembered that she had left a life behind in Bandle City. The Glade had a way of making everything outside seem distant and surreal. Lulu decided to revisit her former home, to share some of the lovely things she'd learned, but when she and Pix returned the world had changed. Time, she discovered, was another property that behaved differently in the Glade, and centuries had passed while she was away. Lulu sought to reconnect to the residents of the outside world but her attempts had unfortunate results. She led all the children off to play hide and seek, temporarily changing them into flowers and animals to spice up the game, but their parents didn't appreciate her efforts. When the yordles insisted that she leave their land, she turned to a vibrant magical place where those with unusual gifts were not just accepted but adored: the League of Legends.\u003Cbr\u003E\u003Cbr\u003E''The best path between two points is upside-down, between, then inside-out and round again.''\u003Cbr\u003E-- Lulu","skins":[{"id":117000,"name":"default","num":0},{"id":117001,"name":"Bittersweet Lulu","num":1},{"id":117002,"name":"Wicked Lulu","num":2},{"id":117003,"name":"Dragon Trainer Lulu","num":3},{"id":117004,"name":"Winter Wonder Lulu","num":4},{"id":117005,"name":"Pool Party Lulu","num":5},{"id":117006,"name":"Star Guardian Lulu","num":6}],"allytips":["Glitterlance can be fired at odd angles depending on where your cursor is - Moving your cursor closer to Pix and Lulu will change your area of effect size considerably.","Consider casting Help, Pix! on ranged attackers for the Pix boost and Wild Growth on Tanks or Fighters for the added initiation power."],"enemytips":["The shots from Lulu's faerie can be intercepted - hide behind your minions to avoid the additional Faerie attacks.","Lulu excels when opponents heavily commit. Don't give her this chance! Use heavy harass tactics instead to force Lulu and her partner out of lane."],"tags":["Support","Mage"],"info":{"attack":4,"defense":5,"magic":7,"difficulty":5},"stats":{"arm":19.216,"ad":46.368,"aso":0,"crit":0,"hp":552.76,"mp":350,"mp5":11,"hp5":6.008,"range":550,"ms":330,"mr":30,"lvl":{"arm":3.7,"ad":2.6,"aso":2.25,"crit":0,"hp":74,"mp":55,"mp5":0.6,"hp5":0.6,"mr":0}},"pass":{"name":"Pix, Faerie Companion","descr":"Pix is a wild Faerie that accompanies Lulu. Pix will fire a barrage of magical energy at targets that Lulu attacks.","img":"Lulu_PixFaerieCompanion.png"},"spells":[{"name":"Glitterlance","descr":"Pix and Lulu each fire a bolt of magical energy that heavily slows all enemies it hits. An enemy can only be damaged by one bolt.","tooltip":"Lulu and Pix each fire a piercing bolt dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to the first enemy hit and {{ f4 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ f5 }})\u003C\/span\u003E to all additional enemies. Enemies hit are slowed by {{ e2 }}%, decaying over the next {{ e3 }} second(s).\u003Cbr\u003E\u003Cbr\u003EAn enemy can only be damaged for up to a total of \u003Cspan class=\"color99FF99\"\u003E{{ f6 }}\u003C\/span\u003E damage per cast.","cost":[50,55,60,65,70],"costType":" Mana","cd":[7,7,7,7,7],"range":[925,925,925,925,925],"key":"LuluQ"},{"name":"Whimsy","descr":"If cast on an ally, grants them Attack Speed and Movement Speed for a short time. If cast on an enemy, turns them into an adorable critter that can't attack or cast spells.","tooltip":"\u003Cspan class=\"colorCCFF99\"\u003EOn Ally Cast: \u003C\/span\u003ETarget ally gains {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E% Movement Speed and {{ e7 }}% Attack Speed for {{ e5 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9999\"\u003EOn Enemy Cast: \u003C\/span\u003EPolymorphs an enemy champion for {{ e3 }} seconds, disabling their ability to attack or cast spells and reducing their base Movement Speed by {{ e4 }}.","cost":[65,65,65,65,65],"costType":" Mana","cd":[16,15,14,13,12],"range":[650,650,650,650,650],"key":"LuluW"},{"name":"Help, Pix!","descr":"If cast on an ally, commands Pix to jump to an ally and shield them. He then follows them and aids their attacks. If cast on an enemy, commands Pix to jump to an enemy and damage them. He then follows them and grants you vision of that enemy.","tooltip":"\u003Cspan class=\"colorCCFF99\"\u003EOn Ally Cast: \u003C\/span\u003ECommands Pix to jump to an ally and then follow and aid their attacks instead of Lulu's for {{ e1 }} seconds. If the ally is a champion, Pix shields them from {{ e2 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E damage for {{ e1 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9999\"\u003EOn Enemy Cast: \u003C\/span\u003EPix deals {{ e4 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a2 }})\u003C\/span\u003E magic damage to target enemy unit. Pix then follows and grants \u003Cspan class=\"coloree91d7\"\u003ETrue Sight\u003C\/span\u003E of them for {{ e6 }} seconds.\u003C\/span\u003E ","cost":[60,70,80,90,100],"costType":" Mana","cd":[10,10,10,10,10],"range":[650,650,650,650,650],"key":"LuluE"},{"name":"Wild Growth","descr":"Lulu enlarges an ally, knocking nearby enemies into the air and granting the ally a large amount of bonus health. For the next few seconds, that ally gains an aura that slows nearby enemies.","tooltip":"Lulu enlarges her ally, knocking nearby enemies into the air. For {{ e4 }} seconds, her ally gains {{ e1 }}\u003Cspan class=\"color99FF99\"\u003E (+{{ a1 }})\u003C\/span\u003E bonus health and slows nearby enemies by {{ e2 }}%.","cost":[100,100,100],"costType":" Mana","cd":[110,95,80],"range":[900,900,900],"key":"LuluR"}]}