{"id":120,"key":"Hecarim","name":"Hecarim","title":"the Shadow of War","lore":"''Break their ranks and ride them down without mercy. Crush the living and feast on their terror.''\u003Cbr\u003E\u003Cbr\u003EHecarim is an armored colossus who charges from the Shadow Isles at the head of a deathly host of spectral horsemen to hunt the living. A monstrous fusion of man and beast, cursed to ride for eternity, Hecarim revels in slaughter and crushing souls beneath his armored hooves.","skins":[{"id":120000,"name":"default","num":0},{"id":120001,"name":"Blood Knight Hecarim","num":1},{"id":120002,"name":"Reaper Hecarim","num":2},{"id":120003,"name":"Headless Hecarim","num":3},{"id":120004,"name":"Arcade Hecarim","num":4},{"id":120005,"name":"Elderwood Hecarim","num":5},{"id":120006,"name":"Worldbreaker Hecarim","num":6}],"allytips":["Spirit of Dread restores Health when nearby enemies take damage, including damage dealt by allies. Cast this during a large fight to maximize Hecarim's survivability.","Devastating Charge deals more damage based on the distance traveled. Try using Onslaught of Shadows or Summoner Spells such as Ghost or Flash to maximize this damage."],"enemytips":["Hecarim gains life from nearby enemies with Spirit of Dread but lacks durability, use burst damage.","Hecarim's ultimate causes opponents to flee in terror. Spread out to reduce his power in fights."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":6,"magic":4,"difficulty":6},"stats":{"arm":26.72,"ad":58,"aso":-0.0672,"crit":0,"hp":580,"mp":277.2,"mp5":6.5,"hp5":7,"range":175,"ms":345,"mr":32.1,"lvl":{"arm":4,"ad":3.2,"aso":2.5,"crit":0,"hp":90,"mp":40,"mp5":0.6,"hp5":0.75,"mr":1.25}},"pass":{"name":"Warpath","descr":"Hecarim gains Attack Damage equal to a percentage of his bonus Movement Speed.","img":"Hecarim_Passive.png"},"spells":[{"name":"Rampage","descr":"Hecarim cleaves nearby enemies dealing physical damage. ","tooltip":"Hecarim cleaves nearby enemies for {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f1 }})\u003C\/span\u003E physical damage. ({{ e5 }}% damage to minions)\u003Cbr\u003E\u003Cbr\u003EIf Hecarim damages at least one enemy with this attack he gains a stack of Rampage, reducing the base cooldown of this skill by {{ e3 }} second for a short duration. This effect can stack up to {{ e2 }} times.","cost":[32,34,36,38,40],"costType":" Mana","cd":[4,4,4,4,4],"range":[350,350,350,350,350],"key":"HecarimQ"},{"name":"Spirit of Dread","descr":"Hecarim deals magic damage to nearby enemies for a short duration. Hecarim gains Health equal to a percentage of any damage those enemies suffer.","tooltip":"Hecarim deals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage over {{ e3 }} seconds to all nearby enemies. Hecarim is healed for {{ e1 }}% of the damage these enemies take from any source.\u003Cbr\u003E\u003Cbr\u003EHecarim cannot heal more than {{ e4 }} Health from minions or monsters.","cost":[50,60,70,80,90],"costType":" Mana","cd":[22,21,20,19,18],"range":[575,575,575,575,575],"key":"HecarimW"},{"name":"Devastating Charge","descr":"Hecarim gains increasing Movement Speed and can move through units for a short duration. His next attack knocks the target back and deals additional physical damage based on the distance he has traveled since activating the ability. ","tooltip":"Hecarim gains increasing Movement Speed and can move through units for {{ e5 }} seconds. His next attack knocks the target back dealing {{ e4 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ a1 }})\u003C\/span\u003E to {{ e3 }}\u003Cspan class=\"colorFF8C00\"\u003E (+{{ a2 }})\u003C\/span\u003E physical damage based on how far Hecarim has traveled during Devastating Charge (knockback distance also scales).","cost":[60,60,60,60,60],"costType":" Mana","cd":[24,22,20,18,16],"range":[300,300,300,300,300],"key":"HecarimE"},{"name":"Onslaught of Shadows","descr":"Hecarim summons spectral riders and charges forward, dealing magic damage in a line. Hecarim creates a shockwave when he finishes his charge, causing nearby enemies to flee in terror.","tooltip":"Hecarim summons spectral riders and charges forward, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage to enemies hit. \u003Cbr\u003E\u003Cbr\u003EHecarim releases a shockwave when he finishes his charge, causing nearby enemies to flee from him for {{ e2 }} second.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"color99FF99\"\u003EHecarim himself will only move to the targeted location. The riders will always move the full distance.\u003C\/span\u003E","cost":[100,100,100],"costType":" Mana","cd":[140,120,100],"range":[50000,50000,50000],"key":"HecarimR"}]}