{"id":17,"key":"Teemo","name":"Teemo","title":"the Swift Scout","lore":"Teemo is a legend among his yordle brothers and sisters in Bandle City. As far as yordles are concerned, there is something just slightly off about him. While Teemo enjoys the companionship of other yordles, he also insists on frequent solo missions in the ongoing defense of Bandle City. Despite his genuinely warm personality, something switches off inside Teemo's mind during combat so that the lives he must end while on patrol do not burden him. Even as a young recruit, the drill instructors and other trainees found it a little disconcerting that, while Teemo was normally charming and kind, he turned deadly serious and highly efficient the minute combat exercises began. Teemo's superiors quickly steered him toward the Scouts of the Mothership, which is one of Bandle City's most distinguished Special Forces unit alongside the Megling Commandos.\u003Cbr\u003E\u003Cbr\u003EWhile most yordles do not handle solo scouting missions with a great deal of finesse, Teemo is remarkably efficient at them. His record of success in defending Bandle City from infiltrators easily makes him one of the most dangerous yordles alive, though you'd never know it by having a cup of honey mead with him at his favorite inn. Bandle City chose Teemo as their first champion for the League, and he has taken to it like a duck to water. His signature weapon - a blowgun - uses a rare ajunta poison he personally gathers from the jungles of Kumungu. To help cope with his lengthy periods of isolation, Teemo recently struck up a friendship with Tristana, a fellow League champion and fellow member of Bandle City's Special Forces. This connection is healthy for both yordles, though now Valoran's voracious media outlets circulate rumors that the friendship is turning into a romantic relationship. Regardless, Teemo is a crowd favorite in the League of Legends, and a pint-sized foe that many have come to fear.\u003Cbr\u003E\u003Cbr\u003E''Teemo rides a thin line between chipper compatriot and unrepentant killer, but there's no one else I'd rather have as a friend.''\u003Cbr\u003E-- Tristana","skins":[{"id":17000,"name":"default","num":0},{"id":17001,"name":"Happy Elf Teemo","num":1},{"id":17002,"name":"Recon Teemo","num":2},{"id":17003,"name":"Badger Teemo","num":3},{"id":17004,"name":"Astronaut Teemo","num":4},{"id":17005,"name":"Cottontail Teemo","num":5},{"id":17006,"name":"Super Teemo","num":6},{"id":17007,"name":"Panda Teemo","num":7},{"id":17008,"name":"Omega Squad Teemo","num":8},{"id":17014,"name":"Little Devil Teemo","num":14}],"allytips":["Teemo's mushrooms can be used to farm creep waves very effectively.","Place your mushrooms at key locations on the map, such as by the Dragon or Baron Nashor, to reveal when your enemies might be attempting to kill them."],"enemytips":["Teemo's Toxic Shot punishes players who get hit and back out, so stay at a safe range until you're ready to commit.","It can be valuable to use Oracle's Lens(Trinket) to destroy mushrooms around key locations."],"tags":["Marksman","Assassin"],"info":{"attack":5,"defense":3,"magic":7,"difficulty":6},"stats":{"arm":24.3,"ad":49.54,"aso":-0.0947,"crit":0,"hp":515.76,"mp":267.2,"mp5":7.206,"hp5":5.742,"range":500,"ms":330,"mr":30,"lvl":{"arm":3.75,"ad":3,"aso":3.38,"crit":0,"hp":82,"mp":40,"mp5":0.45,"hp5":0.65,"mr":0}},"pass":{"name":"Guerrilla Warfare","descr":"If Teemo stands still and takes no actions for a short duration, he becomes Invisible indefinitely. If he's in brush, Teemo can enter and maintain his Invisibility while moving. After leaving Invisibility, Teemo gains the Element of Surprise, increasing his Attack Speed for 3 seconds.","img":"Teemo_P.png"},"spells":[{"name":"Blinding Dart","descr":"Obscures an enemy's vision with a powerful venom, dealing damage to the target unit and blinding it for the duration.","tooltip":"Deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and blinds the target for {{ e2 }} seconds. ","cost":[70,75,80,85,90],"costType":" Mana","cd":[8,8,8,8,8],"range":[680,680,680,680,680],"key":"TeemoQ"},{"name":"Move Quick","descr":"Teemo scampers around, passively increasing his Movement Speed until he is struck by an enemy champion or turret. Teemo can sprint to gain bonus Movement Speed that isn't stopped by being struck for a short time.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003ETeemo's Movement Speed is increased by {{ e1 }}% unless he has been damaged by an enemy champion or turret in the last 5 seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003ETeemo sprints, gaining twice his normal bonus for {{ e2 }} seconds. This bonus is not lost when struck.","cost":[40,40,40,40,40],"costType":" Mana","cd":[17,17,17,17,17],"range":[20,20,20,20,20],"key":"TeemoW"},{"name":"Toxic Shot","descr":"Each of Teemo's attacks will poison the target, dealing damage on impact and each second after for 4 seconds.","tooltip":"Teemo's basic attacks poison their target, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magical damage upon impact and {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magical damage each second for {{ e3 }} seconds.","cost":[0,0,0,0,0],"costType":"Passive","cd":[8,8,8,8,8],"range":[680,680,680,680,680],"key":"TeemoE"},{"name":"Noxious Trap","descr":"Teemo throws an explosive poisonous trap using one of the mushrooms stored in his pack. If an enemy steps on the trap, it will release a poisonous cloud, slowing enemies and damaging them over time. If Teemo throws a mushroom onto another mushroom it will bounce, gaining additional range.","tooltip":"Tosses a stored mushroom as a trap that detonates if an enemy steps on it, spreading poison to nearby enemies that slows Movement Speed by {{ e2 }}%, reveals them and deals {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage over {{ e9 }} seconds. \u003Cbr\u003E\u003Cbr\u003ETraps last {{ e5 }} minutes and take {{ e4 }} second to arm and stealth. If a thrown trap lands on another trap, it will bounce up to \u003Cspan class=\"colorFFFF99\"\u003E{{ e6 }}\u003C\/span\u003E Teemos further before planting.\u003Cbr\u003E\u003Cbr\u003ETeemo forages for a mushroom every \u003Cspan class=\"colorFFFFFF\"\u003E{{ f1 }}\u003C\/span\u003E seconds, but he is only big enough to carry 3 at once.","cost":[75,75,75],"costType":" Mana","cd":[0.25,0.25,0.25],"range":[400,650,900],"key":"TeemoR"}]}