{"id":12,"key":"Alistar","name":"Alistar","title":"the Minotaur","lore":"As the mightiest warrior to ever emerge from the Minotaur tribes of the Great Barrier, Alistar defended his tribe from Valoran's many dangers; that is, until the coming of the Noxian army. Alistar was lured from his village by the machinations of Keiran Darkwill, General Boram Darkwill's youngest son and commander of the Noxian expeditionary force. When Alistar returned, he found his village burning and his family slain. Bellowing with rage, he charged an entire regiment of Noxus' elite, slaughtering them by the hundreds. Only the intervention of some of Noxus' most skilled summoners checked Alistar's rage. Brought in chains to Noxus, Alistar spent the intervening years as a gladiator in the Fleshing, pitted in endless battle for the entertainment of Noxus' wealthy leaders.\u003Cbr\u003E\u003Cbr\u003EAlistar's once noble soul slowly became twisted, and he would have been driven to insanity if not for Ayelia, a young servant girl who befriended him and eventually arranged for his escape. Suddenly free, Alistar joined the newly formed League of Legends to fight as a champion, hoping to one day exact his final vengeance upon Noxus and find the girl who had renewed his hope. Initially unwilling to cater to his celebrity status as a champion, Alistar has since discovered that there is power in fame, and he has become a vocal advocate for those whom the Noxian government treads upon. He also calls to light things that the Noxian military would prefer remain hidden -- something that has made him very unpopular with Noxus' nobles. His charitable work has earned him several philanthropic awards, which serve as an interesting contrast to the rage and destruction he brings to the League of Legends.\u003Cbr\u003E\u003Cbr\u003EIf you intend to grab the bull by the horns as a summoner, Alistar might have something to say about that.","skins":[{"id":12000,"name":"default","num":0},{"id":12001,"name":"Black Alistar","num":1},{"id":12002,"name":"Golden Alistar","num":2},{"id":12003,"name":"Matador Alistar","num":3},{"id":12004,"name":"Longhorn Alistar","num":4},{"id":12005,"name":"Unchained Alistar","num":5},{"id":12006,"name":"Infernal Alistar","num":6},{"id":12007,"name":"Sweeper Alistar","num":7},{"id":12008,"name":"Marauder Alistar","num":8},{"id":12009,"name":"SKT T1 Alistar","num":9}],"allytips":["Using Pulverize can allow you to establish better positioning for Headbutt.","Movement speed is very important on Alistar. Consider which boots to buy carefully.","Using Flash can allow you catch your target off guard to knock them back into your allies with Pulverize and Headbutt."],"enemytips":["Alistar is very disruptive but very tough - try to target more fragile damage dealers.","Watch out for the Pulverize-Headbutt combo when around turrets.","When Alistar uses his ultimate, it's often better to move back and wait until the effect wears off before attacking him."],"tags":["Tank","Support"],"info":{"attack":6,"defense":9,"magic":5,"difficulty":7},"stats":{"arm":24.38,"ad":61.1116,"aso":0,"crit":0,"hp":613.36,"mp":278.84,"mp5":8.5,"hp5":8.678,"range":125,"ms":330,"mr":32.1,"lvl":{"arm":3.5,"ad":3.62,"aso":2.125,"crit":0,"hp":106,"mp":38,"mp5":0.8,"hp5":0.85,"mr":1.25}},"pass":{"name":"Triumphant Roar","descr":"Alistar charges his roar by stunning or displacing enemy champions or when nearby enemies die. When fully charged he heals himself and the nearest ally champion.","img":"Alistar_E.png"},"spells":[{"name":"Pulverize","descr":"Alistar smashes the ground, dealing damage to nearby enemies and tossing them into the air.","tooltip":"Alistar smashes the ground, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and tossing nearby enemy units into the air for {{ e3 }} second.","cost":[65,70,75,80,85],"costType":" Mana","cd":[17,16,15,14,13],"range":[365,365,365,365,365],"key":"AlistarQ"},{"name":"Headbutt","descr":"Alistar rams a target with his head, dealing damage and knocking the target back.","tooltip":"Alistar rams into an enemy, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage and knocking them back.","cost":[65,70,75,80,85],"costType":" Mana","cd":[14,13,12,11,10],"range":[650,650,650,650,650],"key":"AlistarW"},{"name":"Trample","descr":"Alistar tramples nearby enemy units, ignoring unit colision and gaining stacks if he damages an enemy champion. At full stacks Alistar's next basic attack against an enemy champion deals additional magic damage and stuns them.","tooltip":"Alistar tramples the ground, ignoring unit collision and dealing {{ f1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ f2 }})\u003C\/span\u003E magic damage over {{ e3 }} seconds to nearby enemies. Each pulse that damages at least one enemy champion grants Alistar a \u003Cspan class=\"colorFF6E1C\"\u003ETrample\u003C\/span\u003E stack.\u003Cbr\u003E\u003Cbr\u003EAt {{ e5 }} \u003Cspan class=\"colorFF6E1C\"\u003ETrample\u003C\/span\u003E stacks Alistar empowers his next basic attack against an enemy champion to deal an additional \u003Cspan class=\"colorFFFFFF\"\u003E{{ f3 }}\u003C\/span\u003E magic damage and stun for {{ e6 }} second.","cost":[50,60,70,80,90],"costType":" Mana","cd":[16,15.5,15,14.5,14],"range":[350,350,350,350,350],"key":"AlistarE"},{"name":"Unbreakable Will","descr":"Alistar lets out a wild roar, removing all crowd control effects on himself, and reducing incoming physical and magical damage for the duration.","tooltip":"Removes all disables from Alistar. For {{ e1 }} seconds Alistar takes {{ e2 }}% reduced physical and magical damage.","cost":[100,100,100],"costType":" Mana","cd":[120,100,80],"range":[1,1,1],"key":"AlistarR"}]}