{"id":53,"key":"Blitzcrank","name":"Blitzcrank","title":"the Great Steam Golem","lore":"Zaun is a place where both magic and science have gone awry, and the unchecked nature of experimentation has taken its toll. However, Zaun's lenient restrictions allow their researchers and inventors the leeway to push the bounds of science at an accelerated rate, for better or worse.\u003Cbr\u003E\u003Cbr\u003EIt was under these conditions that a team of doctoral students from Zaun's College of Techmaturgy made a breakthrough in the field of intelligent steam automation. Their creation, the steam golem Blitzcrank, was developed to exercise judgment on-the-fly in order to assist with Zaun's hazardous waste reclamation process, since often the conditions did not allow for human supervision. However, he soon began exhibiting unforeseen behaviors.\u003Cbr\u003E\u003Cbr\u003EOver time, the scientists were able to identify a demonstrated learning process, and Blitzcrank fast became a celebrity. As is sadly often the case though, credit for the golem's creation was scooped up by another - Professor Stanwick Pididly - though most now know the truth. In the wake of the ensuing legal maelstrom, it became evident that neither party truly had the steam golem's best interests at heart, and Blitzcrank humbly petitioned for personal autonomy.\u003Cbr\u003E\u003Cbr\u003EBacked by overwhelming support from the public, it took the liberal Council of Zaun only a few weeks to declare Blitzcrank a fully-independent, sentient entity. A unique being, the golem left Zaun, distressed by the controversy and feeling there was no place he could fit in. Now he searches the lands of Valoran to find a place where he might someday belong.\u003Cbr\u003E\u003Cbr\u003EThough Blitzcrank may batter anything that stands in his way, he really has a heart of gold...encased in a framework of iron...in a carapace of steel.","skins":[{"id":53000,"name":"default","num":0},{"id":53001,"name":"Rusty Blitzcrank","num":1},{"id":53002,"name":"Goalkeeper Blitzcrank","num":2},{"id":53003,"name":"Boom Boom Blitzcrank","num":3},{"id":53004,"name":"Piltover Customs Blitzcrank","num":4},{"id":53005,"name":"Definitely Not Blitzcrank","num":5},{"id":53006,"name":"iBlitzcrank","num":6},{"id":53007,"name":"Riot Blitzcrank","num":7},{"id":53011,"name":"Battle Boss Blitzcrank","num":11}],"allytips":["The 1-2-3 combo of Rocket Grab, Power Fist, and Static Field can devastate an individual opponent.","Using Blitzcrank's grab to pull an enemy into your tower range followed by a Power Fist will allow the tower to get several hits on them."],"enemytips":["Blitzcrank's passive Mana Barrier grants him a shield when he is low on health.","Staying behind creeps can prevent you from being Rocket Grabbed. Blitzcrank's Rocket Grab only pulls the first enemy target it encounters."],"tags":["Tank","Fighter"],"info":{"attack":4,"defense":8,"magic":5,"difficulty":4},"stats":{"arm":24.38,"ad":61.54,"aso":0,"crit":0,"hp":582.6,"mp":267.2,"mp5":8.5,"hp5":8.51,"range":125,"ms":325,"mr":32.1,"lvl":{"arm":4,"ad":3.5,"aso":1.13,"crit":0,"hp":95,"mp":40,"mp5":0.8,"hp5":0.75,"mr":1.25}},"pass":{"name":"Mana Barrier","descr":"When Blitzcrank's life is brought below 20% health, he activates Mana Barrier. This creates a mana shield equal to 50% of his mana for 10 seconds. Mana Barrier can only occur once every 90 seconds.","img":"Blitzcrank_ManaBarrier.png"},"spells":[{"name":"Rocket Grab","descr":"Blitzcrank fires his right hand to grab an opponent on its path, dealing damage and dragging it back to him.","tooltip":"Blitzcrank fires his right hand. If it encounters an enemy unit it will stun them and deal {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage while he pulls them to himself.","cost":[100,100,100,100,100],"costType":" Mana","cd":[20,19,18,17,16],"range":[925,925,925,925,925],"key":"BlitzcrankQ"},{"name":"Overdrive","descr":"Blitzcrank super charges himself to get dramatically increased Movement and Attack Speed. He is temporarily slowed after the effect ends.","tooltip":"Blitzcrank supercharges himself, gaining {{ e1 }}% Movement Speed and {{ e2 }}% Attack Speed for {{ e4 }} seconds. The Movement Speed bonus decays over the duration.\u003Cbr\u003E\u003Cbr\u003EWhen Overdrive ends, Blitzcrank's Movement Speed is slowed by {{ e3 }}% for {{ e5 }} seconds.","cost":[75,75,75,75,75],"costType":" Mana","cd":[15,15,15,15,15],"range":[1,1,1,1,1],"key":"BlitzcrankW"},{"name":"Power Fist","descr":"Blitzcrank charges up his fist to make his next attack deal double damage and pop his target up in the air.","tooltip":"Blitzcrank charges up his fist to make his next attack deal double his total attack damage as physical damage and pop his target up in the air.","cost":[25,25,25,25,25],"costType":" Mana","cd":[9,8,7,6,5],"range":[300,300,300,300,300],"key":"BlitzcrankE"},{"name":"Static Field","descr":"Passively causes lightning bolts to damage a nearby enemy. Additionally, Blitzcrank can activate this ability to damage nearby enemies and silence them for 0.5 seconds, but doing so removes the passive lightning until Static Field becomes available again.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPassive: \u003C\/span\u003ELightning arcs off of Blitzcrank to hit a random nearby enemy for {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage every 2.5 seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActive: \u003C\/span\u003EDeals {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage and silences surrounding enemy units for 0.5 seconds. The passive is not in effect during the cooldown.","cost":[100,100,100],"costType":" Mana","cd":[60,40,20],"range":[600,600,600],"key":"BlitzcrankR"}]}