{"id":77,"key":"Udyr","name":"Udyr","title":"the Spirit Walker","lore":"Udyr is more than a man; he is a vessel for the untamed power of four primal animal spirits. When tapping into the spirits' bestial natures, Udyr can harness their unique strengths: the tiger grants him speed and ferocity, the turtle resilience, the bear might, and the phoenix its eternal flame. With their combined power, Udyr can turn back all those who would attempt to harm the natural order.\u003Cbr\u003E\u003Cbr\u003EIn the Freljord, there is a unique caste that lives outside the society of those savage lands. They are the custodians of the natural world: the Spirit Walkers. Once a generation, a child is born under a blood red moon, a child said to live between the two worlds of spirit and man. This child is brought to the Spirit Walker to continue the shamanic line. Udyr was such a child, and knew the howl of the tundra wolves even before he learned the language of his ancestors. Through the Spirit Walker, Udyr would one day learn the meaning of the spirits' calls and tend to the balance of nature. The Spirit Walker often told Udyr he would be tested more than those who had come before him, for the spirits of the Freljord were growing ever more restless, though the reason remained clouded. \u003Cbr\u003E\u003Cbr\u003EThe answer arrived in the dead of winter, as Udyr and the Spirit Walker were descended upon by a fearsome figure known only through frightened whispers: the Ice Witch. Knowing the boy would fall easy prey to her vile magic, the Spirit Walker shielded the child from her assault at the cost of his own life. Wracked by grief, Udyr howled with fury, and he felt the Freljord itself howl with him. In that moment, the child embraced the spirits' primal nature and became a beast himself. Coursing with their untamed power, Udyr's angry roar shook the mountaintops and brought down a torrential avalanche. Once Udyr had finally clawed his way out of the frost, the Ice Witch was nowhere to be found.\u003Cbr\u003E\u003Cbr\u003EFor years, the tribes of the north learned to avoid the wildman and his domain. Then one day, Udyr caught the scent of a fearless trespasser. Determined to chase the intruder from his territory, he attacked, only to be deflected with ease. The wildman launched himself at the stranger again and again, only to be effortlessly cast aside each time. Exhausted and defeated, Udyr felt his animosity ebb and croaked a clumsy ''who'' to the stranger. Lee Sin had come seeking the Spirit Walker's guidance and instead found a man who had also lost his way. The monk promised he would right Udyr's path and guided him to a monastery said to be protected by four eternal spirits of great power and wisdom. There, Udyr would find harmony.\u003Cbr\u003E\u003Cbr\u003ELee Sin brought Udyr to a land that was a stark contrast to his birthplace. Survival was not the only law that governed the lives of Ionians or creatures of the land. For the first time, Udyr felt at peace with the spirits surrounding him and found comfort in human companionship. His time among the monks taught him to temper his instincts, while his meditations with the ancient temple spirits taught him wisdom. Through them both, Udyr learned to truly embrace his life as the next Spirit Walker.\u003Cbr\u003E\u003Cbr\u003EUdyr owed much to the Ionians. It was a debt he was never asked to honor, but one he would ultimately repay many times over. When the armies of Noxus invaded, Udyr did not stand idle as the brutal soldiers oppressed the peaceful Ionians - he had not forgotten how to bare his teeth. Udyr leapt at their armies with all the ferocity of a cornered beast and gave the invaders good reason to fear the wilderness. From the trees, his claws tore the Noxians down in scores; on the river banks, he threw them back like a flood, and in the fields, he consumed them with searing wildfire. Only when the Noxians fled with their tails between their legs did Udyr quell his rage. \u003Cbr\u003E\u003Cbr\u003EPeace returned to Ionia, but still Udyr felt something stirring him from his rest. The spirits of the Freljord called out to him, warning of an unnatural evil emerging from the ice. Udyr understood the true threat that the Ice Witch posed to his homeland: she was the herald of a greater darkness that would soon envelop the land. Armed with the potent spirits of the temple, Udyr returned to the Freljord, seeking to defend the natural world from all who would threaten its balance. \u003Cbr\u003E\u003Cbr\u003E''Through us, nature's will is done.''\u003Cbr\u003E -- Udyr","skins":[{"id":77000,"name":"default","num":0},{"id":77001,"name":"Black Belt Udyr","num":1},{"id":77002,"name":"Primal Udyr","num":2},{"id":77003,"name":"Spirit Guard Udyr","num":3},{"id":77004,"name":"Definitely Not Udyr","num":4}],"allytips":["Damage is applied to turtle shield post-mitigation. Therefore, buying defensive items can drastically increase your survivability.","Udyr is one of the best junglers in the game. Taking advantage of this can give your team a large XP advantage and map control."],"enemytips":["Udyr players will often start in the jungle and only appear to gank in lanes. Try warding key locations to keep track of his movement.","Once the initial shield effect has faded, Turtle Stance is weak against other champions. Press the attack to force him to switch stances and prevent him from regenerating health.","Some Udyr players buy tank items to become very durable. If they do, focus their weaker teammates instead."],"tags":["Fighter","Tank"],"info":{"attack":8,"defense":7,"magic":4,"difficulty":7},"stats":{"arm":25.47,"ad":58.286,"aso":-0.05,"crit":0,"hp":593.32,"mp":270.4,"mp5":7.506,"hp5":6,"range":125,"ms":345,"mr":32.1,"lvl":{"arm":4,"ad":3.2,"aso":2.67,"crit":0,"hp":99,"mp":30,"mp5":0.45,"hp5":0.75,"mr":1.25}},"pass":{"name":"Monkey's Agility","descr":"Entering a stance grants Udyr bonus Attack Speed and Movement Speed for a short duration. This effect can stack multiple times.","img":"Udyr_MonkeysAgility.png"},"spells":[{"name":"Tiger Stance","descr":"Tiger Stance: Activation - Udyr's Attack Speed is increased for a few seconds, and his first basic attack will deal a high amount of damage over 2 seconds. Persistent Effect - Udyr's basic attacks deal extra damage.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPersistent Effect: \u003C\/span\u003EBasic attacks deal \u003Cspan class=\"colorFF8C00\"\u003E{{ f1 }}\u003C\/span\u003E bonus physical damage, and Udyr will perform a Tiger Strike with his first basic attack, dealing bonus {{ e1 }} \u003Cspan class=\"colorFF8C00\"\u003E(+{{ f2 }})\u003C\/span\u003E physical damage over {{ e5 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActivation:\u003C\/span\u003E Increases Attack Speed by {{ e2 }}% for {{ e6 }} seconds.","cost":[47,44,41,38,35],"costType":" Mana","cd":[6,6,6,6,6],"range":[600,600,600,600,600],"key":"UdyrQ"},{"name":"Turtle Stance","descr":"Turtle Stance: Activation - Udyr gains a temporary shield that absorbs damage. Persistent Effect - Udyr gains Life Steal.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPersistent Effect: \u003C\/span\u003EGains {{ e2 }}% Life Steal.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActivation: \u003C\/span\u003EGains a shield that absorbs {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E damage for {{ e3 }} seconds.","cost":[47,44,41,38,35],"costType":" Mana","cd":[6,6,6,6,6],"range":[600,600,600,600,600],"key":"UdyrW"},{"name":"Bear Stance","descr":"Bear Stance: Activation - Udyr increases Movement Speed for a short duration. Persistent Effect - Udyr's basic attacks stun his target for 1 second. This effect cannot occur on the same target for several seconds.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPersistent Effect: \u003C\/span\u003EBasic attacks stun the target for {{ e3 }} second. This effect cannot occur on the same target again for {{ e4 }} seconds.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActivation: \u003C\/span\u003EIncreases Movement Speed by {{ e1 }}% and ignores unit collision for {{ e2 }} seconds.","cost":[47,44,41,38,35],"costType":" Mana","cd":[6,6,6,6,6],"range":[600,600,600,600,600],"key":"UdyrE"},{"name":"Phoenix Stance","descr":"Phoenix Stance: Activation - Udyr unleashes pulsing waves of fire, dealing damage to nearby enemies. Persistent Effect - With the first basic attack and every third attack after, Udyr engulfs enemies in front of him with flames.","tooltip":"\u003Cspan class=\"colorFF9900\"\u003EPersistent Effect: \u003C\/span\u003EBurns enemies in front of Udyr on his first basic attack and every third attack after, dealing {{ e2 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a1 }})\u003C\/span\u003E magic damage.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan class=\"colorFF9900\"\u003EActivation: \u003C\/span\u003EUnleashes pulsing waves of fire, dealing {{ e1 }} \u003Cspan class=\"color99FF99\"\u003E(+{{ a2 }})\u003C\/span\u003E magic damage each second to nearby enemies for {{ e5 }} seconds.","cost":[47,44,41,38,35],"costType":" Mana","cd":[6,6,6,6,6],"range":[325,325,325,325,325],"key":"UdyrR"}]}